{
    "cerner": [
        {
            "title": "Lessons learned building an accessible web application framework",
            "date": "9:24:2020",
            "abstract": "\n                Since 2017, we at Cerner have been building Terra, a single page web application framework, and accessibility has always been a primary goal. Over the years we’ve learned a lot about how to build and test accessible websites, as well as the diverse group of people we’re serving. With this blog post, we’d like to take a moment to share what we’ve learned so far.\nWhy accessibility matters At Cerner, we build software for many different users in many different roles.\n            ",
            "link": "https://engineering.cerner.com/blog/lessons-learned-building-an-accessible-web-application-framework/"
        },
        {
            "title": "Creating the Giant LiteBrite",
            "date": "8:26:2020",
            "abstract": "\n                Have you ever wondered what happens when you let two engineers loose on a project with a broad vision and little direction? In our case, LiteBrite happens.\nEvery year Cerner hosts DevCon, an internal 2-day conference for all of Cerner engineering to come together, give talks about technologies, processes, and ideas - all with a little fun sprinkled in. DevCon always has a theme, for 2019 that was set to be “The 80s.\n            ",
            "link": "https://engineering.cerner.com/blog/creating-the-giant-litebrite/"
        },
        {
            "title": "We’re Back with a New Look",
            "date": "8:4:2020",
            "abstract": "\n                If you have been to our blog before, you might notice that it has a new look. Our past version of the site was one that we had used for several years. It utilized Jekyll for the static site generation, which is a popular project that leverages the Ruby ecosystem. Over the last few months, we recognized that our site needed an update. This change wasn’t only with its look and feel, but also with what we used in building the site.\n            ",
            "link": "https://engineering.cerner.com/blog/we-are-back-w-new-look/"
        },
        {
            "title": "ShipIt Day XVII",
            "date": "2:24:2020",
            "abstract": "\n                ShipIt Day, Cerner Engineering’s 24-hour hackathon, provides associates an environment to be creative, work on new projects, and network with other associates. This event is one of the many things that sit at the core of our Engineering Culture at Cerner, and is rapidly growing- now being hosted globally in Romania, Sweden, India, and the UK. In October, our team had the chance to participate in the seventeenth ShipIt Day at Kansas City’s Innovations Campus and managed to take home the Golden Keyboard trophy as the first place team!\n            ",
            "link": "https://engineering.cerner.com/blog/shipit-xvii/"
        },
        {
            "title": "ShipIt Day XVI",
            "date": "11:4:2019",
            "abstract": "\n                Finishing our 16th occurrence of the series, our quarterly ShipIt Day hackathon invites the makers and innovators to come out and share new ways to think about our daily work here at Cerner. Whether it’s experimenting with new features or improving our developer workflows, ShipIt Day gives our engineers a chance to try and learn new things. This ShipIt day in particular had some exciting projects that melded hardware and software.\n            ",
            "link": "https://engineering.cerner.com/blog/shipit-xvi/"
        },
        {
            "title": "Terra UI: A Health-Care focused UI Component Library",
            "date": "10:25:2019",
            "abstract": "\n                Back in 2013, like most other companies, Cerner was heavily invested in building user interfaces with Twitter Bootstrap. Around that time, Dave Rupert wrote about the concept of Responsive Deliverables and touched on a key concept, creating “Tiny Bootstraps, for Every Client”. Along with this, Brad Frost had started promoting the idea of Atomic Design. We saw a lot of value in these ideas and saw that we needed to evolve how we were developing UI at Cerner.\n            ",
            "link": "https://engineering.cerner.com/blog/terra-ui/"
        },
        {
            "title": "Introducing F-Twelve, an Open Source Dev Console",
            "date": "10:8:2019",
            "abstract": "\n                Many modern web browsers come with tools that can help developers debug their websites. If you are using Google Chrome or Firefox for example, try pressing F12. A new panel should open containing various tools. These tools provide a look “under the hood” for the current page. Common tools include a JavaScript console, JavaScript debugger, DOM explorer, network request viewer, performance profile, local storage manager, and more.\n            ",
            "link": "https://engineering.cerner.com/blog/introducing-f-twelve-an-open-source-dev-console/"
        },
        {
            "title": "Carbon Graphs: An Open Source Visualization API",
            "date": "8:27:2019",
            "abstract": "\n                We are pleased to announce Carbon Graphs as an open source code project!\nCarbon is a lightweight, vanilla JavaScript visualization API built with D3 that integrates well with any consumer’s tech stack. It provides a variety of graph types that are framework agnostic and responsive out of the box.\n   Motivation Over the past few years, we have gradually updated our user interface to use modern JavaScript libraries such as mithril.\n            ",
            "link": "https://engineering.cerner.com/blog/carbon-graphs-open-source-visualization-api/"
        },
        {
            "title": "CCL Unit and CCL Testing released to open source",
            "date": "8:9:2019",
            "abstract": "\n                We are pleased to announce the release of CCL Unit and CCL Testing as open source code projects, as well as the release of the CCL Testing plugin artifacts to Maven Central.\nCerner Command Language (CCL) is a database query and scripting language used with Cerner Millennium databases. CCL Unit is a unit testing framework for CCL written in CCL. The CCL Testing plugins generate reports for viewing the results of CCL Unit tests and static analyses of CCL programs and for generating code documentation from comments in the source code for CCL programs.\n            ",
            "link": "https://engineering.cerner.com/blog/ccl-unit-and-ccl-testing-released-to-open-source/"
        },
        {
            "title": "Pi Day 2019: Build your own alarm system",
            "date": "3:14:2019",
            "abstract": "\n                At Cerner Engineering, we love to celebrate Pi Day. This day is not only a fun time to enjoy eating pie and reflecting on mathematical properties, but we also share big announcements internally for our developers conference, DevCon.\nDrew a crowd to celebrate Pi Day this afternoon with snacks, lightning talks, and our DevCon 2018 theme reveal! #314day #cernerdevcon pic.twitter.com/wyy5eLKHVl\n— Cerner Engineering (@CernerEng) March 14, 2018  For this post, we thought it would be fun to share a simple example of how you can hook your existing monitoring system to a physical alarm system powered by a Raspberry Pi.\n            ",
            "link": "https://engineering.cerner.com/blog/pi-day-2019-build-your-own-alarm-system/"
        },
        {
            "title": "ShipIt XIV",
            "date": "3:8:2019",
            "abstract": "\n                It is winter time in Kansas City, which also included our fourteenth edition of ShipIt, our routine hackathon competition we host at Cerner Engineering. Although the snowy weather may have kept participants between the warm walls of our Innovations Campus, the winter storm did not disturb the initiative and enthusiasm of the fourteen participating teams. Check out the video below to hear from ShipIt Day participants and supporters as to why ShipIt Day has become an engineering-wide program that supports Cerner’s development culture.\n            ",
            "link": "https://engineering.cerner.com/blog/shipit-xiv/"
        },
        {
            "title": "DevCon: A tech conference for engineering, by engineering",
            "date": "2:8:2019",
            "abstract": "\n                In 2010 a group of Cerner engineers went to their leadership with an idea: a Cerner tech conference just for the internal development community, built and run from the ground up. The idea for a conference like this had been brewing at Cerner for several years. It was seen as an opportunity to create a large scale, sharing and learning experience for associates in Cerner’s technical workforces.\nFrom the beginning, buy-in from leadership was essential for the conference to succeed.\n            ",
            "link": "https://engineering.cerner.com/blog/devcon-recap/"
        },
        {
            "title": "2^5 Coding Competition 2018",
            "date": "12:14:2018",
            "abstract": "\n                At Cerner, associates are always encouraged to develop tools and methods to improve their productivity. With this year’s theme being “Engineering Productivity,” Cerner’s fourth annual 2^5 Coding Competition provided associates another opportunity to dive into this subject and get involved in Cerner’s development culture.\nAs usual, this year’s 2^5 Coding Competition was kicked off alongside Programmer’s Day festivities on September 13th. The competition lasts 32 days, and associates are encouraged to submit code every day.\n            ",
            "link": "https://engineering.cerner.com/blog/2-to-the-5th-coding-competition-2018/"
        },
        {
            "title": "ShipIt XIII",
            "date": "11:16:2018",
            "abstract": "\n                What does it take to be awarded the ShipIt Day Golden Keyboard?    ShipIt Day XIII concluded last week after an intense 24-hours of brainstorming, building, and presenting. Various projects were completed by Cerner associates across twelve diverse organizations. ShipIt Day XIII’s projects were some of the most technically advanced this competition has ever seen.\nAwarding the Golden Keyboard is no easy job for our judges. Back in 2014, the trophy was created to provide the winning team with a memento that was unique and grew with the competition.\n            ",
            "link": "https://engineering.cerner.com/blog/shipit-xiii/"
        },
        {
            "title": "Our DevCulture Team: Connecting Communities & Empowering Teams to Invent the Future",
            "date": "11:7:2018",
            "abstract": "\n                The tech industry is constantly evolving; for better or worse, there’s no way around it. Now, more than ever, having a culture that fosters collaboration, empowers associates, and supports innovation is vital to a company’s success in the face of such constant change. However, an effective culture must be grown organically while being supported by senior leadership. At Cerner, we recognize the challenges involved in growing an effective, rewarding, and fun culture.\n            ",
            "link": "https://engineering.cerner.com/blog/devculture-team/"
        },
        {
            "title": "Infusing a Culture of Cybersecurity within Cerner Engineering",
            "date": "10:29:2018",
            "abstract": "\n                With October being Cybersecurity Awareness month, we thought it would be a good time to reflect on some of the things we do in engineering to educate our associates and infuse security into our culture. We have over 28,000 associates worldwide supporting hundreds of solutions with millions of lines of code. Each associate has a specialization, such as software development, system support, and consulting. Keeping everyone up to date on the latest in security is a difficult task.\n            ",
            "link": "https://engineering.cerner.com/blog/culture-of-cybersecurity/"
        },
        {
            "title": "Girl Scouts earn Cybersecurity Badge at Cerner",
            "date": "10:5:2018",
            "abstract": "\n                As a software engineering executive from Colombia, I thought that the best way to honor Hispanic Heritage Month (September 15-October 15) was to help the local Girl Scout Hispanic troops earn one of the new cybersecurity badges. October is Cybersecurity Awareness Month, having the activities nearing October seemed very fitting.\nGirl Scouts has been focusing on STEM badges for all ages with several new initiatives in the past couple of years.\n            ",
            "link": "https://engineering.cerner.com/blog/girl-scouts-cybersecurity/"
        },
        {
            "title": "SSH Steps for Jenkins Pipeline",
            "date": "9:20:2018",
            "abstract": "\n                Pipeline-as-code or defining the deployment pipeline through code rather than manual job creation through UI, provides tremendous benefits for teams automating builds and deployment infrastructure across their environments.\n Source of image\n   Jenkins Pipelines Jenkins is a well-known open source continuous integration and continuous deployment automation tool. With the latest 2.0 release, Jenkins introduced the Workflow plugin that implements Pipeline-as-code. This plugin lets you define delivery pipelines using concise scripts which deal elegantly with jobs involving persistence and asynchrony.\n            ",
            "link": "https://engineering.cerner.com/blog/ssh-steps-for-jenkins-pipeline/"
        },
        {
            "title": "Summer of Engineering Health: A Software Intern's Story",
            "date": "7:26:2018",
            "abstract": "\n                Pratik will be starting his Junior year at the University of Michigan this Fall studying Computer Science and Biomedical Engineering. This summer he’s a Software Intern on Cerner’s LightsOn Network team. This is the story of his summer experience:\nAs a college student, it’s not every day that you get to work on cutting edge technology to transform healthcare as we know it. Every morning, I walk past a wall on the way to the elevator: “Health care is too important to stay the same.\n            ",
            "link": "https://engineering.cerner.com/blog/summer-of-engineering-health-intern-story/"
        },
        {
            "title": "Scalable Data Science with FHIR",
            "date": "7:2:2018",
            "abstract": "\n                The FHIR standard started as a better way to exchange healthcare data, but it also provides a solid basis for deep analytics and Machine Learning at scale. This post looks at an example from the recent FHIR DevDays conference that does just that. You can also run the interactive FHIR data engineering tutorial used in the conference yourself.\nOur first step is to bring FHIR data into a data lake – a computational environment where our analysis can easily and efficiently work through petabytes of data.\n            ",
            "link": "https://engineering.cerner.com/blog/data-engineering-with-bunsen/"
        },
        {
            "title": "Cerner's Open Source Contributions for Interoperability Developers",
            "date": "6:21:2018",
            "abstract": "\n                Open source and open standards encourage collaboration around innovation that advances the health care industry through improved interoperability. Developers across health care can come together and use open source code to share information, as well as develop and continually improve apps to support better health outcomes for patients.\nAt Cerner, developing open platforms that support interoperability standards like SMART® and FHIR® is integral to our mission of transforming health care. In addition to implementing these standards in our platforms, we also participate in organizations like HL7 and the Argonaut Project to help shape and develop these standards.\n            ",
            "link": "https://engineering.cerner.com/blog/cerners-open-source-contributions-for-interoperability-developers/"
        },
        {
            "title": "SREcon18 Recap",
            "date": "6:19:2018",
            "abstract": "\n                This past spring, I had the pleasure of attending SREcon18 in Santa Clara, California. If you have never heard about SREcon or the term SRE then let me diverge for a moment to describe. SRE, or Site Reliability Engineer, was coined by Google employees back in 2003 when a team of software engineers were tasked with running a production environment. It’s the new hotness in the technology world, so an internet search will turn up a bunch of topics.\n            ",
            "link": "https://engineering.cerner.com/blog/srecon18-recap/"
        },
        {
            "title": "Say Hello to the 2018 Summer Interns",
            "date": "5:24:2018",
            "abstract": "\n                Throughout the month of May, teams across Cerner’s Engineering space have welcomed 197 software interns to our campuses in Kansas City and Malvern. Ranging from rising seniors in high school to rising seniors in college, these interns will be working alongside Cerner’s full time engineers to enhance and expand upon their current skillsets.\nWhile interning at Cerner, these associates will experience firsthand the look and feel of a day in the life of a full time software engineer.\n            ",
            "link": "https://engineering.cerner.com/blog/say_hello_to_the_2018_summer_interns/"
        },
        {
            "title": "Code Reviews: There is a Better Way",
            "date": "5:8:2018",
            "abstract": "\n                At Cerner, peer review of code is an important job. We have found it to greatly improve the quality of code and improve a team’s knowledge of the codebase. Through code review discussions, newer engineers are able to learn on valuable areas to question or challenge when something is being changed. While we heavily embrace the practice of peer code review, we also recognize it can make an engineer’s life challenging when you are overwhelmed with code to review.\n            ",
            "link": "https://engineering.cerner.com/blog/code-reviews-there-is-a-better-way/"
        },
        {
            "title": "ShipIt XI Day: Spring 2018",
            "date": "4:18:2018",
            "abstract": "\n                On March 8th and 9th, 17 teams of Cerner associates competed for the Golden Keyboard during our 11th ShipIt Day. During this 24-hour hackathon, associates were challenged to create something innovative, usable, and value-adding. This was the fourth ShipIt held at our new Innovations Campus, leveraging the wonderful collaborative spaces available.\nWith Shipit XI, we expanded upon a time-honored tradition of this event, the traveling trophy Golden Keyboard.\n            ",
            "link": "https://engineering.cerner.com/blog/shipit-xi-spring-2018/"
        },
        {
            "title": "Cerner and iControl",
            "date": "3:13:2018",
            "abstract": "\n                At Cerner, we manage our own infrastructure and a big part of that is managing F5 load balancers. If you are a Ruby developer or a network engineer and regularly work with F5s, then I have good news! I’ve created a gem that abstracts iControl’s REST API. It makes working with the API easy to understand and eases the effort required to automate changes across many devices.\n1 2  api = IcontrolRest::Client.\n            ",
            "link": "https://engineering.cerner.com/blog/cerner-and-icontrol/"
        },
        {
            "title": "One Year Calling Innovations Home",
            "date": "2:28:2018",
            "abstract": "\n                One year ago this month, Cerner development associates in Kansas City moved into a new place to call home for their workdays, Innovations Campus. The first two towers that stand on this campus provide 805,000 square feet of workspace for more than 3,000 associates. Eventually, the campus will grow larger, including 16 buildings and 16,000 Cerner associates. As that growth approaches, it is important to reflect on what these first two towers represent for associates and their development careers at Cerner.\n            ",
            "link": "https://engineering.cerner.com/blog/one-year-calling-innovations-home/"
        },
        {
            "title": "Cerner Open Sources its Kafka Utilities",
            "date": "2:6:2018",
            "abstract": "\n                At Cerner, we often make use of many open source projects in our infrastructure. I work on a team responsible for Cerner’s Ingestion Platform, a critical piece of infrastructure that takes in TBs of data and over a billion messages per day. The platform’s responsibility is then to make this data available for downstream teams to consume. When designing the Ingestion Platform, we felt Apache Kafka was perfect for ingesting and consuming these massive streams of data.\n            ",
            "link": "https://engineering.cerner.com/blog/cerner-open-sources-its-kafka-utilities/"
        },
        {
            "title": "Cerner and the SDLC",
            "date": "1:23:2018",
            "abstract": "\n                Cerner has a very compelling story that many want to learn from. Cerner’s Agile Champions are regular presenters at local, national, and global conferences. We routinely host calls and site visits for interested companies around the world who want to figure out how we were able to adopt Agile so quickly and sustain it so successfully.\nDespite our success, there has been a general feeling at the engineering leadership and Agile Champion tiers that we aren’t getting the benefits from Agile that we once were.\n            ",
            "link": "https://engineering.cerner.com/blog/cerner-and-the-sdlc/"
        },
        {
            "title": "Bad Design is Bad for Your Health: Why Data Visualization Details Matter",
            "date": "1:4:2018",
            "abstract": "\n                Presentation Abstract by Jody Butts, Sr. User Experience Designer Given on August 11, 2017 at the UX Australia Conference in Sydney\nFull presentation audio and slides are available here: http://www.uxaustralia.com.au/conferences/uxaustralia-2017/presentation/bad-design-is-bad-for-your-health-why-data-visualization-details-matter/\nThe proper design of data visualization details is imperative for accurate and actionable data visualizations and dashboards. In the health care technology industry, even the smallest design detail on a graph of patient data can have a dramatic impact on patient safety and outcomes.\n            ",
            "link": "https://engineering.cerner.com/blog/bad-design-is-bad-for-your-health-why-data-visualization-details-matter/"
        },
        {
            "title": "2^5 Coding Competition 2017: 32 lines or less",
            "date": "12:19:2017",
            "abstract": "\n                The Competition Part of Cerner’s engineering culture is to celebrate technology. This past fall, we had our annual celebration for Programmers’ Day. We celebrated the day with great food (taco bar and ice cream) and an evening of trivia.\nTopping off Programmers' Day with a taco bar and trivia night with @geekswhodrink pic.twitter.com/pSjqBVBHxK\n— Cerner Engineering (@CernerEng) September 13, 2017  Happy Programmers' Day! Celebrating with an ice cream social. pic.\n            ",
            "link": "https://engineering.cerner.com/blog/2-to-the-5th-coding-competition-2017/"
        },
        {
            "title": "Announcing Bunsen: FHIR Data with Apache Spark",
            "date": "11:27:2017",
            "abstract": "\n                We’re excited to open source Bunsen, a library to make analyzing FHIR data with Apache Spark simple and scalable. Bunsen encodes FHIR resources directly into Apache Spark’s native data structures. This lets users leverage well-defined FHIR data models directly within Spark SQL.\nHere’s a simple query against a table of FHIR observations that produces a table of heart rate values:\nspark.sql(\"\"\" select subject.reference person_id, effectiveDateTime date_time, valueQuantity.value value from observations where in_valueset(code, 'heart_rate') \"\"\").\n            ",
            "link": "https://engineering.cerner.com/blog/announcing-bunsen-fhir-data-with-apache-spark/"
        },
        {
            "title": "Celebrating World Usability Day at Cerner",
            "date": "11:14:2017",
            "abstract": "\n                World Usability Day is celebrated worldwide on the second Thursday in November every year. Across the globe, organizations host events and use this day to provide education on how to make products easier to use and simpler to access, as well as to celebrate progress in this pursuit.\nThe World Usability Day theme for 2017 was “Inclusion.” Inclusive design considers the range of abilities, language and other forms of human difference when creating a solution.\n            ",
            "link": "https://engineering.cerner.com/blog/celebrating-world-usability-day-at-cerner/"
        },
        {
            "title": "Accessibility and Usability: On the Road to Great UX",
            "date": "10:9:2017",
            "abstract": "\n                In 2010, a group of designers from Columbus, Ohio set out to create a grassroots, cross-discipline, and creative conference. Since that first event, Midwest UX has been an ongoing tradition that attracts innovative ideas and provides an opportunity for regional professions to engage in discussion with other professionals. Last year, Amber Wilks and Dr. Becca Green were invited to take their talk from DevCon 2016 on the road to Midwest UX.\n            ",
            "link": "https://engineering.cerner.com/blog/accessibility-and-usability-on-the-road-to-great-ux/"
        },
        {
            "title": "Jwala Joins Cerner's Open Source",
            "date": "9:27:2017",
            "abstract": "\n                Introducing Jwala, a Resource Manager for the Apache Community Apache Tomcat and Apache httpd are hardened, scalable, and reliable open-source solutions. Widely adopted, these solutions are commonly used to host and load-balance Java applications.\nConfiguring and managing a small set of elements is relatively easy, but once you start scaling out your application and platform, things get complicated. Questions such as “How do I update the heap or database pool-size across hundreds of Java Virtual Machines (JVMs)?\n            ",
            "link": "https://engineering.cerner.com/blog/jwala-joins-cerner-open-source/"
        },
        {
            "title": "Engineers Overseas for SMART and FHIR (FHIR DevDays 2016)",
            "date": "9:21:2017",
            "abstract": "\n                In a previous post, we discussed the need to provide education around our ecosystem and implementation of the FHIRⓇ and SMARTⓇ standards for developers and how we did so at our annual Cerner Health Conference. That same week, we were also a part of FHIR DevDays, which included a track entitled “Apps in the EHR.” We worked alongside track participants who were seeking to integrate their apps in a variety of EHRs, including Cerner.\n            ",
            "link": "https://engineering.cerner.com/blog/engineers-overseas-for-smart-and-fhir/"
        },
        {
            "title": "Continuous Delivery for DC/OS with Spinnaker",
            "date": "9:8:2017",
            "abstract": "\n                Last fall our team (Mike Tweten, Trevin Teacutter, and Zameer Sura) started working on the problem of automating DC/OS deployments in a way that wouldn’t require multiple teams to duplicate effort and tie themselves directly to DC/OS APIs. While DC/OS certainly makes the act of deploying an application much easier than anything we’ve used previously, there are still many different ways you could choose to layer on deployment strategies and integrate with continuous delivery systems.\n            ",
            "link": "https://engineering.cerner.com/blog/continuous-delivery-for-dcos-with-spinnaker/"
        },
        {
            "title": "Structure Matters: How Cerner Handled Too Much Health Data in HBase",
            "date": "8:28:2017",
            "abstract": "\n                Background In order to manage the health of populations, Cerner builds data-driven solutions built on top of its HealtheIntent℠ platform. The platform transforms and standardizes data across disparate health systems. The data is then used in algorithms that aid healthcare providers and hospitals in managing and monitoring health both at a person and population level.\nThe Reference Record is one of the core components of the HealtheIntent platform. It represents the data known about a person’s health from a particular source of healthcare information.\n            ",
            "link": "https://engineering.cerner.com/blog/structure-matters-how-cerner-handled-too-much-health-data-in-hbase/"
        },
        {
            "title": "Managing Splunk's Knowledge",
            "date": "7:14:2017",
            "abstract": "\n                When we first were given access to Splunk we were excited about all the functionality it could provide our team to help us monitor and debug our applications. We created alerts to email us if our applications are logging errors, dashboards to show health or metrics of our services, and field extractions as well as tags to make searching easier. As we created more and more of these Splunk knowledge objects we started to have issues.\n            ",
            "link": "https://engineering.cerner.com/blog/managing-splunk-knowledge/"
        },
        {
            "title": "You May Not Be a Polyglot, but Your Code Needs to Be",
            "date": "7:7:2017",
            "abstract": "\n                Last October, I had the privilege to speak at Grace Hopper, the world’s largest gathering of women technologists. It was impressive to see 15,000 fellow female technologists gather together to share their experiences and technical expertise. To look into the audience, and see a room full of other female engineers was a great experience!\nMy talk was titled, You May Not Be a Polyglot, but Your Code Needs to Be (previously presented at Midwest.\n            ",
            "link": "https://engineering.cerner.com/blog/you-may-not-be-a-polyglot-but-your-code-needs-to-be/"
        },
        {
            "title": "ShipIt VIII Day: Spring 2017",
            "date": "5:17:2017",
            "abstract": "\n                ShipIt Day VIII was held on April 20 and 21st. Seventeen teams made up of internal associates had just 24 hours to create something innovative, usable, and value-adding. This quarter’s ShipIt Day was held at our new Innovations Campus in the Link Conference Center. We were excited to get to utilize the space for this event. Another awesome addition to this quarter’s ShipIt Day was our new game rooms.\n            ",
            "link": "https://engineering.cerner.com/blog/shipit-day-viii-spring-2017/"
        },
        {
            "title": "Influencing the Young, Spanish-speaking Female Generation",
            "date": "5:11:2017",
            "abstract": "\n                Outside of work, married couple Denisse Osorio de Large, a Cerner Director in Population Health Development, and Steven Large, a Cerner Senior Director in IP Development, are passionate about creating a younger generation that is passionate about technology and introducing them to the vast world of opportunities in software development. In addition to volunteering in the STEM community, helping organize Cerner’s development conference (DevCon), and speaking at conferences, Denisse and Steven enjoy working with children in the spanish-speaking community.\n            ",
            "link": "https://engineering.cerner.com/blog/influencing-the-young-spanish-seaking-female-generation/"
        },
        {
            "title": "Influyendo en una generación de jovencitas de habla hispana",
            "date": "5:11:2017",
            "abstract": "\n                Cuando no están trabajando, Denisse Osorio de Large, Directora de Cerner en Desarrollo de Salud Poblacional y Steven Large, Director sénior de Desarrollo de IP, quienes están casados, tienen como pasión crear una generación joven motivada por la tecnología y mostrarle a la misma el amplio mundo de oportunidades existentes en el desarrollo de software. Además de dar su tiempo como voluntarios en la comunidad promotora del área de ciencias, tecnología, ingeniería y matemáticas (STEM), contribuyen a organizar la conferencia de desarrollo de Cerner (DevCon) y realizan presentaciones en conferencias, Denisse y Steven disfrutan trabajar con niños de la comunidad de habla hispana.\n            ",
            "link": "https://engineering.cerner.com/blog/influyendo-en-una-generacion-de-jovencitas-de-habla-hispana/"
        },
        {
            "title": "One Cerner Style Icons: The future of icons at Cerner",
            "date": "4:6:2017",
            "abstract": "\n                One Cerner Style Icons (OCS Icons) are foundational UI elements required to produce a cohesive and consistent User Experience for Cerner Solutions. OCS Icons consist of a comprehensive icon library of platform agnostic assets which can be easily consumed by development teams.\nWhy? The primary goal of this effort to elevate every aspect of the UI to create the best possible user experience. In order to do that, it is imperative to develop a system composed of strong design patterns and well-founded user research.\n            ",
            "link": "https://engineering.cerner.com/blog/one-cerner-style-icons/"
        },
        {
            "title": "Version Databag - A Chef Release Process",
            "date": "4:4:2017",
            "abstract": "\n                At Cerner, we use Chef. In fact, we’re heavily ingrained with Chef in our configuration management practices. We deploy services from Tomcat to Kafka with Chef. Even the first open source project we announced was a tool for Chef!\nWith all of this integration with Chef, we need a simple way to manage all of those versions. This is where the Version Databag cookbook comes in. At a high level, this cookbook allows us to define our versions in a centralized data bag (grouped under conceptual units) and populates the corresponding node attributes required with those versions at runtime.\n            ",
            "link": "https://engineering.cerner.com/blog/version-databag-a-chef-release-process/"
        },
        {
            "title": "One Cerner Associate's Contributions in the Tech Industry",
            "date": "3:16:2017",
            "abstract": "\n                Background: Micah is currently a software architect in Population Health Development in Healthe Intent Development at Cerner. In 2013, Micah Whitacre received committer status on the Apache Crunch project, and is now a Project Management Committee (PMC) member of the project.\nHow has Cerner been been involved in Apache Crunch? In 2012 and 2013, Cerner started using this project within several solutions. We also wanted to give back to the community and decided to invest time in helping answer questions and concerns, and overall project needs.\n            ",
            "link": "https://engineering.cerner.com/blog/micah-whitacre-recognition-blog/"
        },
        {
            "title": "Automated Deployment with Apache Kafka",
            "date": "2:16:2017",
            "abstract": "\n                It’s likely not a surprise that Cerner would use Apache Kafka as we have used a number of related technologies like Apache Hadoop along with its Map/Reduce, HDFS and even Apache HBase. Our team first started using Apache Kafka in 2014 when Kafka 0.8 first came out. Since then we’ve expanded to using Kafka for a number of different use cases (1, 2) and it has become a core piece of Cerner’s infrastructure.\n            ",
            "link": "https://engineering.cerner.com/blog/automated-deployment-with-apache-kafka/"
        },
        {
            "title": "Beadledom - Simple Java framework for building REST APIs",
            "date": "2:15:2017",
            "abstract": "\n                Beadledom is a framework for building Java based web services. It bundles several open sourced components required for building JAX-RS services.\nWhy? HealtheIntent, Cerner’s population health management platform, started 3.5 years ago. We went through the process of investigating different technologies for the platform. We decided on using Java for building services and arrived on a set of libraries that we believed work well together.\nThe long history of Java has led to an ocean of libraries that are available to Java developers.\n            ",
            "link": "https://engineering.cerner.com/blog/beadledom-simple-java-framework-for-building-rest-apis/"
        },
        {
            "title": "ShipIt VII Day: Winter 2016",
            "date": "1:18:2017",
            "abstract": "\n                Cerner’s 7th ShipIt Day took place on December 8th and 9th. ShipIt is a 24-hour hackathon with the goal of building something awesome, usable, and value-adding within a single day. The event was hosted at our DevCenter in the Realization Campus, a large open space that hosts our DevAcademy (to learn more about our DevAcademy, check out this earlier post). We had 18 teams made up of associates from different Cerner organizations.\n            ",
            "link": "https://engineering.cerner.com/blog/shipit-vii-day-winter-2016/"
        },
        {
            "title": "Alan and Grace: An Origin Story",
            "date": "11:23:2016",
            "abstract": "\n                Meet Alan and Grace. These lighthearted, 8-bit characters were nominated in early 2014 to become the iconic mascots of Engineering at Cerner. Have you ever wondered who these 80’s video gaming inspired characters on our Engineering t-shirts are? Why were they chosen as mascots? What do they represent? The countless hours spent pondering these questions will be no more. Pull up a chair as we dive into the mystery behind the dynamic duo known as Alan and Grace.\n            ",
            "link": "https://engineering.cerner.com/blog/alan-and-grace-an-origin-story/"
        },
        {
            "title": "Clara Rules joins Cerner's open source",
            "date": "11:11:2016",
            "abstract": "\n                Sometimes a small experiment on the side can grow into something valuable. We at Cerner have long used forward-chaining rules engines to express and execute clinical knowledge, but we’ve also had to extend or work around the capabilities of such engines. Engines targeting business users just weren’t expressive enough to model some of our logic. To meet this need we are making Clara Rules an open source project driven by Cerner Engineering.\n            ",
            "link": "https://engineering.cerner.com/blog/clara-rules-joins-cerner-open-source/"
        },
        {
            "title": "Fall 2016 ShipIt Day",
            "date": "11:8:2016",
            "abstract": "\n                Another ShipIt Day was held on September 8th-9th at the Realization Campus at Cerner. ShipIt is a 24-hour hackathon with the goal of building something awesome, usable, and value-adding within a single day. This fall marked our sixth ShipIt, which has has grown significantly since our first event.\n   The event kicked off in the morning at the auditorium of our Realization campus. At this point, teams were already formed, instructions were given, and shirts were handed out.\n            ",
            "link": "https://engineering.cerner.com/blog/fall-2016-shipit-day/"
        },
        {
            "title": "Building a Unified UI Component Library: Lessons Learned",
            "date": "10:13:2016",
            "abstract": "\n                Cerner is building an open source, mobile-first user interface component library for healthcare applications. Pulling years of experience and lessons learned across multiple teams together, we are creating something great. We are very excited to bring this solution to the public and to be contributing back to the community!\nWe didn’t simply decide to create this library, we started with segmented UI libraries focused on different aspects of the company which had smaller isolated needs.\n            ",
            "link": "https://engineering.cerner.com/blog/building-a-unified-ui-component-library/"
        },
        {
            "title": "Michelle Brush receives the Rising Trendsetter STEMMY award!",
            "date": "10:2:2016",
            "abstract": "\n                We are excited to congratulate our own Michelle Brush for receiving the Rising Trendsetter STEMMY award. The Rising Trendsetter Award is given to a woman in STEMM areas with less than 20 years of experience and has demonstrated significant achievements early in their career.\nMichelle is a director at Cerner who manages an engineering team in population health as well as a team dedicated to improving Cerner’s development culture. One of Michelle’s most notable career accomplishments was her leadership role in reconstructing Cerner’s software engineer development program in 2013, which she personally oversaw until the end of 2014 (read about the details of this program in her blog).\n            ",
            "link": "https://engineering.cerner.com/blog/michelle-brush-receives-the-rising-trendsetter-stemmy-award/"
        },
        {
            "title": "Difficult Debugging: Learning From Utter Nonsense",
            "date": "7:13:2016",
            "abstract": "\n                Preface As software engineers we invest time into thinking about the problems we are trying to solve every day. Sometimes the problems we face are small or simple. Other times they are large and complex. Either way, we can usually draw from our experience to find a path forward.\nWhile coding, we run into a lot of different bugs. Often, they are simple typos or a misuse of an API. These problems do not bog us down very much, and they are quick and easy to fix.\n            ",
            "link": "https://engineering.cerner.com/blog/difficult-debugging/"
        },
        {
            "title": "RailsConf 2016 Recap",
            "date": "5:19:2016",
            "abstract": "\n                At Cerner, we love Ruby and Rails and use it prominently in our cloud based solutions. When we found out RailsConf 2016 was going to be held in the hometown of Cerner’s headquarters in Kansas City, Missouri, we were excited for the opportunity to support the conference by attending as well as being a sponsor and hosting one of the official after parties.\n   RailsConf 2016 took place in the heart of downtown Kansas City.\n            ",
            "link": "https://engineering.cerner.com/blog/railsconf-2016-recap/"
        },
        {
            "title": "Spring 2016 ShipIt Day",
            "date": "4:18:2016",
            "abstract": "\n                ShipIt Day is an all day, all night hackathon with the goal of building something awesome, usable, and value-adding within the given 24 hours. This Spring marked our fifth ShipIt Day, with participation and reach growing with each event.\nWe kicked off the event at 10 AM on Thursday, when teams broke out and got to work and stopped only for food and caffeine. Many stayed until a few hours after dinner arrived, several stayed all night and took naps in their workspace, and a few worked through the whole night.\n            ",
            "link": "https://engineering.cerner.com/blog/spring-2016-shipit-day/"
        },
        {
            "title": "Deploying Web Services with Apache Tomcat and Chef",
            "date": "2:4:2016",
            "abstract": "\n                Open source is an important part of our engineering culture and we love when we’re able to contribute back to the community. We recently open sourced our Tomcat Chef Cookbook, which we use to automate deploying many of our web services here at Cerner. The cookbook is meant to be simple, yet flexible enough to change most anything about Apache Tomcat to your liking. It supports installing any version of Tomcat, configuring any file within the Tomcat installation and deploying web applications.\n            ",
            "link": "https://engineering.cerner.com/blog/deploying-web-services-with-apache-tomcat-and-chef/"
        },
        {
            "title": "Girls in Technology Movement - Hour of Code",
            "date": "1:20:2016",
            "abstract": "\n                As a female Software Engineer, I know the benefits of having other females in the field to fellowship with as well as the benefits of early exposure to coding and the technology field. The Girls in Technology Movement Hour of Code event held December 9th, 2015 at Cerner’s Innovation Campus was a great opportunity for girls from nearby schools to gather and hear a little about the technology industry, the opportunities available for their future, meet some women in the industry, and get a hands-on introduction to coding.\n            ",
            "link": "https://engineering.cerner.com/blog/girls-in-technology-movement-hour-of-code/"
        },
        {
            "title": "Identifying Network ACL Issues with Chef Locally",
            "date": "11:17:2015",
            "abstract": "\n                At Cerner, we use Chef to automate our deployments across a very large distributed system comprised of many thousands of nodes. While we employ ServerSpec and Test Kitchen extensively to test our Chef recipes, this still doesn’t identify all possible failure scenarios. In a large distributed system such as ours, we occasionally run into connectivity failures between machines due to network ACL issues. This could be due to a variety of reasons.\n            ",
            "link": "https://engineering.cerner.com/blog/identifying-network-acl-issues-with-chef-locally/"
        },
        {
            "title": "JavaScript Logging: We can do better!",
            "date": "7:20:2015",
            "abstract": "\n                Currently in the world of JavaScript these options are what we most commonly use to generate logs:\n console.log console.info console.warn console.error  These are actually pretty good in most modern browsers. Even if you go back to Internet Explorer 8 console.log and friends work as long as you have the developer tools open.\nGiven that we have these logging utilities what is the problem with using them? When in local development these are just fine for helping debug and speed up development.\n            ",
            "link": "https://engineering.cerner.com/blog/javascript-logging-we-can-do-better/"
        },
        {
            "title": "Managing 30,000 Logging Events per Day with Splunk",
            "date": "1:29:2015",
            "abstract": "\n                Our team works on a patient facing web application with a thousand live clients with 2,315,000+ users. On an average, the high traffic results into more than 40,000 visits and 300,000 page views daily generating about 30,000 logging events. A considerable portion of these events are of information and warning level in order to aid proactive monitoring or identify potential issues due to clients’ misconfiguration.\nBefore Splunk To handle this large volume of logging, our team created a rotational support role to manually monitor the logs at regular intervals daily.\n            ",
            "link": "https://engineering.cerner.com/blog/managing-30000-logging-events-per-day-with-splunk/"
        },
        {
            "title": "Cerner and the Apache Software Foundation",
            "date": "10:28:2014",
            "abstract": "\n                At the beginning of this year, [we announced that Cerner became a bronze-level sponsor]({%post_url 2014-01-28-sponsoring-the-apache-software-foundation%}) of the non-profit Apache Software Foundation (ASF). Many of the open source projects we use and contribute to are under the ASF umbrella, so supporting the mission and work of the ASF is important to us.\nWe’re happy to announce that Cerner has now increased our sponsorship of the ASF to become a silver-level sponsor. Open source continues to play an integral role in both our architecture and engineering culture.\n            ",
            "link": "https://engineering.cerner.com/blog/cerner-and-the-apache-software-foundation/"
        },
        {
            "title": "Intern HackFest 2014",
            "date": "9:8:2014",
            "abstract": "\n                Ten teams of two to four Cerner interns competed in a week-long HackFest this summer, working to solve any problem they put their minds to. This competition cumulated in a presentation and judging of projects, with prizes of Raspberry Pi Kits for each member of the second place team and Leap Motions for each member of the winning team. From mobile apps, to machine learning algorithms, to drones…this year’s Summer Intern HackFest has been one for the books.\n            ",
            "link": "https://engineering.cerner.com/blog/intern-hackfest-2014/"
        },
        {
            "title": "The Plain Text is a Lie",
            "date": "8:2:2014",
            "abstract": "\n                There is no such thing as plain text “But I see .txt files all the time” you say. “My source code is plain text” you claim. “What about web pages?!” you frantically ask. True, each of those things is comprised of text. The plain part is the problem. Plain denotes default or normal. There is no such thing. Computers store and transmit data in a number of methods; each are anything but plain.\n            ",
            "link": "https://engineering.cerner.com/blog/the-plain-text-is-a-lie/"
        },
        {
            "title": "ShipIt - 24-hour hackathon for Millennium+ Platform Dev",
            "date": "7:1:2014",
            "abstract": "\n                At the end of March, some of our teams held their first 24-hour hackathon, titled ShipIt: Millennium+ Services FedEx Day. We had 41 participants, in 15 teams working on 15 unique projects. The idea was inspired by several teams spending a few hours every so often to work on different projects. After reading about Atlassian’s hack days, we decided to hold one.\nThe event was initially announced early in February, to give teams time to work this into their project plans.\n            ",
            "link": "https://engineering.cerner.com/blog/shipit-hackathon-mplus/"
        },
        {
            "title": "Scaling People with Apache Crunch",
            "date": "5:9:2014",
            "abstract": "\n                Starting the Big Data Journey When a company first starts to play with Big Data it typically involves a small team of engineers trying to solve a specific problem. The team decides to experiment with scalable technologies either due to outside guidance or research which makes it applicable to their problem. The team begins with the basics of Big Data spending time learning and prototyping. They learn about HDFS, flirt with HBase or other NoSQL, write the required WordCount example, and start to figure out how the technologies can fit their needs.\n            ",
            "link": "https://engineering.cerner.com/blog/scaling-people-with-apache-crunch/"
        },
        {
            "title": "Migrating from Eclipse 3.X to Eclipse 4.X - The iAware Story",
            "date": "3:18:2014",
            "abstract": "\n                This is the blog form of the talk Migrating from Eclipse 3.X to Eclipse 4.X - The iAware Story at EclipseCon 2014.\nThe iAware development team was formed in late 2007 and in a little under six months we developed our first solution, CareAware CriticalCare, a dashboard application written using the Eclipse RCP targeted for use in ICU settings. The goal of this application was to provide clinicians with a complete picture of the patient’s status and to do it in a manner that was contextually relevant; meaning that related information was presented together.\n            ",
            "link": "https://engineering.cerner.com/blog/migrating-from-eclipse-3.x-to-eclipse-4.x-the-iaware-story/"
        },
        {
            "title": "Sponsoring the Apache Software Foundation",
            "date": "1:28:2014",
            "abstract": "\n                Open source plays an integral role within engineering at Cerner. In addition to using open source software throughout our architecture, we recently released a few projects back to the community via our Github organization.\nToday, we’re happy to announce that Cerner is now a sponsor of the non-profit Apache Software Foundation (ASF). The ASF is home to several projects that are essential components in many of our systems. We’ve blogged previously about several of these projects: Hadoop, HBase, Crunch, Maven, and Storm.\n            ",
            "link": "https://engineering.cerner.com/blog/sponsoring-the-apache-software-foundation/"
        },
        {
            "title": "The Raft Protocol: A Better Paxos?",
            "date": "1:24:2014",
            "abstract": "\n                Among the many compelling talks that attendees come to expect every year at the Strange Loop conference was a session given by Ben Johnson that provided an overview of a new distributed consensus protocol originating from research at Stanford University, named Raft.\nWhat is distributed consensus? Distributed consensus can be described as the act of reaching agreement among a collection of machines cooperating to solve a problem. With the rise of open source distributed computing and storage platforms, consensus algorithms have become essential tools for replication, and thus, serve to enhance resiliency by eliminating single points of failure.\n            ",
            "link": "https://engineering.cerner.com/blog/the-raft-protocol-a-better-paxos/"
        },
        {
            "title": "Cerner and Open Source",
            "date": "1:16:2014",
            "abstract": "\n                (This post was written by Nathan Beyer, Bryan Baugher and Jacob Williams.)\nThe use of open source software has become nearly ubiquitous in contemporary software development and it is no different for us, here at Cerner. We have been using open source software, directly and indirectly, for decades. Over the past decade, we’ve grown in maturity both in our use of open source software as well as our participation in open source communities.\n            ",
            "link": "https://engineering.cerner.com/blog/cerner-and-open-source/"
        },
        {
            "title": "Cerner Tech Talks",
            "date": "11:12:2013",
            "abstract": "\n                We are always looking for ways to share knowledge and learn new things within engineering at Cerner. Whether that be through meetups, lunch & learns, conferences, or DevCon, we have a variety of outlets available to us.\nToday, we’re announcing a new program we recently launched: Cerner Tech Talks.\nCerner Tech Talks brings in great speakers for talks that would be of interest to engineers at Cerner. These talks will be held periodically and will vary widely in their content.\n            ",
            "link": "https://engineering.cerner.com/blog/cerner-tech-talks/"
        },
        {
            "title": "Project Lead the Way",
            "date": "9:11:2013",
            "abstract": "\n                Improving the state of healthcare through innovation requires investing in others to join you on the journey; not just for today, but for the decades to come.\n   Project Lead the Way has established the Computer Science and Software Enginering course that teaches computational thinking to high school students, and it will pilot in 60 schools across the country this fall. Providing exposure to a wide variety of computational and computer science concepts, students can program a story or game in Scratch, write a mobile application for Android, and learn about knowledge discovery and data mining, computer simulation, cybersecurity, GUI programming, web development, version control, and agile software development.\n            ",
            "link": "https://engineering.cerner.com/blog/project-lead-the-way/"
        },
        {
            "title": "DevCon",
            "date": "8:26:2013",
            "abstract": "\n                This past June, 2,500 associates from across Cerner came together for DevCon, our internal developers conference. Now in its 3rd year, DevCon is a two-day, engineering-led conference that was created to bring together Cerner associates involved in all aspects of development and technology. DevCon is organized and run like many other developer conferences, complete with a call for papers and a talk selection committee. This year, we had 80 talks covering a wide array of topics such as big data, user experience and design, DevOps, and mobile development.\n            ",
            "link": "https://engineering.cerner.com/blog/devcon/"
        },
        {
            "title": "DevAcademy",
            "date": "8:14:2013",
            "abstract": "\n                When I graduated from college, I thought I understood what it meant to develop software in the real world. It required process. It required troubleshooting. It required quality. However, to me, process meant waterfall. Troubleshooting meant trying a few things and then asking for help. Quality meant manual testing.\nAgile methods were not unheard of when I graduated in 2001. My professors noted that iterative development was better than waterfall; they just only taught waterfall.\n            ",
            "link": "https://engineering.cerner.com/blog/devacademy/"
        },
        {
            "title": "The 30 Days of Code Experiment",
            "date": "8:6:2013",
            "abstract": "\n                In software development, we solve problems. As we solve these problems, we build connections in our minds of how to look at a problem, relate it to previous problems and solutions, and re-apply past approaches and techniques.\nThese behavior habits build dogmatic ways of thinking and limit design choices to selective technologies we’ve used in the past. As we all know, you have to continually learn new technologies and different ways of thinking to stay current in the ever-changing landscape of software development.\n            ",
            "link": "https://engineering.cerner.com/blog/the-30-days-of-code-experiment/"
        },
        {
            "title": "Thinking in MapReduce",
            "date": "7:31:2013",
            "abstract": "\n                This is the blog form of the Thinking in MapReduce talk at StampedeCon 2013. I’ve linked to existing resources for some items discussed in the talk, but the structure and major points are here.\nWe programmers have had it pretty good over the years. In almost all cases, hardware scaled up faster than data size and complexity. Unfortunately, this is changing for many of us. Moore’s Law has taken on a new direction; we gain power with parallel processing rather than faster clock cycles.\n            ",
            "link": "https://engineering.cerner.com/blog/thinking-in-mapreduce/"
        },
        {
            "title": "FIRST Robotics Championship Competition in St. Louis",
            "date": "4:23:2013",
            "abstract": "\n                Cerner places a high value on talent development programs offering students the experience to build practical and tangible skills for the modern work environment. As part of this focus, Cerner supports FIRST Robotics, a competition providing experience in software engineering, where students learn to deal with complexity, time constraints, quality, and technical communications. Sound familiar? I wish they had this program when I was a kid!\nHigh school students from Kansas City will be testing their minds, willpower, and teamwork in this global robotics championship competition April 24-27 in St Louis, Missouri.\n            ",
            "link": "https://engineering.cerner.com/blog/first-robotics-championship-competition-in-st-louis/"
        },
        {
            "title": "Learn what the rules don't cover",
            "date": "4:19:2013",
            "abstract": "\n                Most technical problems are like games. All of them have a way to win and all of them have rules; the easiest way to ensure you always win is to learn the rules inside and out, and more importantly what the rules don’t cover! Paying attention to what the rules don’t cover is what leads to out of the box thinking. What sets the great players apart from the rest is learning what the rules don’t cover which allows for creativity and, sometimes, shortcuts.\n            ",
            "link": "https://engineering.cerner.com/blog/learn-what-the-rules-dont-cover/"
        },
        {
            "title": "Ruby at Cerner",
            "date": "4:5:2013",
            "abstract": "\n                Cerner’s journey with Ruby started in the summer of 2009. We selected Ruby on Rails for rapid development of the Cerner Store to prepare for release at the Cerner Health Conference that year. In three months, with three engineers and a designer, we wrote and released the first version of an e-commerce web application. Two of those engineers, including me, had never worked with Ruby before but quickly realized the power and expressiveness of the language due to resources like Why’s (Poignant) Guide to Ruby.\n            ",
            "link": "https://engineering.cerner.com/blog/ruby-at-cerner/"
        },
        {
            "title": "Modularity in Medical Imaging",
            "date": "3:29:2013",
            "abstract": "\n                Developers often take for granted the level of flexibility and customization that is available within the software they use every day. Consumers of imaging software have traditionally been completely confined to interpret exams a specific way, and frequently in ways that are unintuitive. Every physician, specialist, technologist, med student, and others across the continuum of care has a preference as to not only how exams are laid out, but what information is displayed with the images and what transformations would be applied or processed automatically.\n            ",
            "link": "https://engineering.cerner.com/blog/modularity-in-medical-imaging/"
        },
        {
            "title": "Near Real-time Processing Over Hadoop and HBase",
            "date": "2:27:2013",
            "abstract": "\n                From MapReduce to realtime This post covers much of the Near-Realtime Processing Over HBase talk I’m giving at ApacheCon NA 2013 in blog form. It also draws from the Hadoop, HBase, and Healthcare talk from StrataConf/Hadoop World 2012.\nThe first significant use of Hadoop at Cerner came in building search indexes for patient charts. While creation of simple search indexes is almost commoditized, we wanted a better experience based on clinical semantics.\n            ",
            "link": "https://engineering.cerner.com/blog/near-real-time-processing-over-hadoop-and-hbase/"
        },
        {
            "title": "Evangelizing User Experience",
            "date": "2:12:2013",
            "abstract": "\n                In the dark ages of development, great software meant packing in the functionality. People began doing more and more with their software. Updates meant newer and more exciting functionality. Sounds great, right? Of course it does, but something went horribly wrong. Slowly we became inundated with cluttered screens as software developers struggled to find a place to put their latest innovative functionality. Buttons began adding up and before we knew it, we were inventing user interface controls like ribbons to hold all the buttons.\n            ",
            "link": "https://engineering.cerner.com/blog/evangelizing-user-experience/"
        },
        {
            "title": "Why Engineering Health?",
            "date": "2:4:2013",
            "abstract": "\n                Hello and welcome to a public face for Cerner Engineering, by Cerner Engineering associates, to talk about engineering, technology, and all of the other awesome things we do.\nCerner has been recognized as a visionary company, transforming the delivery of healthcare around the world. Improving the health of individuals and the delivery of care is an extremely large, complex, ever-changing problem. Along with the efforts of our strategists and consultant organizations, solving this problem takes a ton of smart folks in our Engineering and CernerWorks Hosting organizations, who are free to play with, adopt, and embrace new technologies and ways of working.\n            ",
            "link": "https://engineering.cerner.com/blog/why-engineering-health/"
        },
        {
            "title": "Composable MapReduce with Hadoop and Crunch",
            "date": "2:3:2013",
            "abstract": "\n                Most developers know this pattern well: we design a set of schemas to represent our data, and then work with that data via a query language. This works great in most cases, but becomes a challenge as data sets grow to an arbitrary size and complexity. Data sets can become too large to query and update with conventional means.\nThese challenges often arise with Hadoop, simply because Hadoop is a popular tool to tackle such data sets.\n            ",
            "link": "https://engineering.cerner.com/blog/composable-mapreduce-with-hadoop-and-crunch/"
        }
    ]
}