{
    "quora": [
        {
            "title": "MySQL sharding at Quora",
            "abstract": "Team: Nagavamsi (Vamsi) Ponnekanti, Lingduo Kong, Hwan Seung Yeo (manager)\n \n In this blog post, we discuss how Quora was able to scale our usage of MySQL to meet the growing requirements of our content. We’ll focus especially on the challenge of sharding the data stored in MySQL at scale. MySQL at Q ",
            "author": "Vamsi Ponnekanti",
            "date": "4:18:2020",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/MySQL-sharding-at-Quora"
        },
        {
            "title": "Adopting Kubernetes at Quora",
            "abstract": "Containerization is an exciting area of work at Quora that we hope will enable multiple engineering teams to move more quickly toward Quora’s mission. After having first experimented with using Kubernetes over a year ago, it has since become a key technology for us in automating the management of co ",
            "author": "Taylor Barrella",
            "date": "12:5:2019",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Adopting-Kubernetes-at-Quora"
        },
        {
            "title": "Unifying dense and sparse features for neural networks",
            "abstract": "A neural network model for recommendation is typically based on both dense and sparse features. Dense features incorporate information from users/items pairs, historical statistics, predictions from upstream models [1] and etc. Typically sparse features include IDs of users/items, demographics, keyw ",
            "author": "Lei Nie",
            "date": "11:16:2019",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Unifying-dense-and-sparse-features-for-neural-networks"
        },
        {
            "title": "Using natural language models for question correction",
            "abstract": "Authors: Tom Yubing Dong (董 玉冰), Xinyu Zhao (赵 欣宇) As part of our mission to share and grow the world’s knowledge, we’ve devoted great effort to maintain and improve the quality of the large number of questions being added. This often involves a balancing act. While we need to ensure that questions o ",
            "author": "Xinyu Zhao (赵 欣宇)",
            "date": "9:13:2019",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Using-natural-language-models-for-question-correction"
        },
        {
            "title": "Pycache: lightning-fast in-process caching",
            "abstract": "When rendering a Web page, Quora webservers need to access many different kinds of data. Some are easy to compute (what's the name for the user with ID 2667222?), and some are more difficult (how many users follow any of the topics that this question is associated with?). We store these facts in dif ",
            "author": "Martin Michelsen",
            "date": "4:19:2019",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Pycache-lightning-fast-in-process-caching"
        },
        {
            "title": "Feature Engineering at Quora with Alchemy",
            "abstract": "Authors: Kornél Csernai , Naran Bayanbat Overview At Quora, we’re always working to shorten the distance between people and whatever knowledge would benefit them. This means growing our collection of knowledge, assessing it, and figuring out how to rank and distribute it efficiently. Today's version o ",
            "author": "Kornél Csernai",
            "date": "1:19:2019",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Feature-Engineering-at-Quora-with-Alchemy"
        },
        {
            "title": "Qmessage: Handling Billions of Tasks Per Day",
            "abstract": "Authors: Bandish Chheda and Yiming Li\n \nToday, we're excited to discuss Qmessage, our distributed, asynchronous task queue. We use Qmessage to handle tasks where a response is not immediately needed and would require too much time to execute during a web or API request, such as delivering answers, s ",
            "author": "Bandish Chheda",
            "date": "10:11:2018",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Qmessage-Handling-Billions-of-Tasks-Per-Day"
        },
        {
            "title": "Automated Infrastructure Cost Optimization at Scale with AWS EC2 Reserved Instances",
            "abstract": "Quora's Infrastructure team is responsible for ensuring that all of our systems remain performant, reliable, and cost-effective as Quora continues to rapidly scale. In this post, we'll focus on cost and walk through several automated cost optimizations we've made across our infrastructure that impro ",
            "author": "Charley Witchakorn Kamolpornwijit",
            "date": "8:13:2018",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Automated-Infrastructure-Cost-Optimization-at-Scale-with-AWS-EC2-Reserved-Instances"
        },
        {
            "title": "Machine Learning Workshop: Combatting Abuse Online",
            "abstract": "Quora recently hosted a workshop on using machine learning to combat spam, harassment, and sock puppets in online communities. While human reporting and traditional moderation solutions play a key role in safeguarding shared spaces, ML needs to do the heavy lifting once platforms reach a massive sca ",
            "author": "Shuo (Steven) Chang",
            "date": "11:2:2017",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Machine-Learning-Workshop-Combatting-Abuse-Online"
        },
        {
            "title": "Optimizing Memcached Efficiency",
            "abstract": "As Quora has continued to grow, we've continued to invest in the scalability of our infrastructure. Caching is a key component of our architecture, and we use Memcached as our primary store to cache results from slower, persistent databases. While data stores like MySQL, HBase, and Redis offer a vari ",
            "author": "Siyuan Fu (富思源)",
            "date": "5:5:2017",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Optimizing-Memcached-Efficiency"
        },
        {
            "title": "The Quora Engineering Guilds",
            "abstract": "At Quora, as our product continues to grow—to over 100M unique users per month, launching in a second language, and a new advertising program—so too has our engineering organization grown. It's now reached over 80 people and counting, and while we're not at the tens-of-thousands size of some of our ",
            "author": "Xavier Amatriain",
            "date": "3:25:2017",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/The-Quora-Engineering-Guilds"
        },
        {
            "title": "Semantic Question Matching with Deep Learning",
            "abstract": "Authors: Lili Jiang, Shuo Chang, and Nikhil Dandekar\n \nIn order to build a high-quality knowledge base, it's important that we ensure each unique question exists on Quora only once. Writers shouldn't have to write the same answer to multiple versions of the same question, and readers should be able ",
            "author": "Nikhil Dandekar",
            "date": "2:14:2017",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Semantic-Question-Matching-with-Deep-Learning"
        },
        {
            "title": "Updates to Our Bug Bounty Program",
            "abstract": "In order to achieve our mission of sharing and growing the world's knowledge, we need to maintain a secure platform for writers and readers. To that end, we launched our first bug bounty program with Bugcrowd this past fall, through which security researchers have been invited to look for vulnerabil ",
            "author": "Sriram Seshadri",
            "date": "12:9:2016",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Updates-to-Our-Bug-Bounty-Program"
        },
        {
            "title": "Quora at RecSys 2016",
            "abstract": "At Quora, our mission is to share and grow the world’s knowledge. Recommender systems are at the heart of this mission: our systems that recommend answers to read, questions to answer, and topics to follow are at the core of Quora's user experience. \n \nThis year, Quora was a sponsor of the ACM Confe ",
            "author": "Nikhil Dandekar",
            "date": "11:11:2016",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Quora-at-RecSys-2016"
        },
        {
            "title": "Asynchronous Programming in Python",
            "abstract": " Quora's mission is to share and grow the world's knowledge, and to achieve that mission, we're continuing to roll out improvements that make Quora faster for our readers and writers. In our last post, Faster Paint Times, we covered our recent optimizations to client-side performance, and in this pos ",
            "author": "Manan Nayak",
            "date": "9:17:2016",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Asynchronous-Programming-in-Python"
        },
        {
            "title": "Faster Paint Times",
            "abstract": "Quora's mission is to share and grow the world's knowledge, so it's critical we create a product that enables anyone to quickly read and contribute content across all platforms. To that end, the speed of our web and mobile products is one of our engineering team's top priorities. Studies have repeat ",
            "author": "Michael Yong",
            "date": "8:18:2016",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Faster-Paint-Times"
        },
        {
            "title": "Ensuring Quora's Resilience to Disaster",
            "abstract": "Quora's mission is to share and grow the world's knowledge, and we're committed to making sure Quora is a knowledge repository that will be around forever. To this end, we perform daily backups of all of our ground-truth datastores—MySQL, HBase, Redis, and feed services—and replicate them to multipl ",
            "author": "Martin Michelsen",
            "date": "7:15:2016",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Ensuring-Quoras-Resilience-to-Disaster"
        },
        {
            "title": "Applications of NLP at Quora",
            "abstract": "Hundreds of millions of people use Quora to discover high-quality answers to questions important to them. The quality of our content and the civility of our community are two important factors that make Quora special. We want to maintain that quality even as billions of people start using Quora. We h ",
            "author": "Nikhil Garg",
            "date": "5:17:2016",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Applications-of-NLP-at-Quora"
        },
        {
            "title": "Seeking Information Using Search and Question Asking",
            "abstract": "Most people engage in some form or other of “information seeking” every day of their lives. On the internet, the most common way people go about information seeking is by using search engines. Sometimes they use a general, web search engine like Google or Bing, and sometimes they use a specialized s ",
            "author": "Nikhil Dandekar",
            "date": "3:30:2016",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Seeking-Information-Using-Search-and-Question-Asking"
        },
        {
            "title": "Avoiding Complexity of Machine Learning Systems",
            "abstract": "Today, more and more products and engineering teams rely on machine learning (referred to as ML through out this blog post). The abundance of open source tools and libraries also makes it much easier to learn, develop, and build ML models even for people with little prior knowledge or experience. ML ",
            "author": "Lei Yang",
            "date": "3:25:2016",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Avoiding-Complexity-of-Machine-Learning-Systems"
        },
        {
            "title": "A Machine Learning Approach to Ranking Answers on Quora",
            "abstract": "Millions of people use Quora every day to find answers to their questions and make smarter decisions, find their dream jobs, raise their families better, and much more. It's really important for us to provide an excellent reading experience on our question pages. An important part of that is orderin ",
            "author": "Kornél Csernai",
            "date": "3:2:2016",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/A-Machine-Learning-Approach-to-Ranking-Answers-on-Quora"
        },
        {
            "title": "Engineers of Quora: Pranav Gokhale",
            "abstract": "This is the first of a series of posts highlighting what it's like to be an engineer at Quora. Over the series, we hope to introduce you to some of our engineers in various roles, and give you a close look at the life inside the Quora engineering team.   Hi there, Pranav here! I am an engineer working ",
            "author": "Pranav Gokhale",
            "date": "1:29:2016",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Engineers-of-Quora-Pranav-Gokhale"
        },
        {
            "title": "Securing Quora with HTTPS",
            "abstract": "We’re happy to announce that we have completed the transition to support HTTPS everywhere on Quora and have joined a growing list of websites that are fully HTTPS. HTTPS is a protocol that encrypts all communication between the web browsers and the web servers. The encryption helps prevent eavesdrop ",
            "author": "Abhishek Ray",
            "date": "1:28:2016",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Securing-Quora-with-HTTPS"
        },
        {
            "title": "The Product Engineering Behind Most Viewed Writers",
            "abstract": "Earlier this year, we rolled out the Most Viewed Writers feature to recognize writers who are most actively contributing to the topics they know and care about. Most Viewed Writers is a great way to both highlight active contributors and help readers discover writers in their favorite topics.  As a p ",
            "author": "Chun-Ho Hung",
            "date": "12:10:2015",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/The-Product-Engineering-Behind-Most-Viewed-Writers"
        },
        {
            "title": "Ask To Answer as a Machine Learning Problem",
            "abstract": "Ask To Answer (A2A) is a feature of Quora that allows users to send requests to other users asking them to write an answer to a particular question.  A2A is an important product feature, allowing users to route questions to the experts best qualified to answer them.  In addition to generating great ",
            "author": "Ofir Nachum",
            "date": "9:9:2015",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Ask-To-Answer-as-a-Machine-Learning-Problem"
        },
        {
            "title": "Moving Fast With High Code Quality",
            "abstract": "A high-quality codebase boosts the long-term development speed by making iteration, collaboration, and maintenance easier.  At Quora, we take the quality of our codebase seriously.   ​ But despite the benefits, maintaining high code quality creates a non-trivial overhead and consumes real development ",
            "author": "Nikhil Garg",
            "date": "7:27:2015",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Moving-Fast-With-High-Code-Quality"
        },
        {
            "title": "Mobile A/B Testing at Quora",
            "abstract": "Adapted from my answer to What UX elements can Quora's team change in the iPhone app without making an App Store release? We're constantly improving the UX of both our mobile and web products to help make them work better for people who use Quora, and running A/B tests to understand the impact of our ",
            "author": "Tommy MacWilliam",
            "date": "5:5:2015",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Mobile-A-B-Testing-at-Quora"
        },
        {
            "title": "Machine Learning at Quora",
            "abstract": "Adapted from my original answer to How does Quora use machine learning in 2015? At Quora we have been using machine learning approaches for some time. We are constantly coming up with new approaches and making big improvements to the existing ones. It is important to note that all these improvements ",
            "author": "Xavier Amatriain",
            "date": "4:7:2015",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Machine-Learning-at-Quora"
        },
        {
            "title": "Quora Haqathon",
            "abstract": "We are excited to announce that we are going to host Quora Haqathon, an 8-hour long programming competition, where you can try your skills at solving real-world challenges.\nThe contest will take place from December 6, 11:00 AM PST to December 6, 7:00 PM PST. You can sign up here: Quora Haqathon   This ",
            "author": "Denis Yarats",
            "date": "11:26:2014",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Quora-Haqathon"
        },
        {
            "title": "Persistent Finite State Machines in Python",
            "abstract": "We all know that finite state machines are very versatile and powerful but despite the great power they wield, they are not used often enough in “real programming”. In this post, I’ll describe how we have set up an abstraction for creating finite state machines in Python and how we use it at Quora t ",
            "author": "Nikhil Garg",
            "date": "8:22:2014",
            "link": "https://www.quora.com/q/hjjxfryylxwqomtl/Persistent-Finite-State-Machines-in-Python"
        }
    ]
}