{
    "red_hat": [
        {
            "title": "2020 Time Zone Database (tzdata) changes",
            "date": "12:25:2020",
            "abstract": "Daylight saving time transitions, a zone name change, and the removal of some obsolete files: These are some of the changes that occurred in the Time Zone Database (tzdata) package that provides Red Hat Enterprise Linux (RHEL) and applications with time zone information.",
            "link": "https://developers.redhat.com/blog/2020/12/25/2020-time-zone-database-tzdata-changes/",
            "image": "https://developers.redhat.com/blog/wp-content/uploads/2020/12/2020_-2020_TimeZone_Data_Changes_Featured_Article__B.png",
            "author": "By Patsy Griffin December 25, 2020December 21, 2020"
        },
        {
            "title": "Use Kebechet machine learning to perform source code operations",
            "date": "12:24:2020",
            "abstract": "One of the first tools we developed to help us with Project Thoth was Kebechet, which we named for the goddess of freshness and purification. As we separated our software into more and more repositories (each of our Python modules is in its own repository on GitHub), we needed help with releasing new versions and keeping all dependent modules up-to-date. In a team of two and with more than 35 repositories, our process was a major time-burner.",
            "link": "https://developers.redhat.com/blog/2020/12/24/use-kebechet-machine-learning-to-perform-source-code-operations/",
            "image": "https://developers.redhat.com/blog/wp-content/uploads/2020/12/kebechet_2x.png",
            "author": "By Christoph Gorn December 24, 2020December 21, 2020"
        },
        {
            "title": "Supersonic, Subatomic gRPC services with Java and Quarkus",
            "date": "12:23:2020",
            "abstract": "gRPC is an open source remote procedure call (RPC) framework. It was released by Google in 2015 and is now an incubating project within the Cloud Native Computing Foundation. This post introduces gRPC while explaining its underlying architecture and how it compares to REST over HTTP. You’ll also get started using Quarkus to implement and consume gRPC services.",
            "link": "https://developers.redhat.com/blog/2020/12/23/supersonic-subatomic-grpc-services-with-java-and-quarkus/",
            "image": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/javaquarkus_1x.png",
            "author": "By Eric Deandrea December 23, 2020December 21, 2020"
        },
        {
            "title": ".NET 5.0 now available for Red Hat Enterprise Linux and Red Hat OpenShift",
            "date": "12:22:2020",
            "abstract": "We’re excited to announce the general availability of .NET 5.0 on Red Hat Enterprise Linux 7, Red Hat Enterprise Linux 8, and Red Hat OpenShift Container Platform.",
            "link": "https://developers.redhat.com/blog/2020/12/22/net-5-0-now-available-for-red-hat-enterprise-linux-and-red-hat-openshift/",
            "image": "https://developers.redhat.com/blog/wp-content/uploads/2020/12/dotnet5_2x.png",
            "author": "By Mauricio \"Maltron\" Leal December 22, 2020December 21, 2020"
        },
        {
            "title": "WildFly server configuration with Ansible collection for JCliff, Part 3",
            "date": "12:21:2020",
            "abstract": "Welcome to the final installment in this three-part series about using Ansible Collection for JCliff to manage WildFly or Red Hat JBoss Enterprise Application Platform (JBoss EAP) instances. Previously, we’ve discussed installing and configuring the JCliff Ansible collection and using its basic features. In this article, we discuss advanced options available with the project’s latest release. Without further ado, let’s dive in!",
            "link": "https://developers.redhat.com/blog/2020/12/21/wildfly-server-configuration-with-ansible-collection-for-jcliff-part-3/",
            "image": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/Ansible_EAP_Wildfly_3.png",
            "author": "By Romain Pelisse December 21, 2020December 20, 2020"
        },
        {
            "title": "Build embedded cache clusters with Quarkus and Red Hat Data Grid",
            "date": "12:17:2020",
            "abstract": "There are many ways to configure the cache in a microservices system. As a rule of thumb, you should use caching only in one place; for example, you should not use the cache in both the HTTP and application layers. Distributed caching both increases cloud-native application performance and minimizes the overhead of creating new microservices.",
            "link": "https://developers.redhat.com/blog/2020/12/17/build-embedded-cache-clusters-with-quarkus-and-red-hat-data-grid/",
            "image": "https://developers.redhat.com/blog/wp-content/uploads/2020/12/CacheClusters_QuarkusDataGrid.png",
            "author": "By Daniel Oh December 17, 2020December 16, 2020"
        },
        {
            "title": "Create a Kubernetes Operator in Golang to automatically manage a simple, stateful application",
            "date": "12:16:2020",
            "abstract": "A Kubernetes Operator acts as an automated site reliability engineer for its application, encoding the skills of an expert administrator in software. For example, an Operator can manage a cluster of database servers and configure and manage its application. It can also install a database cluster of a declared software version and a designated number of members.",
            "link": "https://developers.redhat.com/blog/2020/12/16/create-a-kubernetes-operator-in-golang-to-automatically-manage-a-simple-stateful-application/",
            "image": "https://developers.redhat.com/blog/wp-content/uploads/2020/12/2020_Stateful_Golang_Kubernetes_Shared_image_A.png",
            "author": "By Priyanka Jiandani December 16, 2020December 15, 2020"
        },
        {
            "title": "Installing Red Hat’s migration toolkit for applications on your laptop",
            "date": "12:15:2020",
            "abstract": "If you are a developer considering modernizing your Java applications by containerizing or migrating them to a more modern application server, then you are likely aware of Red Hat’s migration toolkit for applications. This article helps you get started with migration toolkit for applications by installing it directly on your laptop. For more about the toolkit, see:",
            "link": "https://developers.redhat.com/blog/2020/12/15/installing-red-hats-migration-toolkit-for-applications-on-your-laptop/#more-790607",
            "image": "https://developers.redhat.com/blog/wp-content/uploads/2020/12/migration-toolkit-laptop_2x.png",
            "author": "By Miguel Pérez Colino December 15, 2020December 14, 2020"
        },
        {
            "title": "Debezium serialization with Apache Avro and Apicurio Registry",
            "date": "12:11:2020",
            "abstract": "In this article, you will learn how to use Debezium with Apache Avro and Apicurio Registry to efficiently monitor change events in a MySQL database. We will set up and run a demonstration using Apache Avro rather than the default JSON converter for Debezium serialization. We will use Apache Avro with the Apicurio service registry to externalize Debezium’s event data schema and reduce the payload of captured events.",
            "link": "https://developers.redhat.com/blog/2020/12/11/debezium-serialization-with-apache-avro-and-apicurio-registry/",
            "image": "https://developers.redhat.com/blog/wp-content/uploads/2020/12/debeziumapacheapicurio_2x.png",
            "author": "By Hugo Guerrero December 11, 2020December 9, 2020"
        },
        {
            "title": "Analyze monolithic Java applications in multiple workspaces with Red Hat’s migration toolkit for applications",
            "date": "12:11:2020",
            "abstract": "Transforming monolithic Java applications into distributed, cloud-native microservices is never easy, but Red Hat’s migration toolkit for applications helps you understand and evaluate the migration path. As a developer, you can apply the following features to a broad range of transformation use cases:",
            "link": "https://developers.redhat.com/blog/2020/12/11/analyze-monolithic-java-applications-in-multiple-workspaces-with-red-hats-migration-toolkit-for-applications/",
            "image": "https://developers.redhat.com/blog/wp-content/uploads/2020/12/monolith-java-crw-mta_2x.png",
            "author": "By Daniel Oh December 11, 2020December 10, 2020"
        },
        {
            "title": "How to clean up the Fedora root folder",
            "date": "12:10:2020",
            "abstract": "When upgrading a package or the Fedora release version, I sometimes hit the error:",
            "link": "https://developers.redhat.com/blog/2020/12/10/how-to-clean-up-the-fedora-root-folder/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/12/clean-fedor-root_2x.png"
        },
        {
            "title": "New features and storage options in Red Hat Integration Service Registry 1.1 GA",
            "date": "12:9:2020",
            "abstract": "This article introduces new storage installation options and features in the Red Hat Integration service registry. The service registry component is based on Apicurio. You can use it to store and retrieve service artifacts such as OpenAPI specifications and AsyncAPI definitions, and for schemas such as Apache Avro, JSON, and Google Protobuf. We’ve provided Red Hat Integration’s Service Registry 1.1 component as a general availability (GA) release in Red Hat Integration 2020-Q4.",
            "link": "https://developers.redhat.com/blog/2020/12/09/new-features-and-storage-options-in-red-hat-integration-service-registry-1-1-ga/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/12/2020_RH_ServiceRegistry_Featured_Article_Image__B.png"
        },
        {
            "title": "Spring Boot to Quarkus migrations and more in Red Hat’s migration toolkit for applications 5.1.0",
            "date": "12:8:2020",
            "abstract": "Red Hat’s migration toolkit for applications (previously known as Red Hat Application Migration Toolkit) has reached version 5.1.0. This version includes user interface improvement, the new migration toolkit for applications Operator, and new rules to support development teams migrating from Spring Boot to Quarkus.",
            "link": "https://developers.redhat.com/blog/2020/12/08/spring-boot-to-quarkus-migrations-and-more-in-red-hats-migration-toolkit-for-applications-5-1-0/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/12/MTA_whatsnew.png"
        },
        {
            "title": "Red Hat build of Node.js 14 brings diagnostic reporting, metering, and more",
            "date": "12:8:2020",
            "abstract": "The latest Red Hat build of Node.js 14 long-term support (LTS) release. This build brings new features such as diagnostic reporting, full-icu internationalization support, and Red Hat OpenShift integration. We’ve also included tech preview features such as the new AsyncLocalStorage class, and we’ve updated our documentation and interactive developer learning scenarios. Keep reading for an overview of what’s new and how to get started with the Red Hat build of Node.js 14.",
            "link": "https://developers.redhat.com/blog/2020/12/08/red-hat-build-of-node-js-14-brings-diagnostic-reporting-metering-and-more/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/12/rh-nodejs14_2x.png"
        },
        {
            "title": "Use Oracle’s Universal Connection Pool with Red Hat JBoss Enterprise Application Platform 7.3 and Oracle RAC",
            "date": "12:7:2020",
            "abstract": "Data is a critical business application component, but ensuring consistent, reliable data access can be challenging. Adding distributed services and high availability to your application requirements makes data access even more complicated. You can now use Oracle’s Universal Connection Pool (UCP) together with Oracle Real Application Clusters (RAC) and Red Hat JBoss Enterprise Application Platform (JBoss EAP) 7.3. This article introduces connection pooling with Oracle Universal Connection Pool and demonstrates how to integrate UCP with an Oracle RAC database in a JBoss EAP 7.3 deployment.",
            "link": "https://developers.redhat.com/blog/2020/12/07/use-oracles-universal-connection-pool-with-red-hat-jboss-enterprise-application-platform-7-3-and-oracle-rac/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/12/2020_Creating_applications_UCP_JBoss-EAP_Oracle_RAC_Featured_Article_image_A.png"
        },
        {
            "title": "Support for IBM Power Systems and more with Red Hat CodeReady Workspaces 2.5",
            "date": "12:4:2020",
            "abstract": "Red Hat CodeReady Workspaces 2.5 is now available. This article introduces support for IBM Power Systems and the new single-host mode in CodeReady Workspaces 2.5. We also briefly discuss support for Red Hat OpenShift 4.6 and language updates in this release.",
            "link": "https://developers.redhat.com/blog/2020/12/04/support-for-ibm-power-systems-and-more-with-red-hat-codeready-workspaces-2-5/#more-823637",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/12/2020_CRW_2.5_Shared_image_CRW-1.png"
        },
        {
            "title": "WildFly server configuration with Ansible collection for JCliff, Part 2",
            "date": "12:3:2020",
            "abstract": "Welcome to the second part of this series introducing Ansible collection for JCliff. This new extension is designed for fine-tuning WildFly or Red Hat JBoss Enterprise Application Platform (JBoss EAP) configurations using Ansible. In Part 1, we installed JCliff and its Ansible collection and prepared our environment. We set up a minimal, working playbook for installing JCliff on the target system. In this article, we will focus on configuring a few of our WildFly server’s subsystems.",
            "link": "https://developers.redhat.com/blog/2020/12/03/wildfly-server-configuration-with-ansible-collection-for-jcliff-part-2/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/12/Ansible_EAP_Wildfly_2.png"
        },
        {
            "title": "Open Liberty 20.0.0.12 brings support for gRPC, custom JNDI names, and Java SE 15",
            "date": "12:2:2020",
            "abstract": "Open Liberty 20.0.0.12 now supports gRPC 1.0 and gRPC Client 1.0. This universal, open source framework is an efficient way to connect remote services across data centers. We’ve also added custom names support for the Java Naming and Directory Interface (JNDI), making it easier to look up and inject Jakarta Enterprise Beans (EJBs) in your Open Liberty applications. Finally, this new release is compatible with Java SE 15, the latest Java Standard Edition version. We’ll introduce these features and show you how to set up and configure the new gRPC and custom JNDI names support in Open Liberty 20.0.0.12.",
            "link": "https://developers.redhat.com/blog/2020/12/02/open-liberty-20-0-0-12-brings-support-for-grpc-custom-jndi-names-and-java-se-15/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/supportforGRPC-Java-Open-Liberty.png"
        },
        {
            "title": "Red Hat Software Collections 3.6 now Generally Available",
            "date": "12:1:2020",
            "abstract": "Red Hat Software Collections 3.6 and Red Hat Developer Toolset 10 for Red Hat Enterprise Linux (RHEL) are now Generally Available. An alternative to the default RHEL toolset, Software Collections provides a differentiated and eclectic mix of tools that developers can use on a desktop or in production.",
            "link": "https://developers.redhat.com/blog/2020/12/01/red-hat-software-collections-3-6-now-generally-available/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/sofware-collectionstoolset_1x.png"
        },
        {
            "title": "Using IntelliJ Community Edition in Red Hat CodeReady Workspaces 2.5",
            "date": "12:1:2020",
            "abstract": "Red Hat CodeReady Workspaces (CRW) provides a default browser-based IDE to be used with developer workspaces. However, the architecture is flexible for using other IDEs such as Jupyter Notebooks and Eclipse Dirigible. In this article, you will learn how to create a custom workspace using the community edition of IntelliJ IDEA.",
            "link": "https://developers.redhat.com/blog/2020/12/01/using-intellij-community-edition-in-red-hat-codeready-workspaces-2-5/#more-825767",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/2020_IntelliJ_CRWIntelliJ.png"
        },
        {
            "title": "Cloud-native modernization or death? A false dichotomy",
            "date": "11:30:2020",
            "abstract": "DevNation Tech Talks are hosted by the Red Hat technologists who create our products. These sessions include real solutions plus code and sample projects to help you get started. In this talk, you’ll learn about cloud-native modernization from Daniel Oh and Burr Sutter.",
            "link": "https://developers.redhat.com/blog/2020/11/30/cloud-native-modernization-or-death-a-false-dichotomy/#more-830447",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/DevNationDanielOh.png"
        },
        {
            "title": "Red Hat Process Automation Manager 7.9 brings Apache Kafka integration and more",
            "date": "11:27:2020",
            "abstract": "Red Hat Process Automation Manager 7.9 brings bug fixes, performance improvements, and new features for process and case management, business and decision automation, and business optimization. This article introduces you to Process Automation Manager’s out-of-the-box integration with Apache Kafka, revamped business automation management capabilities, and support for multiple decision requirements diagrams (DRDs). I will also guide you through setting up and using the new drools-metric module for analyzing business rules performance, and I’ll briefly touch on Spring Boot integration in Process Automation Manager 7.9.",
            "link": "https://developers.redhat.com/blog/2020/11/27/red-hat-process-automation-manager-7-9-brings-apache-kafka-integration-and-more/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/BA-release-7.9_2x.png"
        },
        {
            "title": "Orchestrate event-driven, distributed services with Serverless Workflow and Kubernetes",
            "date": "11:26:2020",
            "abstract": "Serverless workflows have gained renewed interest and usefulness with the rise of serverless architectures. Once seen as centralized and monolithic, they now play a key role in cloud-based event and service orchestration. Until recently, there was no vendor-neutral way to describe service orchestration, so developers were dependent on vendors and vendor implementations. We realized that we needed a common, standards-based language for describing serverless workflows.",
            "link": "https://developers.redhat.com/blog/2020/11/26/event-driven-distributed-service-orchestration-with-serverless-workflow/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/CPevent-drivenserverless_2x.png"
        },
        {
            "title": "How to configure YAML schema to make editing files easier",
            "date": "11:25:2020",
            "abstract": "YAML is a friendly data serialization standard that works with all programming languages. While configuration files are often defined in YAML, it can even be used as a programming language, like the workflow language at Google, or Apache Camel K.",
            "link": "https://developers.redhat.com/blog/2020/11/25/how-to-configure-yaml-schema-to-make-editing-files-easier/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/yaml-schema-2x.png"
        },
        {
            "title": "Authentication and authorization using the Keycloak REST API",
            "date": "11:24:2020",
            "abstract": "Enabling authentication and authorization involves complex functionality beyond a simple login API. In a previous article, I described the Keycloak REST login API endpoint, which only handles some authentication tasks. In this article, I describe how to enable other aspects of authentication and authorization by using Keycloak REST API functionality out of the box.",
            "link": "https://developers.redhat.com/blog/2020/11/24/authentication-and-authorization-using-the-keycloak-rest-api/#more-769377",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/2020_Authentication_Author_Keycloak_Featured_Article__B-copy-2.png"
        },
        {
            "title": "More for developers in the new Red Hat OpenShift 4.6 web console",
            "date": "11:24:2020",
            "abstract": "Red Hat OpenShift 4.6 streamlines developer onboarding in the OpenShift web console, but that’s not all. This article details improvements and new features in the topology view and introduces OpenShift’s new, form-based approach to creating horizontal pod autoscalers and Helm charts. I also touch on application monitoring improvements and the latest updates for Red Hat OpenShift Pipelines, Red Hat OpenShift Serverless, and the Kiali Operator in OpenShift 4.6.",
            "link": "https://developers.redhat.com/blog/2020/11/24/more-for-developers-in-the-new-red-hat-openshift-4-6-web-console/#more-813327",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/2020_Developer_Web_Console_Shared_image_B.png"
        },
        {
            "title": "Using GeoJSON with Apache Camel K for spatial data transformation",
            "date": "11:23:2020",
            "abstract": "In this article, we will define and run a workflow that demonstrates how Apache Camel K interacts with spatial data in the standardized GeoJSON format. While the example is simplified, you can use the same workflow to handle big data and more complex data transformations.",
            "link": "https://developers.redhat.com/blog/2020/11/23/using-geojson-with-apache-camel-k-for-spatial-data-transformation/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/2020_GeoJSON_Camel-K_Featured_Article_image_A.png"
        },
        {
            "title": "Kubectl: Developer tips for the Kubernetes command line",
            "date": "11:20:2020",
            "abstract": "Kubectl, the Kubernetes command-line interface (CLI), has more capabilities than many developers realize. For example, did you know that kubectl can reach the Kubernetes API while running inside a cluster? You can also use kubectl to assume different user identities, to select a custom editor to run with the kubectl edit command, and more.",
            "link": "https://developers.redhat.com/blog/2020/11/20/kubectl-developer-tips-for-the-kubernetes-command-line/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/2020_Kubectl_Featured_Article_image_A.png"
        },
        {
            "title": "New developer onboarding features in Red Hat OpenShift 4.6",
            "date": "11:20:2020",
            "abstract": "We’ve added new features in the Red Hat OpenShift 4.6 release to help developers get started faster with the OpenShift web console:",
            "link": "https://developers.redhat.com/blog/2020/11/20/new-developer-onboarding-features-in-red-hat-openshift-4-6/#more-822387",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/2020_Developer_Web_Console_Shared_image_A.png"
        },
        {
            "title": "Transitioning from Docker to Podman",
            "date": "11:19:2020",
            "abstract": "Podman is an excellent alternative to Docker containers when you need increased security, unique identifier (UID) separation using namespaces, and integration with systemd. In this article, I use real-world examples to show you how to install Podman, use its basic commands, and transition from the Docker command-line interface (CLI) to Podman. You’ll also see how to run an existing image with Podman and how to set up port forwarding.",
            "link": "https://developers.redhat.com/blog/2020/11/19/transitioning-from-docker-to-podman/#more-753187",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/intro_podman_2x.png"
        },
        {
            "title": "Using Multus and DataVolume in KubeVirt",
            "date": "11:18:2020",
            "abstract": "KubeVirt is a cloud-native virtual machine management framework based on Kubernetes. KubeVirt orchestrates workloads running on virtual machines in the same way that Kubernetes does for containers. KubeVirt has many features for managing the network, storage, images, and the virtual machine itself. This article focuses on two mechanisms for configuring network and storage requirements: Multus-CNI and CDI DataVolumes. You will learn how to configure these KubeVirt features for use cases that require high performance, security, and scalability.",
            "link": "https://developers.redhat.com/blog/2020/11/18/using-multus-and-datavolume-in-kubevirt/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/multus-datavolume_kubevirt_2x.png"
        },
        {
            "title": "Event-driven serverless applications with Camel K",
            "date": "11:17:2020",
            "abstract": "DevNation Tech Talks are hosted by the Red Hat technologists who create our products. These sessions include real solutions plus code and sample projects to help you get started. In this talk, you’ll learn about event-driven serverless applications and Apache Camel K from Nicola Ferraro, Luca Burgazzoli, and Burr Sutter.",
            "link": "https://developers.redhat.com/blog/2020/11/17/event-driven-serverless-applications-with-camel-k/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/Camel-K-for-developers-serverless-openshift-or-kubernetes.png"
        },
        {
            "title": "Devfiles and Kubernetes cluster support in OpenShift Connector 0.2.0 extension for VS Code",
            "date": "11:16:2020",
            "abstract": "We are pleased to announce that the new release of the OpenShift Connector extension for Visual Studio Code (VS Code) is now available. The 0.2.0 release offers new features for rapidly developing and deploying code on Kubernetes and Red Hat OpenShift clusters. OpenShift Connector now supports component deployment using devfiles, leveraging odo 2.0 command-line interface under the hood.",
            "link": "https://developers.redhat.com/blog/2020/11/16/devfiles-and-kubernetes-cluster-support-in-openshift-connector-0-2-0-extension-for-vs-code/#more-805727",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/2020_-Devfile_Kubernetes_OS_VSCode_Featured_ArticleB.png"
        },
        {
            "title": "How I built a serverless blog search with Java, Quarkus, and AWS Lambda",
            "date": "11:13:2020",
            "abstract": "DevNation Tech Talks are hosted by the Red Hat technologists who create our products. These sessions include real solutions plus code and sample projects to help you get started. In this talk, you’ll learn about serverless blog search with Java, Quarkus, and AWS Lambda from Gunnar Morling and Burr Sutter.",
            "link": "https://developers.redhat.com/blog/2020/11/13/how-i-built-a-serverless-blog-search-with-java-quarkus-and-aws-lambda/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/DevNationGunnarMorling.png"
        },
        {
            "title": "Jakarta EE: Multitenancy with JPA on WildFly, Part 2",
            "date": "11:12:2020",
            "abstract": "This is the second half of a two-part article about multitenancy with the Jakarta Persistence API (JPA) on WildFly. In Part 1, I showed you how to implement multitenancy using a database. In Part 2, I’ll show you how to implement multitenancy using a schema and the Jakarta Persistence API (JPA) on WildFly. You’ll learn how to implement JPA’s CurrentTenantIdentifierResolver and MultiTenantConnectionProvider interfaces, and how to use JPA’s persistence.xml file to configure the required classes based on these interfaces.",
            "link": "https://developers.redhat.com/blog/2020/11/12/jakarta-ee-multitenancy-with-jpa-on-wildfly-part-2/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/2020_Wildfly_JakartaEE_JPA_featured_Article_image_Part2.png"
        },
        {
            "title": "Leading the future of Java with the Red Hat build of Quarkus 1.7",
            "date": "11:10:2020",
            "abstract": "",
            "link": "https://developers.redhat.com/blog/2020/11/10/leading-the-future-of-java-with-the-red-hat-build-of-quarkus-1-7/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/javaquarkus_1x.png"
        },
        {
            "title": "vscode-xml 0.14.0: A more customizable XML extension for VS Code",
            "date": "11:10:2020",
            "abstract": "Red Hat’s XML extension for Visual Studio Code (VS Code) has improved significantly since the last release. This article is an overview of the most notable updates in the vscode-xml extension 0.14.0 release. Improvements include embedded settings documentation, customizable document outlines, links for seamless XML catalog navigation, and error aggregation for schema validation.",
            "link": "https://developers.redhat.com/blog/2020/11/10/vscode-xml-0-14-0-a-more-customizable-xml-extension-for-vs-code/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/vscode-xml_2x.png"
        },
        {
            "title": "You (probably) need liveness and readiness probes",
            "date": "11:10:2020",
            "abstract": "One of the most common questions I get as a consultant is, “What is the difference between a liveness and a readiness probe?” The next most frequent question is, “Which one does my application need?”",
            "link": "https://developers.redhat.com/blog/2020/11/10/you-probably-need-liveness-and-readiness-probes/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/2020_Live_and_Readiness_Probes_Featured_Article_Featured_Article.png"
        },
        {
            "title": "OpenID Connect integration with Red Hat 3scale API Management and Okta",
            "date": "11:9:2020",
            "abstract": "This article introduces you to using Red Hat 3scale API Management for OpenID Connect (OIDC) integration and compliance. Our goal is to secure an API in 3scale API Management using JSON Web Token (JWT), OIDC, and the Oauth2 Authorization Framework. We will set up the integration using Okta as our third-party OpenID Connect identity provider. An important part of the demonstration is establishing the 3scale API Management gateway’s connection with Okta.",
            "link": "https://developers.redhat.com/blog/2020/11/09/openid-connect-integration-with-red-hat-3scale-api-management-and-okta/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/08/3scale-oidc-okta.png"
        },
        {
            "title": "WildFly server configuration with Ansible collection for JCliff, Part 1",
            "date": "11:6:2020",
            "abstract": "This three-part series guides you through using Ansible to fine-tune a WildFly or Red Hat JBoss Enterprise Application Platform (JBoss EAP) server configuration. We will use the most recently released version of the Ansible collection for JCliff to extend Ansible’s capabilities. The JCliff collection supports configuring several of the application server subsystems directly from Ansible.",
            "link": "https://developers.redhat.com/blog/2020/11/06/wildfly-server-configuration-with-ansible-collection-for-jcliff-part-1/#more-770187",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/Ansible_EAP_Wildfly_1.png"
        },
        {
            "title": "Red Hat Enterprise Linux 8.3 supports faster service and workload delivery",
            "date": "11:6:2020",
            "abstract": "Red Hat Enterprise Linux (RHEL) 8.3 was announced last week and is now generally available. We encourage Linux developers to download this update and give it a try. We also recommend updating both development and production systems to the new 8.3 release. This article is an overview of the developer highlights of RHEL 8.3, including new application streams for Node.js 14, Ruby 2.7, PHP 7.4, GCC Toolset 10, and more.",
            "link": "https://developers.redhat.com/blog/2020/11/06/red-hat-enterprise-linux-8-3-supports-faster-service-and-workload-delivery/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/rhel8.3release_2x.png"
        },
        {
            "title": "Capture IBM Db2 data changes with Debezium Db2 connector",
            "date": "11:5:2020",
            "abstract": "This article introduces the new Debezium Db2 connector for change data capture, now available as a technical preview from Red Hat Integration. Get a quick overview of using Debezium in a Red Hat AMQ Streams Kafka cluster, then find out how to use the new Db2 connector to capture row-level changes in your Db2 database tables.",
            "link": "https://developers.redhat.com/blog/2020/11/05/capture-ibm-db2-data-changes-with-debezium-db2-connector/#more-807057",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/2020_-Debezium_IBM_Db2_CDC_Featured_Article.png"
        },
        {
            "title": "Red Hat Software Collections 3.6 now available in beta",
            "date": "11:4:2020",
            "abstract": "Red Hat Software Collections 3.6 and Red Hat Developer Toolset 10 for Red Hat Enterprise Linux (RHEL) are now available as beta releases. An alternative to the default RHEL toolset, Software Collections provides a differentiated and eclectic mix of tools that developers can use on a desktop or in production.",
            "link": "https://developers.redhat.com/blog/2020/11/04/red-hat-software-collections-3-6-now-available-in-beta/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2014/09/softwarecollections-logo-e1507925353876.png"
        },
        {
            "title": "Argo CD and Tekton: Match made in Kubernetes heaven",
            "date": "11:3:2020",
            "abstract": "DevNation Tech Talks are hosted by the Red Hat technologists who create our products. These sessions include real solutions plus code and sample projects to help you get started. In this talk, you’ll learn about Argo CD and Tekton from Siamak Sadeghianfar and Burr Sutter.",
            "link": "https://developers.redhat.com/blog/2020/11/03/argo-cd-and-tekton-match-made-in-kubernetes-heaven/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/11/DevNation-Siamak-Sadeghianfar.png"
        },
        {
            "title": "New features in Red Hat CodeReady Studio 12.17 GA and JBoss Tools 4.17.0 Final for Eclipse 2020-09",
            "date": "11:2:2020",
            "abstract": "JBoss Tools 4.17.0 and Red Hat CodeReady Studio 12.17 for Eclipse 4.17 (2020-09) are now available. For this release, we focused on improving Quarkus and container-based development and fixing bugs. We also updated the Hibernate Tools runtime provider and Java Developer Tools (JDT) extensions, which are now compatible with Java 15. Additionally, we made many changes to platform views, dialogs, and toolbars in the user interface (UI).",
            "link": "https://developers.redhat.com/blog/2020/11/02/new-features-in-red-hat-codeready-studio-12-17-ga-and-jboss-tools-4-17-0-final-for-eclipse-2020-09/#more-797927",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/new-features_2x-CodeReady-Studio-and-JBoss-Tools.png"
        },
        {
            "title": "Open Liberty 20.0.0.11 brings Kerberos authentication and Thanos support in Grafana dashboards",
            "date": "10:30:2020",
            "abstract": "This article is a quick look at two exciting updates in the new Open Liberty 20.0.0.11 release. First, you can now use the Kerberos authentication protocol to secure Java Database Connectivity (JDBC) data sources. I’ll introduce the new kerberos configuration element in Open Liberty’s server.xml and show you how to use the Kerberos protocol to secure a data source.",
            "link": "https://developers.redhat.com/blog/2020/10/30/open-liberty-20-0-0-11-brings-kerberos-authentication-and-thanos-support-in-grafana-dashboards/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/OpenLiberty-OL_logomark_400.png"
        },
        {
            "title": "What’s new in Fabric8 Kubernetes Java client 4.12.0",
            "date": "10:30:2020",
            "abstract": "The recent Fabric8 Kubernetes Java client 4.12.0 release includes many new features and bug fixes. This article introduces the major features we’ve added between the 4.11.0 and 4.12.0 releases.",
            "link": "https://developers.redhat.com/blog/2020/10/30/whats-new-in-fabric8-kubernetes-java-client-4-12-0/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/WhatsNew_Fabric8.png"
        },
        {
            "title": "Collect JDK Flight Recorder events at runtime with JMC Agent",
            "date": "10:29:2020",
            "abstract": "JDK Flight Recorder, or JFR, is an event-based production environment profiler available from OpenJDK 8u272 forward. Being a HotSpot-native feature, JDK Flight Recorder performs with extremely low overhead in terms of how it uses both space and time.",
            "link": "https://developers.redhat.com/blog/2020/10/29/collect-jdk-flight-recorder-events-at-runtime-with-jmc-agent/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/2020_JFR_Event-Instrumentation_Runtime_JMC_Agent-_Featured_Article.png"
        },
        {
            "title": "New custom metrics and air gapped installation in Red Hat 3scale API Management 2.9",
            "date": "10:29:2020",
            "abstract": "We continue to update the Red Hat Integration product portfolio to provide a better operational and development experience for modern cloud– and container-native applications. The Red Hat Integration 2020-Q3 release includes Red Hat 3scale API Management 2.9, which provides new features and capabilities for 3scale. Among other features, we have updated the 3scale API Management and Gateway Operators.",
            "link": "https://developers.redhat.com/blog/2020/10/29/new-custom-metrics-and-air-gapped-installation-in-red-hat-3scale-api-management-2-9/#more-802667",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/3scale_airgapinstallation.png"
        },
        {
            "title": "Smart cards support in libssh",
            "date": "10:28:2020",
            "abstract": "In computer security, software implementations of cryptographic algorithms are vulnerable to side-channel attacks. This type of attack seeks to glean information from the computer system rather than from the program that it is running. As examples, Spectre and Meltdown are both side-channel attacks that target the microarchitecture of modern processors. Microarchitectural attacks are only a subset of all side-channel attacks. There are many others that leak sensitive secret information.",
            "link": "https://developers.redhat.com/blog/2020/10/28/smart-cards-support-in-libssh/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/SmartCard._Libssh.png"
        },
        {
            "title": "Using Microsoft SQL Server on Red Hat OpenShift",
            "date": "10:27:2020",
            "abstract": "In this article, you’ll learn how to deploy Microsoft SQL Server 2019 on Red Hat OpenShift. We’ll then use SQL Server from an ASP.NET Core application that is also deployed on OpenShift. Next, I’ll show you how to connect to SQL Server while working on the application from your local development machine. And finally, we’ll connect to the server using Azure Data Studio.",
            "link": "https://developers.redhat.com/blog/2020/10/27/using-microsoft-sql-server-on-red-hat-openshift/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/MicrosoftSQLServer_OpenShift.png"
        },
        {
            "title": "Adapting Docker and Kubernetes containers to run on Red Hat OpenShift Container Platform",
            "date": "10:26:2020",
            "abstract": "More and more companies are migrating their applications to the Red Hat OpenShift Container Platform (RHOCP). This enterprise-grade container platform is secure and comprehensive, based on industry standards including those related to Docker and Kubernetes. However, due to the tightened security restrictions, containers that run on Docker and Kubernetes might not run successfully on Red Hat OpenShift without modification.",
            "link": "https://developers.redhat.com/blog/2020/10/26/adapting-docker-and-kubernetes-containers-to-run-on-red-hat-openshift-container-platform/#more-760987",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/EAPOpenShiftImages_Docker.png"
        },
        {
            "title": "Use mobile numbers for user authentication in Keycloak",
            "date": "10:23:2020",
            "abstract": "I recently worked on a project that required using a mobile number for user authentication, instead of the traditional username and password. Almost everyone has a unique mobile number, so the requirement made sense. Our authentication tool is Keycloak, which does not ship with an option for mobile-based authentication. Instead, my team developed a custom authentication executor to meet the requirement.",
            "link": "https://developers.redhat.com/blog/2020/10/23/use-mobile-numbers-for-user-authentication-in-keycloak/#more-693617",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/MobileAuthentication_KeyCloak.png"
        },
        {
            "title": "Red Hat talks and workshops at NodeConf Remote 2020",
            "date": "10:23:2020",
            "abstract": "Red Hat is heading to NodeConf Remote 2020 with IBM to demonstrate a few of our favorite production-quality tools and solutions, all designed to help developers maintain their productivity while successfully navigating the vast and rapidly-changing cloud-native landscape.",
            "link": "https://developers.redhat.com/blog/2020/10/23/red-hat-talks-and-workshops-at-nodeconf-remote-2020/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/NodeConf-Remote-2020-screenshot-featured-image.png"
        },
        {
            "title": "Persistent storage in action: Understanding Red Hat OpenShift’s persistent volume framework",
            "date": "10:22:2020",
            "abstract": "Red Hat OpenShift is an enterprise-ready Kubernetes platform that provides a number of different models you can use to deploy an application. OpenShift 4.x uses Operators to deploy Kubernetes-native applications. It also supports Helm and traditional template-based deployments. Whatever deployment method you choose, it will be deployed as a wrapper to one or more existing OpenShift resources. Examples include BuildConfig, DeploymentConfig, and ImageStream.",
            "link": "https://developers.redhat.com/blog/2020/10/22/persistent-storage-in-action-understanding-red-hat-openshifts-persistent-volume-framework/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/os-persistent-volumes_2x.png"
        },
        {
            "title": "Get started with Node.js 14 on Red Hat OpenShift",
            "date": "10:20:2020",
            "abstract": "In April, the Node.js development team released Node.js 14. This major version release, code-named Fermium, will become a long-term support (LTS) release in October 2020.",
            "link": "https://developers.redhat.com/blog/2020/10/20/get-started-with-node-js-14-on-red-hat-openshift/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/nodejs-on-openshift_2x.png"
        },
        {
            "title": "Let’s collaborate! Take the 2020 Red Hat OpenShift Developer Survey now",
            "date": "10:16:2020",
            "abstract": "We are always looking for ways to understand better how developers create, build, manage, test, and deploy applications on and for Red Hat OpenShift. An important part of that effort is the annual OpenShift Developer Survey, which we’ve just released for 2020.",
            "link": "https://developers.redhat.com/blog/2020/10/16/lets-collaborate-take-the-2020-red-hat-openshift-developer-survey-now/#more-795747",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/OpenShiftSurvey.png"
        },
        {
            "title": "Securely connect Quarkus and Red Hat Data Grid on Red Hat OpenShift",
            "date": "10:15:2020",
            "abstract": "The release of Red Hat Data Grid 8.1 offers new features for securing applications deployed on Red Hat OpenShift. Naturally, I wanted to check them out for Quarkus. Using the Quarkus Data Grid extension made that easy to do.",
            "link": "https://developers.redhat.com/blog/2020/10/15/securely-connect-quarkus-and-red-hat-data-grid-on-red-hat-openshift/#more-794727",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/QuarkusDataGridonOpenShift.png"
        },
        {
            "title": "Checkpointing Java from outside of Java",
            "date": "10:15:2020",
            "abstract": "When OpenJDK‘s Java virtual machine (JVM) runs a Java application, it loads a dozen or so classes before it starts the main class. It runs a method several hundred times before it invokes the optimizing compiler on that method. This preparation is a critical component of Java’s “write once, run anywhere” power, but it comes at the cost of long startup times.",
            "link": "https://developers.redhat.com/blog/2020/10/15/checkpointing-java-from-outside-of-java/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/2020_Java_Checkpointing_Featured_Article_A.png"
        },
        {
            "title": "Building modern CI/CD workflows for serverless applications with Red Hat OpenShift Pipelines and Argo CD, Part 2",
            "date": "10:14:2020",
            "abstract": "In the first half of this article, I introduced Tekton as a framework for cloud-native CI/CD pipelines, and Argo CD as its perfect partner for GitOps on Red Hat OpenShift. Our example for the demonstration is a Knative service that deploys and serves a Quarkus application. Our goal is to develop a complete continuous integration and delivery process, which begins when a commit is initiated in the application’s GitHub repository and ends with the new application version deployed in the development, staging, and production environments.",
            "link": "https://developers.redhat.com/blog/2020/10/14/building-modern-ci-cd-workflows-for-serverless-applications-with-red-hat-openshift-pipelines-and-argo-cd-part-2/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/OpenShift_Pipelines_CiCd_Argo_Part2.png"
        },
        {
            "title": "Support for IBM Z and more in CodeReady Workspaces 2.4",
            "date": "10:13:2020",
            "abstract": "Red Hat CodeReady Workspaces 2.4 is now available. For this release, we focused on adding support for IBM Z and improving the IDE editor and configuration elements.",
            "link": "https://developers.redhat.com/blog/2020/10/13/support-for-ibm-z-and-more-in-codeready-workspaces-2-4/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/codeready-ibmz_2x.png"
        },
        {
            "title": "Quarked testing: Writing tests for Quarkus",
            "date": "10:12:2020",
            "abstract": "DevNation Tech Talks are hosted by the Red Hat technologists who create our products. These sessions include real solutions plus code and sample projects to help you get started. In this talk, you’ll learn about testing Quarkus applications and services from Alex Soto Bueno and Burr Sutter.",
            "link": "https://developers.redhat.com/blog/2020/10/12/quarked-testing-writing-tests-for-quarkus/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/Quarkus_Image.png"
        },
        {
            "title": "Static analysis with KubeAudit for Red Hat OpenShift",
            "date": "10:9:2020",
            "abstract": "In this article, we introduce a new utility for developers who want to ensure that their code transitions cleanly from upstream Kubernetes to Red Hat OpenShift. OpenShiftKubeAudit (KubeAudit) is a static analyzer that semantically checks a user’s code for known incompatibilities so you can fix them before bringing the code into OpenShift. KubeAudit is also simple to use and easy to extend.",
            "link": "https://developers.redhat.com/blog/2020/10/09/static-analysis-with-kubeaudit-for-red-hat-openshift/#more-788447",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/oskubeaudit_2x.png"
        },
        {
            "title": "Migrating C and C++ applications from Red Hat Enterprise Linux version 7 to version 8",
            "date": "10:8:2020",
            "abstract": "When moving an application that you’ve compiled on Red Hat Enterprise Linux (RHEL) 7 to RHEL 8, you will likely encounter issues due to changes in the application binary interface (ABI). The ABI describes the low-level binary interface between an application and its operating environment. This interface requires tools such as compilers and linkers, as well as the produced runtime libraries and the operating system itself, to agree upon the following:",
            "link": "https://developers.redhat.com/blog/2020/10/08/migrating-c-and-c-applications-from-red-hat-enterprise-linux-version-7-to-version-8/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/10rhel7-to-rhel8_2x.png"
        },
        {
            "title": "Install a signed certificate with Open Liberty 20.0.0.10’s Automatic Certificate Management Environment Support 2.0",
            "date": "10:7:2020",
            "abstract": "Red Hat Runtimes now supports the new Open Liberty 20.0.0.10 Java runtime. Open Liberty 20.0.0.10 features support for the Automatic Certificate Management Environment (ACME) protocol, which automates the process of obtaining a certificate signed by a certificate authority (CA). The Open Liberty 20.0.0.10 release also includes many bug fixes.",
            "link": "https://developers.redhat.com/blog/2020/10/07/install-a-signed-certificate-with-open-liberty-20-0-0-10s-automatic-certificate-management-environment-support-2-0/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/2020_certificate_Open_liberty_Acme_Featured_Article_B.png"
        },
        {
            "title": "Kubernetes integration and more in odo 2.0",
            "date": "10:6:2020",
            "abstract": "Odo is a developer-focused command-line interface (CLI) for OpenShift and Kubernetes. This article introduces highlights of the odo 2.0 release, which now integrates with Kubernetes. Additional highlights include the new default deployment method in odo 2.0, which uses devfiles for rapid, iterative development. We’ve also moved Operator deployment out of experimental mode, so you can easily deploy Operator-backed services from the odo command line.",
            "link": "https://developers.redhat.com/blog/2020/10/06/kubernetes-integration-and-more-in-odo-2-0/#more-792387",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/odo-release_2x.png"
        },
        {
            "title": "Customizing and tuning the Kuryr SDN for Red Hat OpenShift 3.11 on Red Hat OpenStack 13",
            "date": "10:2:2020",
            "abstract": "In a previous article, I showed you how to customize Red Hat OpenShift software-defined networking (SDN) for your organization’s requirements and restrictions. In this article, we’ll look at using the Kuryr SDN instead. Using Kuryr with OpenShift 3.11 on Red Hat OpenStack 13 changes the customization requirements because Kuryr works directly with OpenStack Neutron and Octavia.",
            "link": "https://developers.redhat.com/blog/2020/10/02/customizing-and-tuning-the-kuryr-sdn-for-red-hat-openshift-3-11-on-red-hat-openstack-13/#more-766097",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/09/2020_Kuryr_SDN_OS_OpenStack_Featured_Article_A.png"
        },
        {
            "title": "Command-line cluster management with Red Hat OpenShift’s new web terminal (tech preview)",
            "date": "10:1:2020",
            "abstract": "Red Hat OpenShift‘s web console simplifies many development and deployment chores to just a few clicks, but sometimes you need a command-line interface (CLI) to get things done on a cluster. Whether you’re learning by cut-and-paste in a tutorial or troubleshooting a deep bug in production (also often done by cut-and-paste), you’ll likely need to enter at least a line or two at a command prompt.",
            "link": "https://developers.redhat.com/blog/2020/10/01/command-line-cluster-management-with-red-hat-openshifts-new-web-terminal-tech-preview/#more-787327",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/09/WebTerminal_TechPreview_1x.png"
        },
        {
            "title": "Building modern CI/CD workflows for serverless applications with Red Hat OpenShift Pipelines and Argo CD, Part 1",
            "date": "10:1:2020",
            "abstract": "A recent article, The present and future of CI/CD with GitOps on Red Hat OpenShift, proposed Tekton as a framework for cloud-native CI/CD pipelines, and Argo CD as its perfect partner for GitOps. GitOps practices support continuous delivery in hybrid, multi-cluster Kubernetes environments.",
            "link": "https://developers.redhat.com/blog/2020/10/01/building-modern-ci-cd-workflows-for-serverless-applications-with-red-hat-openshift-pipelines-and-argo-cd-part-1/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/09/OpenShift_WebTerminal_TechPreview.png"
        },
        {
            "title": "AI software stack inspection with Thoth and TensorFlow",
            "date": "9:30:2020",
            "abstract": "Project Thoth develops open source tools that enhance the day-to-day life of developers and data scientists. Thoth uses machine-generated knowledge to boost the performance, security, and quality of your applications using artificial intelligence (AI) through reinforcement learning (RL). This machine-learning approach is implemented in Thoth adviser (if you want to know more, click here) and it is used by Thoth integrations to provide the software stack based on user inputs.",
            "link": "https://developers.redhat.com/blog/2020/09/30/ai-software-stack-inspection-with-thoth-and-tensorflow/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/09/Ai_Thoth.png"
        },
        {
            "title": "Quicker, easier GraphQL queries with Open Liberty 20.0.0.9",
            "date": "9:29:2020",
            "abstract": "Open Liberty 20.0.0.9 lets developers experiment with the type-safe SmallRye GraphQL Client API, and write and run GraphQL queries and mutations more easily with a built-in GraphiQL user interface (UI). This article introduces the new features and updates in Open Liberty 20.0.0.9:",
            "link": "https://developers.redhat.com/blog/2020/09/29/quicker-easier-graphql-queries-with-open-liberty-20-0-0-9/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/OpenLiberty-OL_logomark_400.png"
        },
        {
            "title": "Call an existing REST service with Apache Camel K",
            "date": "9:28:2020",
            "abstract": "With the release of Apache Camel K, it is possible to create and deploy integrations with existing applications that are quicker and more lightweight than ever. In many cases, calling an existing REST endpoint is the best way to connect a new system to an existing one. Take the example of a cafe serving coffee. What happens when the cafe wants to allow customers to use a delivery service like GrubHub? You would only need to introduce a single Camel K integration to connect the cafe and GrubHub systems.",
            "link": "https://developers.redhat.com/blog/2020/09/28/call-an-existing-rest-service-with-apache-camel-k/#more-760597",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/09/2020_Camel_K_REST_Service_Featured_Article_A.png"
        },
        {
            "title": "Build a data streaming pipeline using Kafka Streams and Quarkus",
            "date": "9:28:2020",
            "abstract": "In typical data warehousing systems, data is first accumulated and then processed. But with the advent of new technologies, it is now possible to process data as and when it arrives. We call this real-time data processing. In real-time processing, data streams through pipelines; i.e., moving from one system to another. Data gets generated from static sources (like databases) or real-time systems (like transactional applications), and then gets filtered, transformed, and finally stored in a database or pushed to several other systems for further processing. The other systems can then follow the same cycle—i.e., filter, transform, store, or push to other systems.",
            "link": "https://developers.redhat.com/blog/2020/09/28/build-a-data-streaming-pipeline-using-kafka-streams-and-quarkus/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/09/kafkaquarkus_2x.png"
        },
        {
            "title": "Rootless containers with Podman: The basics",
            "date": "9:25:2020",
            "abstract": "As a developer, you have probably heard a lot about containers. A container is a unit of software that provides a packaging mechanism that abstracts the code and all of its dependencies to make application builds fast and reliable. An easy way to experiment with containers is with the Pod Manager tool (Podman), which is a daemonless, open source, Linux-native tool that provides a command-line interface (CLI) similar to the docker container engine.",
            "link": "https://developers.redhat.com/blog/2020/09/25/rootless-containers-with-podman-the-basics/#more-748207",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/09/2020_Podman_Rootless_Container_Featured_Article_A.png"
        },
        {
            "title": "New C++ features in GCC 10",
            "date": "9:24:2020",
            "abstract": "The GNU Compiler Collection (GCC) 10.1 was released in May 2020. Like every other GCC release, this version brought many additions, improvements, bug fixes, and new features. Fedora 32 already ships GCC 10 as the system compiler, but it’s also possible to try GCC 10 on other platforms (see godbolt.org, for example). Red Hat Enterprise Linux (RHEL) users will get GCC 10 in the Red Hat Developer Toolset (RHEL 7), or the Red Hat GCC Toolset (RHEL 8).",
            "link": "https://developers.redhat.com/blog/2020/09/24/new-c-features-in-gcc-10/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Set up continuous integration for .NET Core with OpenShift Pipelines",
            "date": "9:24:2020",
            "abstract": "Have you ever wanted to set up continuous integration (CI) for .NET Core in a cloud-native way, but you didn’t know where to start? This article provides an overview, examples, and suggestions for developers who want to get started setting up a functioning cloud-native CI system for .NET Core.",
            "link": "https://developers.redhat.com/blog/2020/09/24/set-up-continuous-integration-for-net-core-with-openshift-pipelines/#more-747217",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/09/dotnet-pipelines_2x.png"
        },
        {
            "title": "Kubernetes: The evolution of distributed systems",
            "date": "9:23:2020",
            "abstract": "DevNation Tech Talks are hosted by the Red Hat technologists who create our products. These sessions include real solutions plus code and sample projects to help you get started. In this talk, you’ll learn about Kubernetes and distributed systems from Bilgin Ibryam and Burr Sutter.",
            "link": "https://developers.redhat.com/blog/2020/09/23/kubernetes-the-evolution-of-distributed-systems/#more-787807",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/09/Distributed-application-building-blocks.png"
        },
        {
            "title": "Troubleshooting user task errors in Red Hat Process Automation Manager and Red Hat JBoss BPM Suite",
            "date": "9:22:2020",
            "abstract": "I’ve been around Red Hat JBoss BPM Suite (jBPM) and Red Hat Process Automation Manager (RHPAM) for many years. Over that time, I’ve learned a lot about the lesser-known aspects of this business process management engine.",
            "link": "https://developers.redhat.com/blog/2020/09/22/troubleshooting-user-task-errors-in-red-hat-process-automation-manager-and-red-hat-jboss-bpm-suite/#more-755127",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/09/troubleshooting-pam-2x.png"
        },
        {
            "title": "Migrating from Fabric8 Maven Plugin to Eclipse JKube 1.0.0",
            "date": "9:21:2020",
            "abstract": "The recent release of Eclipse JKube 1.0.0 means that the Fabric8 Maven Plugin is no longer supported. If you are currently using the Fabric8 Maven Plugin, this article provides instructions for migrating to JKube instead. I will also explain the relationship between Eclipse JKube and the Fabric8 Maven Plugin (they’re the same thing) and introduce the highlights of the new Eclipse JKube 1.0.0 release. These migration instructions are for developers working on the Kubernetes and Red Hat OpenShift platforms.",
            "link": "https://developers.redhat.com/blog/2020/09/21/migrating-from-fabric8-maven-plugin-to-eclipse-jkube-1-0-0/#more-781287",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/09/maven8-migration-2x.png"
        },
        {
            "title": "New language support features in Apache Camel VS Code extension 0.0.27",
            "date": "9:18:2020",
            "abstract": "In this article, I share several new language support features in the recently released Language Support for Apache Camel VS Code extension 0.0.27. Before I discuss these improvements, please note that updates to the VS Code extension are available in other IDEs that support the Camel Language Server, including Eclipse IDE, Eclipse Che, and more. It is simply easier to focus on one IDE for my demonstrations, so I’ve chosen VS Code.",
            "link": "https://developers.redhat.com/blog/2020/09/18/new-language-support-features-in-apache-camel-vs-code-extension-0-0-27/#more-777727",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/09/2020_Apache-Camel-VS-Code_D.png"
        },
        {
            "title": "Kubeflow 1.0 monitoring and enhanced JupyterHub builds in Open Data Hub 0.8",
            "date": "9:18:2020",
            "abstract": "The new Open Data Hub version 0.8 (ODH) release includes many new features, continuous integration (CI) additions, and documentation updates. For this release, we focused on enhancing JupyterHub image builds, enabling more mixing of Open Data Hub and Kubeflow components, and designing our comprehensive end-to-end continuous integration and continuous deployment and delivery (CI/CD) process. In this article, we introduce the highlights of this newest release.",
            "link": "https://developers.redhat.com/blog/2020/09/18/kubeflow-1-0-monitoring-and-enhanced-jupyterhub-builds-in-open-data-hub-0-8/#more-778617",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/odh_logo1.png"
        },
        {
            "title": "How to switch Red Hat OpenShift Virtualization from hardware virtualization to software emulation",
            "date": "9:17:2020",
            "abstract": "DISCLAIMER: The following setup is not supported by Red Hat, even for dev/test/sandbox environments. It is only meant to demonstrate the technical possibilities. See Configuring your cluster for OpenShift Virtualization for information. In addition, Tiny Code Generator (TCG) is not supported or tested by Red Hat.",
            "link": "https://developers.redhat.com/blog/2020/09/17/how-to-switch-red-hat-openshift-virtualization-from-hardware-virtualization-to-software-emulation/#more-742637",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/5396174-3-150x150.png"
        },
        {
            "title": "Using OpenAPI with .NET Core",
            "date": "9:16:2020",
            "abstract": "In this article, we’ll look at using OpenAPI with .NET Core. OpenAPI is a specification for describing RESTful APIs. First, I’ll show you how to use OpenAPI to describe the APIs provided by an ASP.NET Core service. Then, we’ll use the API description to generate a strongly-typed client to use the web service with C#.",
            "link": "https://developers.redhat.com/blog/2020/09/16/using-openapi-with-net-core/#more-749667",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/09/2020_NetCore_OpenApi_Featured_ImageA.png"
        },
        {
            "title": "Deploying serverless Node.js applications on Red Hat OpenShift, Part 1",
            "date": "9:15:2020",
            "abstract": "Red Hat OpenShift Serverless recently became GA, and with it came new options for application deployment. This article introduces one of those new options, Knative Serving. I provide an overview of OpenShift Serverless and Knative Serving, then show you how to deploy a Node.js application as a Knative Serving service.",
            "link": "https://developers.redhat.com/blog/2020/09/15/deploying-serverless-node-js-applications-on-red-hat-openshift-part-1/#more-731067",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/05/nodejs-new-pantone-black.png"
        },
        {
            "title": "5 tips for developing Kubernetes Operators with the new Operator SDK",
            "date": "9:11:2020",
            "abstract": "Kubernetes Operators are all the rage this season, and the fame is well deserved. Operators are evolving from being used primarily by technical-infrastructure gurus to becoming more mainstream, Kubernetes-native tools for managing complex applications. Kubernetes Operators today are important for cluster administrators and ISV providers, and also for custom applications developed in house. They provide the base for a standardized operational model that is similar to what cloud providers offer. Operators also open the door to fully portable workloads and services on Kubernetes.",
            "link": "https://developers.redhat.com/blog/2020/09/11/5-tips-for-developing-kubernetes-operators-with-the-new-operator-sdk/#more-771997",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/08/operator-sdk-tips-n-tricks.png"
        },
        {
            "title": "Quarkus and Jakarta EE: Together, or not?",
            "date": "9:11:2020",
            "abstract": "In this article, I answer a question that I have seen asked on various forums: Will Quarkus be compatible with Jakarta EE? To understand our answer to that question, it is helpful to know the history of Quarkus and what we’re trying to achieve with it. So, please indulge me while I lay that groundwork.",
            "link": "https://developers.redhat.com/blog/2020/09/11/quarkus-and-jakarta-ee-together-or-not/#more-776377",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/Quarkus_Image.png"
        },
        {
            "title": "From code to production with OpenShift Pipelines and Argo CD",
            "date": "9:10:2020",
            "abstract": "Our team is responsible for a small GoLang application. The application’s developers are continuously sending code changes to the main branch, so for the past two years, our team has used GitOps for continuous integration (CI). We started out using GitOps to deploy applications to our test clusters; then, we began using it to run day two operations in our clusters.",
            "link": "https://developers.redhat.com/blog/2020/09/10/from-code-to-production-with-openshift-pipelines-and-argo-cd/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/08/BuildWorkflow.png"
        },
        {
            "title": "How to run Red Hat CodeReady Containers on Windows 10 Enterprise",
            "date": "9:9:2020",
            "abstract": "Red Hat CodeReady Containers allows you to spin up a small Red Hat OpenShift cluster on your local PC, without the need for a server, a cloud, or a team of operations people. For developers who want to get started immediately with cloud-native development, containers, and Kubernetes (as well as OpenShift), it’s a simple and slick tool. It runs on macOS, Linux, and all versions of Windows 10.",
            "link": "https://developers.redhat.com/blog/2020/09/09/how-to-run-red-hat-codeready-containers-on-windows-10-enterprise/#more-722737",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/09/codeready-windows.png"
        },
        {
            "title": "Cloud-native Java applications made easy: Eclipse JKube 1.0.0 now available",
            "date": "9:9:2020",
            "abstract": "After nine months of incubation with the Eclipse Foundation, Eclipse JKube 1.0.0 is finally here. This release marks the final deprecation of the great Fabric8 Maven Plugin (FMP) project. JKube is a complete replacement of FMP and includes all of the major features. Projects relying on FMP to create Apache Maven Java containers should migrate to Eclipse JKube to take full advantage of the new features, bug fixes, and upstream project maintenance described in this article.",
            "link": "https://developers.redhat.com/blog/2020/09/09/cloud-native-java-applications-made-easy-eclipse-jkube-1-0-0-now-available/#more-768247",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/08/2020_Jkube_A_1.png"
        },
        {
            "title": "How to install the CouchbaseDB Operator for Red Hat OpenShift on your laptop using Red Hat CodeReady Containers and Red Hat Marketplace",
            "date": "9:9:2020",
            "abstract": "Red Hat Marketplace is an online store of sorts, where you can choose the software that you want to install and run on your Red Hat OpenShift cluster. The analogy is a phone app store, where you select an app, and it’s automagically installed on your phone. With Marketplace, you simply register your cluster(s), select the software that you want, and it is installed for you. It could not be easier.",
            "link": "https://developers.redhat.com/blog/2020/09/09/how-to-install-the-couchbasedb-operator-for-red-hat-openshift-on-your-laptop-using-red-hat-codeready-containers-and-red-hat-marketplace/#more-771917",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/09/2020_RHM_Featured_ImageCouchBase.png"
        },
        {
            "title": "Install Red Hat OpenShift Operators on your laptop using Red Hat CodeReady Containers and Red Hat Marketplace",
            "date": "9:9:2020",
            "abstract": "Red Hat CodeReady Containers (CRC) is the quickest way for developers to get started with clusters on Red Hat OpenShift 4.1 or newer. CodeReady Containers is designed to run on a local computer. It simplifies setup and testing by emulating the cloud development environment locally with all of the tools that you need to develop container-based applications.",
            "link": "https://developers.redhat.com/blog/2020/09/09/install-red-hat-openshift-operators-on-your-laptop-using-red-hat-codeready-containers-and-red-hat-marketplace/#more-741307",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/09/codeready-marketplace.png"
        },
        {
            "title": "GitOps: Stop, collaborate and deploy",
            "date": "9:8:2020",
            "abstract": "DevNation Tech Talks are hosted by the Red Hat technologists who create our products. These sessions include real solutions plus code and sample projects to help you get started. In this talk, you’ll learn about GitOps from Ryan Cook and Burr Sutter.",
            "link": "https://developers.redhat.com/blog/2020/09/08/gitops-stop-collaborate-and-deploy/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/09/2020_GitOps_Kubernetes_Featured_ArticleB.png"
        },
        {
            "title": "Keeping Kubernetes secrets secret",
            "date": "9:7:2020",
            "abstract": "DevNation Tech Talks are hosted by the Red Hat technologists who create our products. These sessions include real solutions plus code and sample projects to help you get started. In this talk, you’ll learn how to manage Kubernetes secrets from Alex Soto Bueno and Burr Sutter.",
            "link": "https://developers.redhat.com/blog/2020/09/07/keeping-kubernetes-secrets-secret/#more-775297",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/02/top-secret-2054429_1920.png"
        },
        {
            "title": "Migrate your Java apps to containers with Migration Toolkit for Applications 5.0",
            "date": "9:4:2020",
            "abstract": "As a developer, you have probably experimented with Kubernetes. It’s also possible that you are already running several Java applications on a Kubernetes platform, maybe Red Hat OpenShift. These initial containerized applications were greenfield projects, where you enjoyed the benefits of a platform providing templated deployments, easy rollbacks, resource availability, security by default, and a manageable way to publish your services.",
            "link": "https://developers.redhat.com/blog/2020/09/04/migrate-your-java-apps-to-containers-with-migration-toolkit-for-applications-5-0/#more-768337",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/08/MTA_samples.png"
        },
        {
            "title": "The present and future of CI/CD with GitOps on Red Hat OpenShift",
            "date": "9:3:2020",
            "abstract": "The need to deliver applications faster is near-universal, even in organizations that traditionally are perceived as risk-averse. As the foundations of DevOps, continuous integration (CI) and continuous delivery (CD) are essential to application delivery in most organizations. Together, CI/CD tools and processes automate building and testing applications on every code or configuration change, then trigger a sequence of workflows that deliver the application to production.",
            "link": "https://developers.redhat.com/blog/2020/09/03/the-present-and-future-of-ci-cd-with-gitops-on-red-hat-openshift/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/08/openshift.png"
        },
        {
            "title": "Introduction to Tekton and Argo CD for multicluster development",
            "date": "9:3:2020",
            "abstract": "Over the last two years, my coworkers and I have worked on developing a multicluster project for Kubernetes and Red Hat OpenShift. We needed a way to efficiently deploy applications, oversee access and authorization, and manage application placement across clusters. This need led us to develop with Argo CD and GitOps.",
            "link": "https://developers.redhat.com/blog/2020/09/03/introduction-to-tekton-and-argo-cd-for-multicluster-development/#more-761917",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/08/argocd-tekton-2x.png"
        },
        {
            "title": "Add Java language support for Apache Camel K inside Eclipse Che",
            "date": "9:2:2020",
            "abstract": "Apache Camel K should be as lightweight as possible. Therefore, the Camel K project provides standalone Java files that describe a Camel integration. The downside to this practice is that existing IDEs cannot provide complete support out of the box. A few months ago, I mentioned the Java language support for Apache Camel K that was discussed in Red Hat Visual Studio Code (VS Code) extension, and how it provides Java language support for Apache Camel K. In this article and demo, I show you how to do the same with Eclipse Che and che.openshift.io.",
            "link": "https://developers.redhat.com/blog/2020/09/02/add-java-language-support-for-apache-camel-k-inside-eclipse-che/#more-739157",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/08/2020_Camel_K_Java_EclipseChe_Featured_Article_image_D.png"
        },
        {
            "title": "Using Spring Cloud Functions with OpenShift Serverless",
            "date": "9:1:2020",
            "abstract": "Spring Cloud Functions are yet another interesting option for Java developers when building serverless applications. You have already seen how to build and run applications for Red Hat OpenShift Serverless using Quarkus, but in this article, we talk about how to use Spring Cloud Functions and walk you through those steps. These steps are similar to running any other Spring Boot application with OpenShift Serverless. One of the benefits of building an open hybrid serverless platform is giving developers a choice of programming languages, tools, frameworks, and portability across any environment to run serverless applications. Beyond that, you want to ensure that the developer experience and overall workflow is intuitive and practical, which is what you will learn here.",
            "link": "https://developers.redhat.com/blog/2020/09/01/using-spring-cloud-functions-with-openshift-serverless/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/08/2020_OS_Serverless_SpringCloud_Function_Featuredimage_A.png"
        },
        {
            "title": "Introducing IDE support for Apache Camel K Modeline",
            "date": "8:31:2020",
            "abstract": "Apache Camel K is a lightweight integration framework built on Apache Camel that runs natively on Kubernetes. Camel K is designed explicitly for serverless and microservices architectures and allows you to run an integration written in Camel DSL on your cloud.",
            "link": "https://developers.redhat.com/blog/2020/08/31/introducing-ide-support-for-apache-camel-k-modeline/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/05/camel-k-coverimage.png"
        },
        {
            "title": "Vulnerability analysis with Red Hat CodeReady Dependency Analytics and Snyk Intel",
            "date": "8:28:2020",
            "abstract": "Red Hat CodeReady Dependency Analytics is a hosted service on OpenShift that provides vulnerability and compliance analysis for your applications, directly from your IDE. It automatically analyzes your software composition and provides recommendations to address security holes and licensing issues. The 0.1 release of CodeReady Dependency Analytics includes access to the Snyk Intel Vulnerability Database, which is a curated database of both unique and known open source software security advisories.",
            "link": "https://developers.redhat.com/blog/2020/08/28/vulnerability-analysis-with-red-hat-codeready-dependency-analytics-and-snyk/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/08/Screenshot-from-2020-07-29-14-46-35.png"
        },
        {
            "title": "Enable OpenShift Virtualization on Red Hat OpenShift",
            "date": "8:28:2020",
            "abstract": "Imagine an information technology (IT) world where everything is ideal: Every company has switched over to cloud-native applications, every application is containerized, everything is automated, and the IT people see that the world is good. Things are not so ideal in the real world, though, as we know. Applications remain tightly coupled with traditional virtual machine (VM) resources such as software libraries and hardware resources. The effort to migrate them from VMs to containers seems insurmountable, requiring years of dedicated spending and hours from developers and software architects.",
            "link": "https://developers.redhat.com/blog/2020/08/28/enable-openshift-virtualization-on-red-hat-openshift/#more-742287",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/Screen-Shot-2020-06-26-at-11.15.57-PM.png"
        },
        {
            "title": "Developing micro-microservices in C on Red Hat OpenShift",
            "date": "8:27:2020",
            "abstract": "Java holds its dominating position in enterprise middleware for good reasons; however, describing anything in Java as “micro” requires a generous interpretation. It isn’t unusual to find Java-based microservices that need half a gigabyte of RAM to provide modest functionality at a modest load. The trend toward serverless architectures, where services are started and stopped according to demand, does little to improve the situation.",
            "link": "https://developers.redhat.com/blog/2020/08/27/developing-micro-microservices-in-c-on-red-hat-openshift/#more-740807",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/08/2020_Microservices_C_OS_A_1.png"
        },
        {
            "title": "Connecting external clients to Red Hat AMQ Broker on Red Hat OpenShift",
            "date": "8:26:2020",
            "abstract": "Developers deploying Red Hat AMQ on Red Hat OpenShift often wonder how to connect external clients to AMQ Broker using the Transport Layer Security (TLS) protocol, which is an improved successor to the Secure Sockets Layer (SSL) protocol.",
            "link": "https://developers.redhat.com/blog/2020/08/26/connecting-external-clients-to-red-hat-amq-broker-on-red-hat-openshift/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/AMQP_diagram-1.png"
        },
        {
            "title": "Get started with JDK Flight Recorder in OpenJDK 8u",
            "date": "8:25:2020",
            "abstract": "The OpenJDK 8u 262 release includes several security-related patches and a new addition, JDK Flight Recorder (JFR). This article introduces OpenJDK developers to using JDK Flight Recorder with JDK Mission Control and related utilities. I will also briefly introduce you to Project Hamburg, also known as Container JFR.",
            "link": "https://developers.redhat.com/blog/2020/08/25/get-started-with-jdk-flight-recorder-in-openjdk-8u/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Java development on top of Kubernetes using Eclipse JKube",
            "date": "8:24:2020",
            "abstract": "",
            "link": "https://developers.redhat.com/blog/2020/08/24/java-development-on-top-of-kubernetes-using-eclipse-jkube/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/Cloud-Native-Java-Workflow-Using-Eclipse-JKube.png"
        },
        {
            "title": "Kubernetes-native Apache Kafka with Strimzi, Debezium, and Apache Camel (Kafka Summit 2020)",
            "date": "8:21:2020",
            "abstract": "Apache Kafka has become the leading platform for building real-time data pipelines. Today, Kafka is heavily used for developing event-driven applications, where it lets services communicate with each other through events. Using Kubernetes for this type of workload requires adding specialized components such as Kubernetes Operators and connectors to bridge the rest of your systems and applications to the Kafka ecosystem.",
            "link": "https://developers.redhat.com/blog/2020/08/21/kubernetes-native-apache-kafka-with-strimzi-debezium-and-apache-camel-kafka-summit-2020/#more-767187",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/05/camel_franz_kafka_2.png"
        },
        {
            "title": "Improved configuration and more in Red Hat CodeReady Workspaces 2.3",
            "date": "8:21:2020",
            "abstract": "Based on Eclipse Che, Red Hat CodeReady Workspaces (CRW) is a Red Hat OpenShift-native developer environment that supports cloud-native development. CodeReady Workspaces 2.3 is now available. For this release, we focused on improving CRW’s configuration options, updating to the latest versions of IDE plugins, and adding new devfiles.",
            "link": "https://developers.redhat.com/blog/2020/08/21/improved-configuration-and-more-in-red-hat-codeready-workspaces-2-3/#more-767977",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/Logo-Red_Hat-CodeReady_Workspaces-A-Standard-RGB.png"
        },
        {
            "title": "‘Hello, World’ tutorial with Kubernetes Operators",
            "date": "8:21:2020",
            "abstract": "Kubernetes Operators reduce the work of human operators or site reliability engineers. Rather than a half-baked definition, I refer you to this original definition from the creators of the Kubernetes Operator Framework: Operators are Kubernetes applications.",
            "link": "https://developers.redhat.com/blog/2020/08/21/hello-world-tutorial-with-kubernetes-operators/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/07/1_30D09VyYFygRqLwvURjelg.png"
        },
        {
            "title": "JSON logging updates in Open Liberty 20.0.0.8",
            "date": "8:20:2020",
            "abstract": "With Open Liberty 20.0.0.8, you can now customize HTTP access log fields in JSON logs. This feature allows you to include fields from the accessLogging logFormat attribute in your JSON logs. You also can write a JSON log file directly to system.out, without wrapping it in a liberty_message event.",
            "link": "https://developers.redhat.com/blog/2020/08/20/json-logging-updates-in-open-liberty-20-0-0-8/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/OpenLiberty-OL_logomark_400.png"
        },
        {
            "title": "Multipath TCP on Red Hat Enterprise Linux 8.3: From 0 to 1 subflows",
            "date": "8:19:2020",
            "abstract": "Multipath TCP (MPTCP) extends traditional TCP to allow reliable end-to-end delivery over multiple simultaneous TCP paths, and is coming as a tech preview on Red Hat Enterprise Linux 8.3. This is the first of two articles for users who want to practice with the new MPTCP functionality on a live system. In this first part, we show you how to enable the protocol in the kernel and let client and server applications use the MPTCP sockets. Then, we run diagnostics on the kernel in a sample test network, where endpoints are using a single subflow.",
            "link": "https://developers.redhat.com/blog/2020/08/19/multipath-tcp-on-red-hat-enterprise-linux-8-3-from-0-to-1-subflows/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/07/davide-13-150x150.png"
        },
        {
            "title": "OpenShift 4.5: Bringing developers joy with Kubernetes 1.18 and so much more",
            "date": "8:18:2020",
            "abstract": "Since the first Red Hat OpenShift release in 2015, Red Hat has put out numerous releases based on Kubernetes. Five years later, Kubernetes is celebrating its sixth birthday, and last month, we announced the general availability of Red Hat OpenShift Container Platform 4.5. In this article, I offer a high-level view of the latest OpenShift release and its technology and feature updates based on Kubernetes 1.18.",
            "link": "https://developers.redhat.com/blog/2020/08/18/openshift-4-5-bringing-developers-joy-with-kubernetes-1-18-and-so-much-more/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/05/Logo-Red_Hat-OpenShift-A-Standard-RGB.png"
        },
        {
            "title": "iptables: The two variants and their relationship with nftables",
            "date": "8:18:2020",
            "abstract": "In Red Hat Enterprise Linux (RHEL) 8, the userspace utility program iptables has a close relationship to its successor, nftables. The association between the two utilities is subtle, which has led to confusion among Linux users and developers. In this article, I attempt to clarify the relationship between the two variants of iptables and its successor program, nftables.",
            "link": "https://developers.redhat.com/blog/2020/08/18/iptables-the-two-variants-and-their-relationship-with-nftables/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "OpenShift joins the Argo CD community (KubeCon Europe 2020)",
            "date": "8:17:2020",
            "abstract": "As Kubernetes and Red Hat OpenShift platform adoption grow and organizations move a larger portion of their infrastructure to these platforms, organizations are increasingly faced with the challenge of managing hybrid multicluster environments across the public cloud and on-premises infrastructure. While this approach brings flexibility and scalability to managing applications, the ability to ensure configuration consistency across these clusters, and the ability to roll out applications to multiple clusters in a consistent manner becomes a necessity. Enter the Argo CD GitOps Kubernetes Operator.",
            "link": "https://developers.redhat.com/blog/2020/08/17/openshift-joins-the-argo-cd-community-kubecon-europe-2020/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/08/Argo-CD-application-state.png"
        },
        {
            "title": "Introduction to cloud-native CI/CD with Tekton (KubeCon Europe 2020)",
            "date": "8:14:2020",
            "abstract": "If you’re interested in cloud-native CI/CD and Tekton but haven’t had a chance to get hands-on with the technology yet, the KubeCon Europe Virtual event provides an opportunity to do that. Tekton is a powerful and flexible open source framework for creating cloud-native CI/CD pipelines. It integrates with Kubernetes and allows developers to build, test, and deploy across multiple cloud providers and on-premises clusters as shown in Figure 1.",
            "link": "https://developers.redhat.com/blog/2020/08/14/introduction-to-cloud-native-ci-cd-with-tekton-kubecon-europe-2020/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Introduction to Strimzi: Apache Kafka on Kubernetes (KubeCon Europe 2020)",
            "date": "8:14:2020",
            "abstract": "Apache Kafka has emerged as the leading platform for building real-time data pipelines. Born as a messaging system, mainly for the publish/subscribe pattern, Kafka has established itself as a data-streaming platform for processing data in real-time. Today, Kafka is also heavily used for developing event-driven applications, enabling the services in your infrastructure to communicate with each other through events using Apache Kafka as the backbone. Meanwhile, cloud-native application development is gathering more traction thanks to Kubernetes.",
            "link": "https://developers.redhat.com/blog/2020/08/14/introduction-to-strimzi-apache-kafka-on-kubernetes-kubecon-europe-2020/#more-764417",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/08/strimzilogo_stacked_default_600px.png"
        },
        {
            "title": "OpenShift for Kubernetes developers: Getting started",
            "date": "8:14:2020",
            "abstract": "If you are familiar with containers and Kubernetes, you have likely heard of the enterprise features that Red Hat OpenShift brings to this platform. In this article, I introduce developers familiar with Kubernetes to OpenShift’s command-line features and native extension API resources, including build configurations, deployment configurations, and image streams.",
            "link": "https://developers.redhat.com/blog/2020/08/14/openshift-for-kubernetes-developers-getting-started/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Open Data Hub 0.7 adds support for Kubeflow 1.0",
            "date": "8:13:2020",
            "abstract": "Open Data Hub (ODH) is a blueprint for building an AI-as-a-Service (AIaaS) platform on Red Hat OpenShift 4. Version 0.7 of Open Data Hub includes support for deploying Kubeflow 1.0 on OpenShift, as well as increased component testing on the OpenShift continuous integration (CI) system. This article explores the recent updates.",
            "link": "https://developers.redhat.com/blog/2020/08/13/open-data-hub-0-7-adds-support-for-kubeflow-1-0/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/05/datahub_color_vert-gry-bg.png"
        },
        {
            "title": "Introducing the Red Hat Flatpak runtime for desktop containers",
            "date": "8:12:2020",
            "abstract": "For many years, application developers who wanted to create desktop applications for Linux had to build their applications not just for a particular Linux operating system, but for a particular version of that operating system. Whether it was on the server-side or the desktop, developers wanted to create applications that reliably worked the same in development and production environments. They wanted to upgrade the production environment without having to rebuild and revalidate every running application.",
            "link": "https://developers.redhat.com/blog/2020/08/12/introducing-the-red-hat-flatpak-runtime-for-desktop-containers/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/OS-with-Flatpaks.png"
        },
        {
            "title": "Secure authentication with Red Hat AMQ 7.7 and ApacheDS LDAP server",
            "date": "8:11:2020",
            "abstract": "In this article, we will integrate Red Hat AMQ 7.7 with the ApacheDS LDAP server. However, any version of the AMQ 7.x series can be integrated with the steps mentioned in this article.",
            "link": "https://developers.redhat.com/blog/2020/08/11/secure-authentication-with-red-hat-amq-7-7-and-apacheds-ldap-server/#more-751647",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/07/ldap-2-1.png"
        },
        {
            "title": "Kubernetes and the hybrid cloud with Skupper",
            "date": "8:10:2020",
            "abstract": "DevNation Tech Talks are hosted by the Red Hat technologists who create our products. These sessions include real solutions plus code and sample projects to help you get started. In this talk, you’ll learn about Kubernetes and the hybrid cloud with Skupper from Ted Ross and Burr Sutter.",
            "link": "https://developers.redhat.com/blog/2020/08/10/kubernetes-and-the-hybrid-cloud-with-skupper/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/08/skupper-kubernetes-clusters.png"
        },
        {
            "title": "Reactive Quarkus: A Java Mutiny",
            "date": "8:7:2020",
            "abstract": "DevNation Tech Talks are hosted by the Red Hat technologists who create our products. These sessions include real solutions plus code and sample projects to help you get started. In this talk, you’ll learn about reactive Quarkus and Mutiny from Clement Escoffier and Edson Yanaga.",
            "link": "https://developers.redhat.com/blog/2020/08/07/reactive-quarkus-a-java-mutiny/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/08/benefits-of-reactive-programming.png"
        },
        {
            "title": "A deep dive into Keycloak",
            "date": "8:7:2020",
            "abstract": "DevNation Tech Talks are hosted by the Red Hat technologists who create our products. These sessions include real solutions plus code and sample projects to help you get started. In this talk, you’ll learn about Keycloak from Stian Thorgersen and Burr Sutter.",
            "link": "https://developers.redhat.com/blog/2020/08/07/a-deep-dive-into-keycloak/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/08/Keycloak-overview-screenshot.png"
        },
        {
            "title": "Monitoring .NET Core applications on Kubernetes",
            "date": "8:5:2020",
            "abstract": "Prometheus is an open source monitoring solution that collects metrics from the system and its applications. As a developer, you can query these metrics and use them to create alerts, which you can use as a source for dashboards. One example would be using Prometheus metrics with Grafana.",
            "link": "https://developers.redhat.com/blog/2020/08/05/monitoring-net-core-applications-on-kubernetes/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/07/prometheus_screenshot-featured.png"
        },
        {
            "title": "HTTP-based Kafka messaging with Red Hat AMQ Streams",
            "date": "8:4:2020",
            "abstract": "Apache Kafka is a rock-solid, super-fast, event streaming backbone that is not only for microservices. It’s an enabler for many use cases, including activity tracking, log aggregation, stream processing, change-data capture, Internet of Things (IoT) telemetry, and more.",
            "link": "https://developers.redhat.com/blog/2020/08/04/http-based-kafka-messaging-with-red-hat-amq-streams/#more-720187",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/07/kafka-bridge-1-1024x683.png"
        },
        {
            "title": "Authorizing multi-language microservices with Louketo Proxy",
            "date": "8:3:2020",
            "abstract": "Update August 25, 2020: The Louketo Proxy team has announced that it is sunsetting the Louketo project. Read the link for more information, and watch our site for a new article detailing how to authorize multi-language microservices using a different method.",
            "link": "https://developers.redhat.com/blog/2020/08/03/authorizing-multi-language-microservices-with-louketo-proxy/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/sidecar.png"
        },
        {
            "title": "Choosing the right asynchronous-messaging infrastructure for the job",
            "date": "7:31:2020",
            "abstract": "The term asynchronous means “not occurring at the same time.” In the context of distributed systems and messaging, this term implies that request processing will occur at an arbitrary point in time. Asynchronous interactions hold many advantages over synchronous ones, but they also introduce new challenges. In this article, we will focus on specific considerations for choosing the asynchronous-messaging infrastructure for your event-driven systems.",
            "link": "https://developers.redhat.com/blog/2020/07/31/choosing-the-right-asynchronous-messaging-infrastructure-for-the-job/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/messaging_infrastructures.png"
        },
        {
            "title": "How to fix .NET Core’s ‘Unable to obtain lock file access’ error on Red Hat OpenShift",
            "date": "7:30:2020",
            "abstract": "Well, it finally happened. Despite the added assurances of working with containers and Kubernetes, the old “It works on my machine” scenario reared its ugly head in my .NET Core (C#) code. The image that I created worked fine on my local PC—a Fedora 32 machine—but it crashed when I tried running it in my Red Hat OpenShift cluster.",
            "link": "https://developers.redhat.com/blog/2020/07/30/how-to-fix-net-cores-unable-to-obtain-lock-file-access-error-on-red-hat-openshift/#more-731737",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/07/2020_Feaatured_image_Kube_.NET_.png"
        },
        {
            "title": "From notebooks to pipelines: Using Open Data Hub and Kubeflow on OpenShift",
            "date": "7:29:2020",
            "abstract": "Data scientists often use notebooks to explore data and create and experiment with models. At the end of this exploratory phase is the product-delivery phase, which is basically getting the final model to production. Serving a model in production is not a one-step final process, however. It is a continuous phase of training, development, and data monitoring that is best captured or automated using pipelines. This brings us to a dilemma: How do you move code from notebooks to containers orchestrated in a pipeline, and schedule the pipeline to run after specific triggers like time of day, new batch data, and monitoring metrics?",
            "link": "https://developers.redhat.com/blog/2020/07/29/from-notebooks-to-pipelines-using-open-data-hub-and-kubeflow-on-openshift/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Creating event sources in the OpenShift 4.5 web console",
            "date": "7:28:2020",
            "abstract": "Red Hat OpenShift 4.5 makes it easier than ever to deploy and run event-driven applications that react to real-time information via event notifications. Empowered by OpenShift Serverless, applications come to life through events, scaling up resources as needed (or up to a pre-configured limit), and then scaling back to zero after the resource burst is over.",
            "link": "https://developers.redhat.com/blog/2020/07/28/creating-event-sources-in-the-openshift-4-5-web-console/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/07/3-event-broker.png"
        },
        {
            "title": "Deploy your Java web application into the cloud using Eclipse JKube",
            "date": "7:27:2020",
            "abstract": "Before we had Spring Boot and similar frameworks, a web app container was the main requirement for deploying Java web applications. We now live in the age of microservices, and many Java applications are developed on top of Quarkus, Thorntail, or Spring Boot. But some use cases still require an old-school web application.",
            "link": "https://developers.redhat.com/blog/2020/07/27/deploy-your-java-web-application-into-the-cloud-using-eclipse-jkube/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/mn-face-150x150.png"
        },
        {
            "title": "Installing Red Hat Advanced Cluster Management (ACM) for Kubernetes",
            "date": "7:23:2020",
            "abstract": "Red Hat Advanced Cluster Management (ACM) for Kubernetes offers end-to-end visibility and control for managing your cluster and application lifecycle. Among other features, it ensures security and compliance for your entire Kubernetes domain across multiple data centers and public clouds.",
            "link": "https://developers.redhat.com/blog/2020/07/23/installing-red-hat-advanced-cluster-management-acm-for-kubernetes/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/3.png"
        },
        {
            "title": "Open Data Hub and Kubeflow installation customization",
            "date": "7:23:2020",
            "abstract": "The main goal of Kubernetes is to reach the desired state: to deploy our pods, set up the network, and provide storage. This paradigm extends to Operators, which use custom resources to define the state. When the Operator picks up the custom resource, it will always try to get to the state defined by it. That means that if we modify a resource that is managed by the Operator, it will quickly replace it to match the desired state.",
            "link": "https://developers.redhat.com/blog/2020/07/23/open-data-hub-and-kubeflow-installation-customization/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/odh_logo1.png"
        },
        {
            "title": "New features in Red Hat CodeReady Studio 12.16.0.GA and JBoss Tools 4.16.0.Final for Eclipse 2020-06",
            "date": "7:21:2020",
            "abstract": "JBoss Tools 4.16.0 and Red Hat CodeReady Studio 12.16 for Eclipse 4.16 (2020-06) are now available. For this release, we focused on improving Quarkus– and container-based development and fixing bugs. We also updated the Hibernate Tools runtime provider and Java Developer Tools (JDT) extensions, which are now compatible with Java 14. Additionally, we made many changes to platform views, dialogs, and toolbars in the user interface (UI).",
            "link": "https://developers.redhat.com/blog/2020/07/21/new-features-in-red-hat-codeready-studio-12-16-0-ga-and-jboss-tools-4-16-0-final-for-eclipse-2020-06/#more-750567",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/07/Logo-Red_Hat-CodeReady_Studio-B-Standard-RGB.png"
        },
        {
            "title": "Advanced Helm support in the OpenShift 4.5 web console",
            "date": "7:20:2020",
            "abstract": "Helm is a popular package manager for Kubernetes that is fully supported on Red Hat OpenShift. Starting with OpenShift 4.5, we’ve made working with Helm charts in the OpenShift web console more intuitive than ever. In this article, we introduce the new features for accessing and managing Helm charts.",
            "link": "https://developers.redhat.com/blog/2020/07/20/advanced-helm-support-in-the-openshift-4-5-web-console/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/07/45-HelmReleases-04-1.png"
        },
        {
            "title": "Best practices: Using health checks in the OpenShift 4.5 web console",
            "date": "7:20:2020",
            "abstract": "For an enterprise application to succeed, you need many moving parts to work correctly. If one piece breaks, the system must be able to detect the issue and operate without that component until it is repaired. Ideally, all of this should happen automatically. In this article, you will learn how to use health checks to improve application reliability and uptime in Red Hat OpenShift 4.5. If you want to learn more about what’s new and updated in OpenShift 4.5, read What’s new in the OpenShift 4.5 console developer experience.",
            "link": "https://developers.redhat.com/blog/2020/07/20/best-practices-using-health-checks-in-the-openshift-4-5-web-console/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Flexible single sign-on authentication and more in Open Liberty 20.0.0.7",
            "date": "7:17:2020",
            "abstract": "Open Liberty 20.0.0.7 lets you disable the default of returning Lightweight Third-Party Authentication (LTPA) cookies for authentication when using Trust Association Interceptor (TAI) or Simple and Protected GSS-API Negotiation Mechanism (SPNEGO) authentication. You can also disable JSON Web Token (JWT)  cookies when using JWT’s single sign-on (SSO) feature. In this article, we introduce these improvements and more in the new Open Liberty 20.0.0.7 release:",
            "link": "https://developers.redhat.com/blog/2020/07/17/flexible-single-sign-on-authentication-and-more-in-open-liberty-20-0-0-7/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/OpenLiberty-OL_logomark_400.png"
        },
        {
            "title": "Migrating Spring Boot tests to Quarkus",
            "date": "7:17:2020",
            "abstract": "As developers, we don’t always consider test migration when we think about adopting a new framework. Tests are important, however, because they ensure that our code meets its requirements and works as desired, especially when we add new features and functionality.",
            "link": "https://developers.redhat.com/blog/2020/07/17/migrating-spring-boot-tests-to-quarkus/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/07/quarkus_test.png"
        },
        {
            "title": "Improved navigation in the OpenShift 4.5 Developer perspective",
            "date": "7:16:2020",
            "abstract": "The new Red Hat OpenShift 4.5 release includes a more streamlined and customizable navigation experience in the web console’s Developer perspective. In this article, we quickly share the highlights of the new navigation features that we added based on user feedback.",
            "link": "https://developers.redhat.com/blog/2020/07/16/improved-navigation-in-the-openshift-4-5-developer-perspective/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/07/45-Nav-F02.png"
        },
        {
            "title": "What’s new in the OpenShift 4.5 console developer experience",
            "date": "7:16:2020",
            "abstract": "Each new release of Red Hat OpenShift includes usability improvements and features to help developers meet their goals. In OpenShift 4.5, we’ve improved navigation and added a mechanism for customizing navigation and accessing frequently used resources from the Developer perspective.",
            "link": "https://developers.redhat.com/blog/2020/07/16/whats-new-in-the-openshift-4-5-console-developer-experience/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/07/openshift_logo.png"
        },
        {
            "title": "Developing at the edge: Best practices for edge computing",
            "date": "7:16:2020",
            "abstract": "Edge computing continues to gain force as ever more companies increase their investments in edge, even if they’re only dipping their toes in with small-scale pilot deployments. Emerging use cases like Internet-of-Things (IoT), augmented reality, and virtual reality (AR/VR), robotics, and telecommunications-network functions are often cited as key drivers for companies moving computing to the edge. Traditional enterprises are also looking at edge computing to better support their remote offices, retail locations, manufacturing plants, and more. At the network edge, service providers can deploy an entirely new class of services to take advantage of their proximity to customers.",
            "link": "https://developers.redhat.com/blog/2020/07/16/developing-at-the-edge-best-practices-for-edge-computing/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2019/12/edge-computing.png"
        },
        {
            "title": "Load balancing Red Hat JBoss Enterprise Application Platform subclusters with mod_cluster",
            "date": "7:15:2020",
            "abstract": "This article introduces a way to build and manage clustered environments using subclusters in a domain-mode installation of Red Hat JBoss Enterprise Application Platform (JBoss EAP). I assume that readers are familiar with JBoss EAP and the Apache HTTP Server (HTTPD) mod_cluster module. I introduce the load balancing group configuration for that module.",
            "link": "https://developers.redhat.com/blog/2020/07/15/load-balancing-red-hat-jboss-enterprise-application-platform-subclusters-with-mod_cluster/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Developing and testing on production with Kubernetes and Istio Workspace",
            "date": "7:14:2020",
            "abstract": "Due to container-orchestration platforms like Kubernetes and Red Hat OpenShift, developers have become very efficient about deploying and managing distributed and containerized applications. But can we say the same about application development and testing?",
            "link": "https://developers.redhat.com/blog/2020/07/14/developing-and-testing-on-production-with-kubernetes-and-istio-workspace/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/05/inner-loop-cloud.png"
        },
        {
            "title": "Generate automated Grafana metrics dashboards for MicroProfile apps",
            "date": "7:10:2020",
            "abstract": "Grafana is an awesome visualization tool for seeing real-time metrics from your applications, and you can combine it with MicroProfile and similar tools to create one dashboard for multiple projects. Different projects use different names for metrics, however, so it is often necessary (and tedious) to handcraft the metrics for each project. Moreover, each project can expose its own custom metrics, and each MicroProfile vendor can also produce custom metrics, so there are many manual steps involved if you want to see all of your metrics in one place.",
            "link": "https://developers.redhat.com/blog/2020/07/10/generate-automated-grafana-metrics-dashboards-for-microprofile-apps/#more-740217",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/07/Screen-Shot-2020-06-19-at-12.14.14-PM.png"
        },
        {
            "title": "Performance and usability enhancements in Red Hat CodeReady Workspaces 2.2",
            "date": "7:10:2020",
            "abstract": "Red Hat CodeReady Workspaces 2.2 is now available. For the improvements in this release, we focused on performance and configuration, plus updating CodeReady Workspaces 2.2 to use newer versions of the most popular runtimes and stacks. We also added the ability to allocate only the CPU that you need for IDE plugins, and we introduced a new diagnostic feature that lets you start up a workspace in debug mode.",
            "link": "https://developers.redhat.com/blog/2020/07/10/performance-and-usability-enhancements-in-red-hat-codeready-workspaces-2-2/#more-739337",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/Logo-Red_Hat-CodeReady_Workspaces-A-Standard-RGB.png"
        },
        {
            "title": "Behavior is easy, state is hard: Tame inconsistent state in your Java code",
            "date": "7:9:2020",
            "abstract": "DevNation Tech Talks are hosted by the Red Hat technologists who create our products. These sessions include real solutions plus code and sample projects to help you get started. In this talk, you’ll learn the root cause of common inconsistent state-related bugs in your production Java code—and how to solve them—from Edson Yanaga and Burr Sutter.",
            "link": "https://developers.redhat.com/blog/2020/07/09/behavior-is-easy-state-is-hard-tame-inconsistent-state-in-your-java-code/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/Java-Entity-code-Edson-Yanaga.png"
        },
        {
            "title": "Improved XML grammar binding and more in Red Hat VS Code XML extension 0.13.0",
            "date": "7:8:2020",
            "abstract": "Following closely on the huge 0.12.0 update, the new Red Hat XML extension for Visual Studio Code (VS Code) 0.13.0 release makes XML editing in VS Code even better. For this release, we focused on making it easier to bind and generate a new XML Schema Definition (XSD) or Document Type Definition (DTD) grammar file from an existing XML file. Other highlights include document link support for xsi:schemaLocation, XML catalog snippets, support for XML catalog path validation, and support for DTD SystemId file path completion.",
            "link": "https://developers.redhat.com/blog/2020/07/08/improved-xml-grammar-binding-and-more-in-red-hat-vs-code-xml-extension-0-13-0/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Improve your code: Tales from confinement without a debugger",
            "date": "7:7:2020",
            "abstract": "I have always been impressed by developers who make do without a debugger, and have often wished I could be more like them. I vaguely recall a colleague saying he never used a debugger, favoring printf over gdb. Also, in my rookie years, I vividly recall chasing a kernel bug with a friend who was using objdump and the source of a much older kernel:",
            "link": "https://developers.redhat.com/blog/2020/07/07/improve-your-code-tales-from-confinement-without-a-debugger/#more-726367",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/insects-4798271_1280.png"
        },
        {
            "title": "Profile-guided optimization in Clang: Dealing with modified sources",
            "date": "7:6:2020",
            "abstract": "Profile-guided optimization (PGO) is a now-common compiler technique for improving the compilation process. In PGO (sometimes pronounced “pogo”), an administrator uses the first version of the binary to collect a profile, through instrumentation or sampling, then uses that information to guide the compilation process.",
            "link": "https://developers.redhat.com/blog/2020/07/06/profile-guided-optimization-in-clang-dealing-with-modified-sources/#more-724947",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Automate workshop setup with Ansible playbooks and CodeReady Workspaces",
            "date": "7:3:2020",
            "abstract": "At Red Hat, we do many in-person and virtual workshops for customers, partners, and other open source developers. In most cases, the workshops are of the “bring your own device” variety, so we face a range of hardware and software setups and corporate endpoint-protection schemes, as well as different levels of system knowledge.",
            "link": "https://developers.redhat.com/blog/2020/07/03/automate-workshop-setup-with-ansible-playbooks-and-codeready-workspaces/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/Logo-Red_Hat-CodeReady_Workspaces-A-Standard-RGB.png"
        },
        {
            "title": "A developer-centered approach to application development",
            "date": "7:3:2020",
            "abstract": "Do you dream of a local development environment that’s easy to configure and works independently from the software layers that you are currently not working on? I do!",
            "link": "https://developers.redhat.com/blog/2020/07/03/a-developer-centered-approach-to-application-development/#more-724407",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/05/download-2-150x150.png"
        },
        {
            "title": "Build a simple cloud-native change data capture pipeline",
            "date": "7:2:2020",
            "abstract": "Change data capture (CDC) is a well-established software design pattern for a system that monitors and captures data changes so that other software can respond to those events. Using KafkaConnect, along with Debezium Connectors and the Apache Camel Kafka Connector, we can build a configuration-driven data pipeline to bridge traditional data stores and new event-driven architectures.",
            "link": "https://developers.redhat.com/blog/2020/07/02/build-a-simple-cloud-native-change-data-capture-pipeline/#more-725217",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/Screenshot-2020-06-19-at-5.36.17-PM.png"
        },
        {
            "title": "Improved schema binding and more in Red Hat XML extension for VS Code 0.12.0 and LemMinX",
            "date": "7:2:2020",
            "abstract": "The latest update of the Red Hat XML extension for Visual Studio Code (VS Code), version 0.12.0, is packed with bug fixes and new features. It includes the new version of the underlying Eclipse LemMinX XML language server. In this update, we streamlined the process of writing XML Schema Definitions (XSD) and Document Type Definitions (DTD). We also added shortcuts to bind XML documents to either of these types of XML grammar.",
            "link": "https://developers.redhat.com/blog/2020/07/02/improved-schema-binding-and-more-in-red-hat-xml-extension-for-vs-code-0-12-0-and-lemminx/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Install Apache Tomcat and deploy a Java web application on Red Hat OpenShift",
            "date": "7:1:2020",
            "abstract": "If you are new to OpenShift, then you might want to install Apache Tomcat on top of it for simpler experimentation. This article guides you through installing Apache Tomcat from a Docker image and then using it to deploy a Java web app on Red Hat OpenShift. I also show you how to access the Tomcat management console on OpenShift.",
            "link": "https://developers.redhat.com/blog/2020/07/01/install-apache-tomcat-and-deploy-a-java-web-application-on-red-hat-openshift/#more-724737",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/managerpage.png"
        },
        {
            "title": "Develop Eclipse MicroProfile applications on Red Hat JBoss Enterprise Application Platform Expansion Pack 1.0 with Red Hat CodeReady Workspaces",
            "date": "7:1:2020",
            "abstract": "This article builds on my previous tutorial, Enable Eclipse MicroProfile applications on Red Hat JBoss Enterprise Application Platform 7.3. To follow the examples, you must have Eclipse MicroProfile enabled in your Red Hat JBoss Enterprise Application Platform Expansion Pack (JBoss EAP XP) 1.0.0.GA installation, via Red Hat CodeReady Studio. See the previous article for installation instructions.",
            "link": "https://developers.redhat.com/blog/2020/07/01/develop-eclipse-microprofile-applications-on-red-hat-jboss-enterprise-application-platform-expansion-pack-1-0-with-red-hat-codeready-workspaces/#more-734667",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/building_opentracing_example.png"
        },
        {
            "title": "Kourier: A lightweight Knative Serving ingress",
            "date": "6:30:2020",
            "abstract": "Until recently, Knative Serving used Istio as its default networking component for handling external cluster traffic and service-to-service communication. Istio is a great service mesh solution, but it can add unwanted complexity and resource use to your cluster if you don’t need it.",
            "link": "https://developers.redhat.com/blog/2020/06/30/kourier-a-lightweight-knative-serving-ingress/#more-732567",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/Kourier_diagram.png"
        },
        {
            "title": "Migrating a namespace-scoped Operator to a cluster-scoped Operator",
            "date": "6:26:2020",
            "abstract": "Within the context of Kubernetes, a namespace allows dividing resources, policies, authorization, and a boundary for cluster objects. In this article, we cover two different types of Operators: namespace-scoped and cluster-scoped. We then walk through an example of how to migrate from one to the other, which illustrates the difference between the two.",
            "link": "https://developers.redhat.com/blog/2020/06/26/migrating-a-namespace-scoped-operator-to-a-cluster-scoped-operator/#more-721857",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Introducing the Red Hat build of the OpenJDK Universal Base Images—now in Red Hat Enterprise Linux 8.2",
            "date": "6:25:2020",
            "abstract": "With the recent release of Red Hat Enterprise Linux 8.2, we also added the first Red Hat build of OpenJDK Universal Base Images. These General Availability (GA) images for OpenJDK 8 and OpenJDK 11 set a new baseline for anyone who wants to develop Java applications that run inside containers in a secure, stable, and tested manner.",
            "link": "https://developers.redhat.com/blog/2020/06/25/introducing-the-red-hat-build-of-the-openjdk-universal-base-images-now-in-red-hat-enterprise-linux-8-2/#more-734777",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Debugging GraalVM-native images using gdb",
            "date": "6:25:2020",
            "abstract": "The GraalVM project includes, amongst other capabilities, a component called GraalVM Native Image. GraalVM Native Image supports the delivery of Java applications as shrink-wrapped, self-contained, standalone executables, commonly referred to as Java-native images. Native images often have a smaller footprint and faster startup time compared to running the same application in the traditional way on the JVM. This is often a win for short-running applications or small, container-based services. The trade-off is usually lower peak performance for long-running programs, and higher garbage collection overheads and latencies for programs with large amounts of resident data.",
            "link": "https://developers.redhat.com/blog/2020/06/25/debugging-graalvm-native-images-using-gdb/#more-723337",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Red Hat Enterprise Linux 8.2 brings faster Python 3.8 run speeds",
            "date": "6:25:2020",
            "abstract": "The Python interpreter shipped with Red Hat Enterprise Linux (RHEL) 8 is version 3.6, which was released in 2016. While Red Hat is committed to supporting the Python 3.6 interpreter for the lifetime of Red Hat Enterprise Linux 8, it is becoming a bit old for some use cases.",
            "link": "https://developers.redhat.com/blog/2020/06/25/red-hat-enterprise-linux-8-2-brings-faster-python-3-8-run-speeds/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2019/10/python-logo.png"
        },
        {
            "title": "What enterprise developers need to know about security and compliance",
            "date": "6:23:2020",
            "abstract": "One of the luxuries of my job is that I get to speak to and work with a range of IT people employed by U.S. federal and state government agencies. That range includes DevOps engineers, developers, sysadmins, database administrators, and security professionals. Everyone I talk to, even security professionals, says that IT security and compliance can be imprecise, subjective, overwhelming, and variable—especially in the federal government.",
            "link": "https://developers.redhat.com/blog/2020/06/23/what-enterprise-developers-need-to-know-about-security-and-compliance/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "A development roadmap for Open Data Hub",
            "date": "6:22:2020",
            "abstract": "Open Data Hub (ODH) is a blueprint for building an AI-as-a-Service (AIaaS) platform on Red Hat’s Kubernetes-based OpenShift 4.x. The Open Data Hub team recently released Open Data Hub 0.6.0, followed up by a smaller update of Open Data Hub 0.6.1.",
            "link": "https://developers.redhat.com/blog/2020/06/22/a-development-roadmap-for-open-data-hub/#more-730837",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/05/datahub_color_vert-gry-bg.png"
        },
        {
            "title": "Develop and test a Quarkus client on Red Hat CodeReady Containers with Red Hat Data Grid 8.0",
            "date": "6:19:2020",
            "abstract": "This article is about my experience installing Red Hat Data Grid (RHDG) on Red Hat CodeReady Containers (CRC) so that I could set up a local environment to develop and test a Quarkus Infinispan client. I started by installing CodeReady Containers and then installed Red Hat Data Grid. I am also on a learning path for Quarkus, so my last step was to integrate the Quarkus Infinispan client into my new development environment.",
            "link": "https://developers.redhat.com/blog/2020/06/19/develop-and-test-a-quarkus-client-on-red-hat-codeready-containers-with-red-hat-data-grid-8-0/#more-730637",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/producticons_1017_RGB_DataGrid_color-.png"
        },
        {
            "title": "Camel K 1.0: The serverless integration platform goes GA",
            "date": "6:18:2020",
            "abstract": "After many months of waiting, Apache Camel K 1.0 is finally here! This groundbreaking project introduces developers to cloud-native application development and automated cloud configurations without breaking a sweat. With the 1.0 general availability (GA) release, Apache Camel K is more stable than ever, with performance improvements that developers will appreciate.",
            "link": "https://developers.redhat.com/blog/2020/06/18/camel-k-1-0-the-serverless-integration-platform-goes-ga/#more-731777",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "IoT Developer Survey takes a turn to edge computing: Deadline June 26 2020",
            "date": "6:18:2020",
            "abstract": "The Eclipse IoT Working Group has launched the annual IoT Developer Survey. This survey is in its sixth edition and is the largest developer survey in the Internet-of-Things (IoT) open source industry. The deadline to submit your responses is June 26, 2020.",
            "link": "https://developers.redhat.com/blog/2020/06/18/iot-developer-survey-takes-a-turn-to-edge-computing-deadline-june-26-2020/#more-730137",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/new_iot_logo_clr.png"
        },
        {
            "title": "Red Hat Runtimes brings Vert.x and Dekorate to Spring Boot 2.2.6",
            "date": "6:17:2020",
            "abstract": "The latest update to Red Hat Runtimes features support for Spring Boot 2.2.6, along with the Dekorate project and Spring Reactive. Together, these technologies are a boost for developers building Spring-based applications on the Red Hat OpenShift Container Platform. In this article, I present the highlights of this update.",
            "link": "https://developers.redhat.com/blog/2020/06/17/red-hat-runtimes-brings-vert-x-and-dekorate-to-spring-boot-2-2-6/#more-701247",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/vertx_logo_rgb.png"
        },
        {
            "title": "Red Hat JBoss Enterprise Application Platform expansion pack 1.0 released",
            "date": "6:17:2020",
            "abstract": "Red Hat recently released the first Red Hat JBoss Enterprise Application Platform expansion pack (JBoss EAP XP) version 1.0. This version enables JBoss EAP developers to build Java microservices using Eclipse MicroProfile 3.3 APIs while continuing to also support Jakarta EE 8. This article goes into detail on the nature of this new offering and an easy way to get started.",
            "link": "https://developers.redhat.com/blog/2020/06/17/red-hat-jboss-enterprise-application-platform-expansion-pack-1-0-released/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/Logo-Red_Hat-JBoss_Enterprise_Application_Platform-B-Standard-RGB.png"
        },
        {
            "title": "Support for GraphQL with Open Liberty 20.0.0.6",
            "date": "6:17:2020",
            "abstract": "The Open Liberty 20.0.0.6 release brings new features, updates, and bug fixes. This article introduces the new features in Open Liberty 20.0.0.6, including support for developing “code-first” GraphQL applications, provisioning features from a Maven repository, and using a server configuration to control application startup.",
            "link": "https://developers.redhat.com/blog/2020/06/17/support-for-graphql-with-open-liberty-20-0-0-6/#more-729187",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/OpenLiberty-OL_logomark_400.png"
        },
        {
            "title": "Enable Eclipse MicroProfile applications on Red Hat JBoss Enterprise Application Platform 7.3",
            "date": "6:16:2020",
            "abstract": "In this article, we show you how to install Red Hat JBoss Enterprise Application Platform (JBoss EAP) XP 1.0.0.GA and enable Eclipse MicroProfile support on JBoss EAP. Once you have MicroProfile support enabled, you can start using the quickstart examples or start developing your own application.",
            "link": "https://developers.redhat.com/blog/2020/06/16/enable-eclipse-microprofile-applications-on-red-hat-jboss-enterprise-application-platform-7-3/#more-722437",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/05/import_quickstarts.png"
        },
        {
            "title": "Enterprise Kubernetes development with odo: The CLI tool for developers",
            "date": "6:16:2020",
            "abstract": "Kubernetes conversations rarely center the developer’s perspective. As a result, doing our job in a k8s cluster often requires building complicated YAML resource files, writing custom shell scripts, and understanding the countless options that are available in kubectl and docker commands. On top of all of that, we have the learning curve of understanding Kubernetes terminology and using it the way that operations teams do.",
            "link": "https://developers.redhat.com/blog/2020/06/16/enterprise-kubernetes-development-with-odo-the-cli-tool-for-developers/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/05/To-Staging.png"
        },
        {
            "title": "Jakarta EE: Multitenancy with JPA on WildFly, Part 1",
            "date": "6:15:2020",
            "abstract": "In this two-part series, I demonstrate two approaches to multitenancy with the Jakarta Persistence API (JPA) running on WildFly. In the first half of this series, you will learn how to implement multitenancy using a database. In the second half, I will introduce you to multitenancy using a schema. I based both examples on JPA and Hibernate.",
            "link": "https://developers.redhat.com/blog/2020/06/15/jakarta-ee-multitenancy-with-jpa-on-wildfly-part-1/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/2020_Wildfly_JakartaEE_JPA_featured_Article_image_Part1.png"
        },
        {
            "title": "Tracking COVID-19 using Quarkus, AMQ Streams, and Camel K on OpenShift",
            "date": "6:15:2020",
            "abstract": "In just a matter of weeks, the world that we knew changed forever. The COVID-19 pandemic came swiftly and caused massive disruption to our healthcare systems and local businesses, throwing the world’s economies into chaos. The coronavirus quickly became a crisis that affected everyone. As researchers and scientists rushed to make sense of it, and find ways to eliminate or slow the rate of infection, countries started gathering statistics such as the number of confirmed cases, reported deaths, and so on. Johns Hopkins University researchers have since aggregated the statistics from many countries and made them available.",
            "link": "https://developers.redhat.com/blog/2020/06/15/tracking-covid-19-using-quarkus-amq-streams-and-camel-k-on-openshift/#more-729337",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/Website.png"
        },
        {
            "title": "Supersonic, Subatomic Java Hackathon: June 15 – July 22 2020",
            "date": "6:15:2020",
            "abstract": "The Quarkus community is excited to announce the Supersonic, Subatomic Java Hackathon for developers to create Kubernetes-native applications for a chance to win $30,000 in prizes. This hackathon is a great opportunity to learn about the future of cloud-native Java development and showcase your coding skills.",
            "link": "https://developers.redhat.com/blog/2020/06/15/supersonic-subatomic-java-hackathon-june-15-july-22-2020/#more-732287",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/quarkushackathon_1170x156_headertitle_mockup.png"
        },
        {
            "title": "Event streaming and data federation: A citizen integrator’s story",
            "date": "6:12:2020",
            "abstract": "Businesses are seeking to benefit from every customer interaction with real-time personalized experience. Targeting each customer with relevant offers can greatly improve customer loyalty, but we must first understand the customer. We have to be able to draw on data and other resources from diverse systems, such as marketing, customer service, fraud, and business operations. With the advent of modern technologies and agile methodologies, we also want to be able to empower citizen integrators (typically business users who understand business and client needs) to create custom software. What we need is one single functional domain where the information is harmonized in a homogeneous way. ",
            "link": "https://developers.redhat.com/blog/2020/06/12/event-streaming-and-data-federation-a-citizen-integrators-story/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2019/08/sadhana_profile-1-150x150.png"
        },
        {
            "title": "How to install CodeReady Workspaces in a restricted OpenShift 4 environment",
            "date": "6:12:2020",
            "abstract": "It’s your first day as a Java programmer, right out of college. You have received your badge, a shiny new laptop, and all of your software requests have been approved. Everything seems to be going well.",
            "link": "https://developers.redhat.com/blog/2020/06/12/how-to-install-codeready-workspaces-in-a-restricted-openshift-4-environment/#more-657467",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/5396174-3-150x150.png"
        },
        {
            "title": "First look at the new Apicurio Registry UI and Operator",
            "date": "6:11:2020",
            "abstract": "Last year, the Apicurio developer community launched the new Apicurio Registry project, which is an API and schema registry for microservices. You can use the Apicurio Registry to store and retrieve service artifacts such as OpenAPI specifications and AsyncAPI definitions, as well as schemas such as Apache Avro, JSON, and Google Protocol Buffers.",
            "link": "https://developers.redhat.com/blog/2020/06/11/first-look-at-the-new-apicurio-registry-ui-and-operator/#more-727447",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Extending Red Hat SSO with IBM Security Verify",
            "date": "6:11:2020",
            "abstract": "More and more organizations are using Red Hat Single Sign-On (Red Hat SSO) as the foundation for securing user identities for enterprise and consumer applications. The focus on providing both robust security and a seamless user experience needs to be equally considered. Neither of these requirements should be compromised, especially as applications are being built for a multi-cloud world on Red Hat OpenShift.",
            "link": "https://developers.redhat.com/blog/2020/06/11/extending-red-hat-sso-with-ibm-security-verify/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/ExtendingRHSSOwithIBMSecurityVerify.png"
        },
        {
            "title": "AI vs COVID-19: How Java helps nurses and doctors in this fight",
            "date": "6:9:2020",
            "abstract": "DevNation Tech Talks are hosted by the Red Hat technologists who create our products. These sessions include real solutions plus code and sample projects to help you get started. In this talk, you’ll learn how OptaPlanner has helped keep medical staff and patients safer with advanced planning algorithms, from Geoffrey De Smet and Edson Yanaga.",
            "link": "https://developers.redhat.com/blog/2020/06/09/ai-vs-covid-19-how-java-helps-nurses-and-doctors-in-this-fight/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/optaplanner-1.png"
        },
        {
            "title": "Commit to excellence: Java in containers",
            "date": "6:8:2020",
            "abstract": "DevNation Tech Talks are hosted by the Red Hat technologists who create our products. These sessions include real solutions plus code and sample projects to help you get started. In this talk, you’ll learn about using Java with containers from Markus Eisele and Burr Sutter.",
            "link": "https://developers.redhat.com/blog/2020/06/08/commit-to-excellence-java-in-containers/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/Java-container-build-process.png"
        },
        {
            "title": "Adding keystores and truststores to microservices in Red Hat OpenShift",
            "date": "6:5:2020",
            "abstract": "You might not need Secure Socket Layer (SSL)-based communication between microservices in the same cluster, but it’s often a requirement if you want to connect to a remote web service or message broker. In cases where you will expose a web service or other endpoints, you might also have to use a custom keystore in a microservice deployed on Red Hat OpenShift, so that external clients only connect with a specific truststore.",
            "link": "https://developers.redhat.com/blog/2020/06/05/adding-keystores-and-truststores-to-microservices-in-red-hat-openshift/#more-717767",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/05/Screenshot-from-2020-05-07-20-51-19.png"
        },
        {
            "title": "Mandrel: A community distribution of GraalVM for the Red Hat build of Quarkus",
            "date": "6:5:2020",
            "abstract": "The Java community has demonstrated time and time again its ability to evolve, improve, and adapt to meet the needs of its developers and users. Even after 25 years of language and framework choices, Java has consistently ranked in the top languages in use today due to its strong track record and capabilities in enterprise use cases. Red Hat has long been a strong leader in Java and open source software development and remains committed to being at the forefront of Java as it continues to evolve.",
            "link": "https://developers.redhat.com/blog/2020/06/05/mandrel-a-community-distribution-of-graalvm-for-the-red-hat-build-of-quarkus/#more-727707",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/quarkus_logo_vertical_rgb_1280px_default.png"
        },
        {
            "title": "The road to Quarkus GA: Completing the first supported Kubernetes-native Java stack",
            "date": "6:4:2020",
            "abstract": "I’ve had many proud moments in my role here at Red Hat over the years. Examples include when we released the first version of WildFly, when we acquired the Camel team, when we worked with other vendors to create Eclipse MicroProfile, the great work the Strimzi team did to get into the Cloud Native Computing Foundation, our entire Red Hat Managed Integration effort, Kogito, and the list goes on. I feel like I add to this list of examples on an almost weekly basis.",
            "link": "https://developers.redhat.com/blog/2020/06/04/the-road-to-quarkus-ga-completing-the-first-supported-kubernetes-native-java-stack/#more-727437",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/quarkus_logo_vertical_rgb_1280px_default.png"
        },
        {
            "title": "An easier way to create custom Jenkins containers",
            "date": "6:4:2020",
            "abstract": "In many organizations, it is a struggle for developers to get custom Jenkins container images created. Fortunately, in engineering, there is often more than one way to get the job done. In this article, I show you how to create your own custom Jenkins container image by aggregating readily available containers in a pod template.",
            "link": "https://developers.redhat.com/blog/2020/06/04/an-easier-way-to-create-custom-jenkins-containers/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/JenkinsPipeline.png"
        },
        {
            "title": "The joys and perils of aliasing in C and C++, Part 2",
            "date": "6:3:2020",
            "abstract": "In the previous article, I discussed the benefits of C and C++ language restrictions in optimized code. In this second half, I present a variety of programming language exemptions and compiler extensions that developers can use to get around aliasing restrictions more or less safely. I will also discuss the common pitfalls of aliasing, both resulting from the extensions as well as from misuses of standard language constructs, and illustrate common problems these pitfalls might cause.",
            "link": "https://developers.redhat.com/blog/2020/06/03/the-joys-and-perils-of-aliasing-in-c-and-c-part-2/#more-722377",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/C_C_featuredimage.png"
        },
        {
            "title": "Open Data Hub 0.6.1: Bug fix release to smooth out redesign regressions",
            "date": "6:2:2020",
            "abstract": "It is just a few short weeks since we released Open Data Hub (ODH) 0.6.0, bringing many changes to the underlying architecture and some new features. We found a few issues in this new version with the Kubeflow Operator and a few regressions that came in with the new JupyterHub updates. To make sure your experience with ODH 0.6 does not suffer because we wanted to release early, we offer a new (mostly) bugfix release: Open Data Hub 0.6.1.",
            "link": "https://developers.redhat.com/blog/2020/06/02/open-data-hub-0-6-1-bug-fix-release-to-smooth-out-redesign-regressions/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/odh_logo1.png"
        },
        {
            "title": "The joys and perils of C and C++ aliasing, Part 1",
            "date": "6:2:2020",
            "abstract": "In C, C++, and some other programming languages, the term aliasing refers to a situation where two different expressions or symbols refer to the same object. When references access that object in different ways—as both reads and stores—there are consequences for the order in which these mixed accesses can happen. The value that is stored first is expected to be read by the subsequent access. In many instances, aliasing is harmless: It is common, safe, and usually optimally efficient to use two pointers of the same type to read, and even to write to the same object. But in some cases, using aliasing symbols for mixed accesses is less benign, and can adversely affect the correctness or efficiency of your code.",
            "link": "https://developers.redhat.com/blog/2020/06/02/the-joys-and-perils-of-c-and-c-aliasing-part-1/#more-707487",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/06/C_C_featuredimage.png"
        },
        {
            "title": "How the fabric8 Maven plug-in deploys Java applications to OpenShift",
            "date": "6:2:2020",
            "abstract": "The fabric8 Maven plug-in, often abbreviated FMP, can be added to a Maven Java project and takes care of the administrative tasks involved in deploying the application to a Red Hat OpenShift cluster. These tasks include:",
            "link": "https://developers.redhat.com/blog/2020/06/02/how-the-fabric8-maven-plug-in-deploys-java-applications-to-openshift/#more-718217",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/6074349.png"
        },
        {
            "title": "Red Hat Software Collections 3.5 brings updates for Red Hat Enterprise Linux 7",
            "date": "5:29:2020",
            "abstract": "Red Hat Software Collections 3.5 and Red Hat Developer Toolset 9.1 are now available for Red Hat Enterprise Linux 7. Here’s what that means for developers.",
            "link": "https://developers.redhat.com/blog/2020/05/29/red-hat-software-collections-3-5-brings-updates-for-red-hat-enterprise-linux-7/#more-725967",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/05/Logo-Red_Hat-Enterprise_Linux-A-Standard-RGB.png"
        },
        {
            "title": "Debugging vHost user TX contention in Open vSwitch",
            "date": "5:29:2020",
            "abstract": "It isn’t always easy to understand how Open vSwitch (OVS) cycles are spent, especially because various parameters and configuration options can affect how OVS behaves. Members of the Open vSwitch community are actively working to understand what causes packets drops in Open vSwitch. Efforts so far have included adding a custom statistic for vHost TX retries, tracking vHost TX contention, and adding a coverage counter to count vHost IRQs. We are particularly interested in the user space datapath that uses the Data Plane Development Kit (DPDK) for fast I/O.",
            "link": "https://developers.redhat.com/blog/2020/05/29/debugging-vhost-user-tx-contention-in-open-vswitch/#more-707617",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/05/vswitch.png"
        },
        {
            "title": "Quarkus, a Kubernetes-native Java runtime, now fully supported by Red Hat",
            "date": "5:28:2020",
            "abstract": "Java was introduced 25 years ago, and to this day, remains one of the most popular programming languages among developers. However, Java has developed a reputation for not being a good fit for cloud-native applications. Developers look for (and often choose) alternative frameworks such as Go and Node.js to support their cloud-native development requirements.",
            "link": "https://developers.redhat.com/blog/2020/05/28/quarkus-a-kubernetes-native-java-runtime-now-fully-supported-by-red-hat/#more-725657",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/05/quarkus_banner_3.png"
        },
        {
            "title": "Build a Go application using OpenShift Pipelines",
            "date": "5:26:2020",
            "abstract": "Go is an increasingly popular programming language, and frequently chosen for developing command-line utilities. Many tools used with Kubernetes and Red Hat OpenShift are written in Go, including the command-line interfaces (CLIs) for Tekton (tkn), OpenShift (oc), and Kubernetes (kubectl). Also, developers can compile Go to a single executable for a broad range of operating systems. As a result, it’s easy to develop and desk-test applications before putting them into containers and running those containers in OpenShift.",
            "link": "https://developers.redhat.com/blog/2020/05/26/build-a-go-application-using-openshift-pipelines/#more-700937",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Red Hat build of Eclipse Vert.x 3.9 brings Fluent API Query",
            "date": "5:25:2020",
            "abstract": "Red Hat Runtimes provides a set of comprehensive frameworks, runtimes, and programming languages for developers, architects, and IT leaders with cloud-native application development needs. The latest update to Red Hat Runtimes has arrived with Red Hat’s build of Eclipse Vert.x version 3.9. Red Hat Runtimes provides application developers with a variety of application runtimes and lets them run on the Red Hat OpenShift Container Platform.",
            "link": "https://developers.redhat.com/blog/2020/05/25/red-hat-build-of-eclipse-vert-x-3-9-brings-fluent-api-query/#more-723687",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2018/01/eclipse-vertx-logo.png"
        },
        {
            "title": "Stack clash mitigation in GCC, Part 3",
            "date": "5:22:2020",
            "abstract": "In previous posts, Stack Clash Mitigation in GCC — Background and Stack Clash mitigation in GCC: Why -fstack-check is not the answer, I hopefully showed the basics of how stack clash attacks are structured and why GCC’s existing -fstack-check mechanism is insufficient for protection.",
            "link": "https://developers.redhat.com/blog/2020/05/22/stack-clash-mitigation-in-gcc-part-3/#more-583897",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Use Node.js 14 on Red Hat OpenShift",
            "date": "5:21:2020",
            "abstract": "On April 21st, Node.js released its latest major version with Node.js 14. Because this is an even-numbered release, it will become a Long Term Support (LTS) release in October 2020. This release brings a host of improvements and features, such as improved diagnostics, a V8 upgrade, an experimental Async Local Storage API, hardened the streams APIs, and more.",
            "link": "https://developers.redhat.com/blog/2020/05/21/use-node-js-14-on-red-hat-openshift/#more-719127",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/05/nodejs-new-pantone-black.png"
        },
        {
            "title": "Cloud-native computing terms all in one place",
            "date": "5:21:2020",
            "abstract": "What does eventual consistency even mean? Or, how about a dark launch? What is gRPC? Or a database saga? Wouldn’t it be great if someone gathered all the terms associated with cloud-native computing and put them in one place, where developers could find, link to, and even update them?",
            "link": "https://developers.redhat.com/blog/2020/05/21/cloud-native-computing-terms-all-in-one-place/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Getting started with the fabric8 Kubernetes Java client",
            "date": "5:20:2020",
            "abstract": "Fabric8 has been available as a Java client for Kubernetes since 2015, and today is one of the most popular client libraries for Kubernetes. (The most popular is client-go, which is the client library for the Go programming language on Kubernetes.) In recent years, fabric8 has evolved from a Java client for the Kubernetes REST API to a full-fledged alternative to the kubectl command-line tool for Java-based development.",
            "link": "https://developers.redhat.com/blog/2020/05/20/getting-started-with-the-fabric8-kubernetes-java-client/#more-711637",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/6074349.png"
        },
        {
            "title": "Extending Kafka connectivity with Apache Camel Kafka connectors",
            "date": "5:19:2020",
            "abstract": "Apache Kafka is one of the most used pieces of software in modern application development because of its distributed nature, high throughput, and horizontal scalability. Every day more and more organizations are adopting Kafka as the central event bus for their event-driven architecture. As a result, more and more data flows through the cluster, making the connectivity requirements rise in priority for any backlog. For this reason, the Apache Camel community released the first iteration of Kafka Connect connectors for the purpose of easing the burden on development teams. ",
            "link": "https://developers.redhat.com/blog/2020/05/19/extending-kafka-connectivity-with-apache-camel-kafka-connectors/#more-718137",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/05/camel_franz_kafka_2.png"
        },
        {
            "title": "Deploy and bind enterprise-grade microservices with Kubernetes Operators",
            "date": "5:18:2020",
            "abstract": "Deploying enterprise-grade runtime components into Kubernetes can be daunting. You might wonder:",
            "link": "https://developers.redhat.com/blog/2020/05/18/deploy-and-bind-enterprise-grade-microservices-with-kubernetes-operators/#more-678087",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/Screen-Shot-2020-04-22-at-7.27.21-AM.png"
        },
        {
            "title": "Change data capture for microservices without writing any code",
            "date": "5:15:2020",
            "abstract": "Want to smoothly modernize your legacy and monolithic applications to microservices or cloud-native without writing any code? Through this demonstration, we show you how to achieve the following change data capture scenario between two microservices on Red Hat OpenShift using the combination of Syndesis, Strimzi, and Debezium.",
            "link": "https://developers.redhat.com/blog/2020/05/15/change-data-capture-for-microservices-without-writing-any-code/#more-710937",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/CDC-Fuse-1024x499.png"
        },
        {
            "title": "Play with Kogito examples",
            "date": "5:14:2020",
            "abstract": "Kogito 0.9.1 has been released, bringing refined business automation documentation and examples. It’s not yet 1.0, but 0.9.1 is a well-prepared milestone release. In this article, I introduce kogito-examples to help you experience what Kogito is like. First, clone the repo:",
            "link": "https://developers.redhat.com/blog/2020/05/14/play-with-kogito-examples/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2019/08/kogito_icon_rgb_color_default_512px.png"
        },
        {
            "title": "Open Liberty 20.0.0.5 brings updates to EJB persistent timers coordination and failover across members",
            "date": "5:13:2020",
            "abstract": "In Open Liberty 20.0.0.5, you can now configure failover for Enterprise JavaBeans (EJB) persistent timers, load Java Authentication and Authorization Service (JAAS) classes directly from the resource adapter, format your logs to JSON or dev, and specify which JSON fields to leave out of your logs. In this article, we will discuss each of these features and how to implement them.",
            "link": "https://developers.redhat.com/blog/2020/05/13/open-liberty-20-0-0-5-brings-updates-to-ejb-persistent-timers-coordination-and-failover-across-members/#more-719107",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/OpenLiberty-OL_logomark_400.png"
        },
        {
            "title": "Six reasons to love Camel K",
            "date": "5:12:2020",
            "abstract": "Apache Camel K is a lightweight cloud-integration platform that runs natively on Kubernetes and, in particular, lets you automate your cloud configurations. Based on the famous Apache Camel, Camel K is designed and optimized for serverless and microservices architectures. In this article, I discuss six ways that Camel K transforms how developers work with Kubernetes, Red Hat OpenShift, and Knative on cloud platforms.",
            "link": "https://developers.redhat.com/blog/2020/05/12/six-reasons-to-love-camel-k/#more-709837",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/05/camel-k-coverimage.png"
        },
        {
            "title": "Top 10 must-know Kubernetes design patterns",
            "date": "5:11:2020",
            "abstract": "Here are the must-know top 10 design patterns for beginners synthesized from the Kubernetes Patterns book. Getting familiar with these patterns will help you understand foundational Kubernetes concepts, which in turn will help you in discussions and when designing Kubernetes-based applications.",
            "link": "https://developers.redhat.com/blog/2020/05/11/top-10-must-know-kubernetes-design-patterns/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/top_10_kubernetes_patterns.png"
        },
        {
            "title": "Change data capture with Debezium: A simple how-to, Part 1",
            "date": "5:8:2020",
            "abstract": "One question always comes up as organizations moving towards being cloud-native, twelve-factor, and stateless: How do you get an organization’s data to these new applications? There are many different patterns out there, but one pattern we will look at today is change data capture. This post is a simple how-to on how to build out a change data capture solution using Debezium within an OpenShift environment. Future posts will also add to this and add additional capabilities.",
            "link": "https://developers.redhat.com/blog/2020/05/08/change-data-capture-with-debezium-a-simple-how-to-part-1/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/kafka-connect-available.png"
        },
        {
            "title": "Open Data Hub 0.6 brings component updates and Kubeflow architecture",
            "date": "5:7:2020",
            "abstract": "Open Data Hub (ODH) is a blueprint for building an AI-as-a-service platform on Red Hat’s Kubernetes-based OpenShift 4.x. Version 0.6 of Open Data Hub comes with significant changes to the overall architecture as well as component updates and additions. In this article, we explore these changes.",
            "link": "https://developers.redhat.com/blog/2020/05/07/open-data-hub-0-6-brings-component-updates-and-kubeflow-architecture/#more-717267",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/05/Screenshot-from-2020-05-04-13-54-11.png"
        },
        {
            "title": "Using Ansible to automate Google Cloud Platform",
            "date": "5:6:2020",
            "abstract": "In this article, you will learn how to seamlessly automate the provisioning of Google Cloud Platform (GCP) resources using the new Red Hat Ansible modules and your Red Hat Ansible Tower credentials.",
            "link": "https://developers.redhat.com/blog/2020/05/06/using-ansible-to-automate-google-cloud-platform/#more-696317",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/verify_gcp_instance.png"
        },
        {
            "title": "Working with big spatial data workflows (or, what would John Snow do?)",
            "date": "5:5:2020",
            "abstract": "With the rise of social networks and people having more free time due to isolation, it has become popular to see lots of maps and graphs. These are made using big spatial data to explain how COVID-19 is expanding, why it is faster in some countries, and how we can stop it.",
            "link": "https://developers.redhat.com/blog/2020/05/05/working-with-big-spatial-data-workflows-or-what-would-john-snow-do/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/Syndesis1.png"
        },
        {
            "title": "Monitor business metrics with Red Hat Process Automation Manager, Elasticsearch, and Kibana",
            "date": "5:4:2020",
            "abstract": "Red Hat Process Automation Manager is a platform for developing containerized microservices and applications that automate business decisions and processes. Combining process- and task-level SLA metrics plus case-related breakdowns can be beneficial for identifying trends and reorganizing the workforce as necessary. So, a critical piece of a business process system is having real-time insights into what is happening, and both monitoring KPI metrics and responding to problem trends is an integral part of operations.",
            "link": "https://developers.redhat.com/blog/2020/05/04/monitor-business-metrics-with-red-hat-process-automation-manager-elasticsearch-and-kibana/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/monitoring-graphic.png"
        },
        {
            "title": "Automated API testing for the KIE Server",
            "date": "5:1:2020",
            "abstract": "In software development, much has been said about testing and there are many ways to think about it. In the context of agility and DevOps, automated testing is considered a foundation for the principles of flow and fast feedback. Considering the implementation of jBPM and Drools within a software delivery project, it becomes natural to think about how to support reliable automated testing for both stages of development and continuous integration.",
            "link": "https://developers.redhat.com/blog/2020/05/01/automated-api-testing-for-the-kie-server/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/KIE-Server-Postman-Testing.png"
        },
        {
            "title": "Application deployment improvements in OpenShift 4.4",
            "date": "4:30:2020",
            "abstract": "The most recent release of Red Hat OpenShift Container Platform provides enhancements and features that make application development even easier. These enhancements include:",
            "link": "https://developers.redhat.com/blog/2020/04/30/application-deployment-improvements-in-openshift-4-4/#more-712987",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Serverless applications made faster and simpler with OpenShift Serverless GA",
            "date": "4:30:2020",
            "abstract": "Red Hat OpenShift Serverless delivers Kubernetes-native, event-driven primitives for microservices, containers, and compatible Function-as-a-Service (FaaS) implementations. OpenShft Serverless provides out-of-the-box traffic routing and security capabilities. This offering combines Red Hat Operators, Knative, and Red Hat OpenShift. Combined, these tools allow stateless and serverless workloads to run across OpenShift deployments on private, public, hybrid, or multi-cloud environments with automated operations.",
            "link": "https://developers.redhat.com/blog/2020/04/30/serverless-applications-made-faster-and-simpler-with-openshift-serverless-ga/#more-713047",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/09-revSlideOut.png"
        },
        {
            "title": "OpenShift 4.4: Finding components in the Topology view",
            "date": "4:30:2020",
            "abstract": "Since its introduction, the Topology view in the Red Hat OpenShift web console’s Developer perspective has come a long way in creatively empowering developers. It helps them break away from the limitations of text prompts, and opens a whole new world of visual-interaction-led operations. But the Topology view is not even halfway through the process in its pursuit of bringing an excellent development experience to the table.",
            "link": "https://developers.redhat.com/blog/2020/04/30/openshift-4-4-finding-components-in-the-topology-view/#more-712957",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "OpenShift 4.4: Getting insights into your application",
            "date": "4:30:2020",
            "abstract": "The developer experience in Red Hat OpenShift Container Platform 4.4’s web console now includes a metrics-based dashboard. With this dashboard, you can access insights into your application metrics instead of relying on external tools. This Tech Preview feature is available in the Developer perspective’s Monitoring section, providing access to the dashboard, metrics, and events. Monitoring information is also available on the resource side panel, accessible within the Topology and Workloads views.",
            "link": "https://developers.redhat.com/blog/2020/04/30/openshift-4-4-getting-insights-into-your-application/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/F05-Monitoring.png"
        },
        {
            "title": "Creating Pipelines with OpenShift 4.4’s new Pipeline Builder and Tekton Pipelines",
            "date": "4:30:2020",
            "abstract": "Tekton was originally part of the Knative project but eventually became a project of its own. It’s been around for just over a year now and is becoming the de facto standard to build continuous delivery pipelines in a Kubernetes-native fashion.",
            "link": "https://developers.redhat.com/blog/2020/04/30/creating-pipelines-with-openshift-4-4s-new-pipeline-builder-and-tekton-pipelines/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/F1-PipelinesArchitecture.png"
        },
        {
            "title": "What’s new in the OpenShift 4.4 web console developer experience",
            "date": "4:30:2020",
            "abstract": "The developer experience in the Red Hat OpenShift Container Platform web console keeps getting better. You’ve probably already heard about our streamlined user flows to build and deploy applications, plus the ability to understand the structure of your application via the Topology view. Each new release of Red Hat OpenShift includes usability improvements and new features to help developers reach their goals.",
            "link": "https://developers.redhat.com/blog/2020/04/30/whats-new-in-the-openshift-4-4-web-console-developer-experience/#more-713067",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Alertmanager Watchdog monitoring with Nagios passive checks",
            "date": "4:29:2020",
            "abstract": "After installing a fresh Red Hat OpenShift cluster, go to Monitoring -> Alerting. There, you will find a Watchdog alert, which sends messages to let you know that Alertmanager is not only still running, but is also emitting other signals for alerts you might be interested in. You can hook into Watchdog alerts with an external monitoring system, which in turn can tell you that alerting in your OpenShift cluster is working.",
            "link": "https://developers.redhat.com/blog/2020/04/29/alertmanager-watchdog-monitoring-with-nagios-passive-checks/#more-701787",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/Logo-Red_Hat-OpenShift-A-Standard-RGB.png"
        },
        {
            "title": "Consuming messages from closest replicas in Apache Kafka 2.4.0 and AMQ Streams",
            "date": "4:29:2020",
            "abstract": "Thanks to changes in Apache Kafka 2.4.0, consumers are no longer required to connect to a leader replica to consume messages. In this article, I introduce you to Apache Kafka’s new ReplicaSelector interface and its customizable RackAwareReplicaSelector. I’ll briefly explain the benefits of the new rack-aware selector, then show you how to use it to more efficiently balance load across Amazon Web Services (AWS) availability zones.",
            "link": "https://developers.redhat.com/blog/2020/04/29/consuming-messages-from-closest-replicas-in-apache-kafka-2-4-0-and-amq-streams/#more-699727",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/KIP-392-in-AWS.png"
        },
        {
            "title": "Red Hat Process Automation 7.7 brings updates, fixes, and tech previews",
            "date": "4:29:2020",
            "abstract": "Red Hat Process Automation Manager (RHPAM) and Red Hat Decision Manager (RHDM) 7.7 bring features for the authoring of processes, rules, testing, execution, and cloud scenarios. Besides these new features, usability, and performance improvements, version 7.7 also brings more than 120 bug fixes. These updates are part of the Middleware Business Automation stack Red Hat released on March 18th.",
            "link": "https://developers.redhat.com/blog/2020/04/29/red-hat-process-automation-7-7-brings-updates-fixes-and-tech-previews/#more-697937",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Operator SDK: Build Kubernetes Operators and deploy them on OpenShift",
            "date": "4:28:2020",
            "abstract": "The Operator SDK makes it simple to build Kubernetes-native applications, providing the tools to build, test, and package Operators. The SDK also helps the developer to build Operators without requiring knowledge of Kubernetes API complexities.",
            "link": "https://developers.redhat.com/blog/2020/04/28/operator-sdk-build-kubernetes-operators-and-deploy-them-on-openshift/#more-700317",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Contract-first development: Create a mock back end for realistic data interactions with React",
            "date": "4:28:2020",
            "abstract": "Many front-end developers are discovering the benefits of contract-first development. With this approach, front- and back-end developers use OpenAPI to collaboratively design an API specification. Once the initial specification is done, front-end developers can use API definitions and sample data to develop discrete user interface (UI) components. Defining a single OpenAPI spec improves cross-team collaboration, and API definitions empower front-end developers to design our initial workflows without relying on the back end.",
            "link": "https://developers.redhat.com/blog/2020/04/28/contract-first-development-create-a-mock-back-end-for-realistic-data-interactions-with-react/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/React-logo.png"
        },
        {
            "title": "New features in Red Hat CodeReady Studio 12.15.0.GA and JBoss Tools 4.15.0.Final for Eclipse 2020-03",
            "date": "4:28:2020",
            "abstract": "JBoss Tools 4.15.0 and Red Hat CodeReady Studio 12.15 for Eclipse 4.15 (2020-03) are now available. For this release, we focused on improving Quarkus and container-based development and fixing bugs. We also updated the Hibernate Tools runtime provider and Java Developer Tools (JDT) extensions, which are now compatible with Java 14. Additionally, we made many UI changes to platform views, dialogs, and toolbars.",
            "link": "https://developers.redhat.com/blog/2020/04/28/new-features-in-red-hat-codeready-studio-12-15-0-ga-and-jboss-tools-4-15-0-final-for-eclipse-2020-03/#more-714377",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/img_5ea54a594cb93.png"
        },
        {
            "title": "Building Kubernetes applications on OpenShift with Red Hat Marketplace",
            "date": "4:27:2020",
            "abstract": "Developers are the epicenter for creating solutions, quickly, that enable enterprises to react to evolving ecosystems. At Red Hat, we have embraced rapid, communal evolution since our inception. We were founded on the open source principles that many of you have come to depend on: transparent, open, iterative collaboration that can change the world in a moment.",
            "link": "https://developers.redhat.com/blog/2020/04/27/building-kubernetes-applications-on-openshift-with-red-hat-marketplace/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/Marketplace-launch.png"
        },
        {
            "title": "Modern web applications on OpenShift, Part 4: Openshift Pipelines",
            "date": "4:27:2020",
            "abstract": "When I wrote part 3 of this series, Modern web applications on OpenShift: Part 3 — OpenShift as a development environment, I said that was the final part. However, there is new tech that fits in very nicely with deploying modern Web Applications to OpenShift, so part 4 is necessary. As a refresher, in the first article, we looked at how to deploy a modern web application using the fewest commands. In the second part, we took a deeper look into how the new source-to-image (S2I) web app builder works and how to use it as part of a chained build. In the third, we took a look at how to run your app’s “development workflow” on Red Hat OpenShift. This article talks about OpenShift Pipelines and how this tool can be used as an alternative to a chained build.",
            "link": "https://developers.redhat.com/blog/2020/04/27/modern-web-applications-on-openshift-part-4-openshift-pipelines/#more-685797",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/web-app-pipeline-web-console-4.png"
        },
        {
            "title": "Optimizing iptables-nft large ruleset performance in user space",
            "date": "4:27:2020",
            "abstract": "When examining Linux firewall performance, there is a second aspect to packet processing—namely, the cost of firewall setup manipulations. In a world of containers, distinct network nodes spawn quickly enough for firewall ruleset adjustment delay to become a significant factor. At the same time, rulesets tend to become huge given the number of containers even a moderately specced server might host.",
            "link": "https://developers.redhat.com/blog/2020/04/27/optimizing-iptables-nft-large-ruleset-performance-in-user-space/#more-689827",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/02/test1.3_initial.png"
        },
        {
            "title": "Integrating Kubeflow with Red Hat OpenShift Service Mesh",
            "date": "4:24:2020",
            "abstract": "Open Data Hub is an open source project providing an end-to-end artificial intelligence and machine learning (AI/ML) platform that runs on Red Hat OpenShift. As we explained in our previous article, we see real potential and value in the Kubeflow project, and we’ve enabled Kubeflow 0.7 on RedHat OpenShift 4.2. Kubeflow installs multiple AI/ML components and requires Istio to control and route service traffic.",
            "link": "https://developers.redhat.com/blog/2020/04/24/integrating-kubeflow-with-red-hat-openshift-service-mesh/#more-698717",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/odh_logo1.png"
        },
        {
            "title": "Ramp up on Quarkus: A Kubernetes-native Java framework",
            "date": "4:24:2020",
            "abstract": "Java has been in a bit of an awkward spot since containers took off a few years ago. In the world of Kubernetes, microservices, and serverless, it has been getting harder and harder to ignore that Java applications are, by today’s standards, bloated. Well, until now. In this article, I explore the basics of Quarkus, a Kubernetes-native Java framework built to specifically address Java’s bloatedness problem.",
            "link": "https://developers.redhat.com/blog/2020/04/24/ramp-up-on-quarkus-a-kubernetes-native-java-framework/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/Quarkus_Image.png"
        },
        {
            "title": "Build and deploy a serverless app with Camel K and Red Hat OpenShift Serverless 1.5.0 Tech Preview",
            "date": "4:24:2020",
            "abstract": "Red Hat OpenShift Serverless 1.5.0 (currently in tech preview) runs on Red Hat OpenShift Container Platform 4.3. It enables stateful, stateless, and serverless workloads to all operate on a single multi-cloud container platform. Apache Camel K is a lightweight integration platform that runs natively on Kubernetes. Camel K has serverless superpowers.",
            "link": "https://developers.redhat.com/blog/2020/04/24/build-and-deploy-a-serverless-app-with-camel-k-and-red-hat-openshift-serverless-1-5-0-tech-preview/#more-698357",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/blog1.png"
        },
        {
            "title": "MicroProfile 3.3 now available on Open Liberty 20.0.0.4, brings updated features, yum/apt-get support, pattern tracking",
            "date": "4:24:2020",
            "abstract": "Open Liberty 20.0.0.4 provides support for MicroProfile 3.3 which includes updates to MicroProfile Rest Client, Fault Tolerance, Metrics, Health, and Config. Improved developer experience is also achieved with support for yum/apt-get installs and the ability to track use patterns with JAX-RS 2.1.",
            "link": "https://developers.redhat.com/blog/2020/04/24/microprofile-3-3-now-available-on-open-liberty-20-0-0-4-brings-updated-features-yum-apt-get-support-pattern-tracking/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/OpenLiberty-OL_logomark_400.png"
        },
        {
            "title": "Report from the February 2020 ISO C++ meeting (Core Language Working Group)",
            "date": "4:23:2020",
            "abstract": "The first International Organization for Standardization (ISO) C++ meeting of 2020 happened in Prague, Czechia. It was our first time meeting in Prague, though I’ve been there a few times for the GNU Tools Cauldron. Two of us from Red Hat attended: Jonathan Wakely serves on the ISO C++ Standards Committee Library Working Group (LWG), and I am part of the Core Language Working Group (CWG). (You can see the ISO C++ committee structure here.)",
            "link": "https://developers.redhat.com/blog/2020/04/23/report-from-the-february-2020-iso-c-meeting-core-language-working-group/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Knative Cookbook: Building Effective Serverless Applications with Kubernetes and OpenShift",
            "date": "4:23:2020",
            "abstract": "Serverless architecture has recently taken center stage in cloud-native application deployment: Enterprises started to see the benefits that serverless applications bring to them, such as agility, rapid deployment, and resource cost optimization. As with any other new technology, there were multiple ways to approach and employ serverless technologies, such as Function-as-a-Service (FaaS) and Backend-as-a-Service (BaaS)—that is, running your applications as ephemeral containers—with the ability to scale up and down automatically.",
            "link": "https://developers.redhat.com/blog/2020/04/23/knative-cookbook-building-effective-serverless-applications-with-kubernetes-and-openshift/#more-709338",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/Knative_Cookbook_Cover.png"
        },
        {
            "title": "Getting started with JavaScript application development",
            "date": "4:22:2020",
            "abstract": "For many developers who have never built a JavaScript web application before, the first steps can be daunting. Our development team has the opportunity to interact with both students that are just getting started and developers with lengthy experience building out complex applications. Even seasoned back-end developers often ask where they can get started with JavaScript. Our response is invariably, “Don’t just read. You need to start building things, play with the language to see what it can do.”",
            "link": "https://developers.redhat.com/blog/2020/04/22/getting-started-with-javascript-application-development/#more-698117",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2018/03/nodejs-new-pantone-black.png"
        },
        {
            "title": "Red Hat CodeReady Workspaces 2.1: Improved cloud tools bring more languages, better flow",
            "date": "4:20:2020",
            "abstract": "We are pleased to announce the release of  Red Hat CodeReady Workspaces 2.1. Based on Eclipse Che, its upstream project, CodeReady Workspaces is a Red Hat OpenShift-native developer environment enabling developer teams for cloud-native development.",
            "link": "https://developers.redhat.com/blog/2020/04/20/red-hat-codeready-workspaces-2-1-improved-cloud-tools-bring-more-languages-better-flow/#more-704197",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/img_5e8c1278e54cf.png"
        },
        {
            "title": "Red Hat CodeReady Studio 12.14.0.GA and JBoss Tools 4.14.0.Final: Tool and UI updates",
            "date": "4:20:2020",
            "abstract": "In the previous article, I introduced JBoss Tools 4.14.0 final and Red Hat CodeReady Studio 12.14 for Eclipse 4.14 (2019-12), focusing on the big new features: OpenShift Application Explorer view, feedback loops, and new Quarkus tooling. This article focuses on the many smaller additions and updates. Here, I’ll quickly run through the new features and small changes that improve the development experience in Hibernate Tools and the Java Developer Tools (JDT) extensions, which were updated for Java 13. I’ll also highlight UI changes to platform views, dialogs, and toolbars.",
            "link": "https://developers.redhat.com/blog/2020/04/20/red-hat-codeready-studio-12-14-0-ga-and-jboss-tools-4-14-0-final-tool-and-ui-updates/#more-708678",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/img_5e6f36f9726f0.png"
        },
        {
            "title": "Red Hat CodeReady Studio 12.14.0.GA and JBoss Tools 4.14.0.Final: OpenShift and Quarkus updates",
            "date": "4:20:2020",
            "abstract": "JBoss Tools 4.14.0 and Red Hat CodeReady Studio 12.14 for Eclipse 4.14 (2019-12) are here and waiting for you. For this release, we focused on improving container-based development, adding tooling for the Quarkus framework, and fixing bugs. We also updated the Hibernate Tools runtime provider and Java Developer Tools (JDT) extensions, which are now compatible with Java 13. Additionally, we made many UI changes to platform views, dialogs, and toolbars.",
            "link": "https://developers.redhat.com/blog/2020/04/20/red-hat-codeready-studio-12-14-0-ga-and-jboss-tools-4-14-0-final-openshift-application-explorer-view-feedback-loops-new-quarkus-tooling/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/img_5e6f3215986c7.png"
        },
        {
            "title": "Linux cheat codes",
            "date": "4:17:2020",
            "abstract": "DevNation Live tech talks are hosted by the Red Hat technologists who create our products. These sessions include real solutions plus code and sample projects to help you get started. In this talk, you’ll learn Linux cheat codes from Maxim Burgerhout and Burr Sutter.",
            "link": "https://developers.redhat.com/blog/2020/04/17/linux-cheat-codes/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Crafting Kubernetes Operators",
            "date": "4:15:2020",
            "abstract": "DevNation Live tech talks are hosted by the Red Hat technologists who create our products. These sessions include real solutions plus code and sample projects to help you get started. In this talk, you’ll learn about crafting Kubernetes Operators from Josh Wood and Burr Sutter.",
            "link": "https://developers.redhat.com/blog/2020/04/15/crafting-kubernetes-operators/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Capture database changes with Debezium Apache Kafka connectors",
            "date": "4:14:2020",
            "abstract": "Change data capture, or CDC, is a well-established software design pattern for a system that monitors and captures the changes in data so that other software can respond to those changes. CDC captures row-level changes to database tables and passes corresponding change events to a data streaming bus. Applications can read these change event streams and access these change events in the order in which they occurred.",
            "link": "https://developers.redhat.com/blog/2020/04/14/capture-database-changes-with-debezium-apache-kafka-connectors/#more-704577",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/Debezium-Data-Replication.png"
        },
        {
            "title": "Running an event-driven health management business process through end user scenarios: Part 2",
            "date": "4:14:2020",
            "abstract": "If you read the first article in this series, then you already set up the example application you’ll need for this article. If you have not set up the population health management application, you should do that before continuing. In this article, we’ll run a few business processes through our event- and business-process-driven application to test it out.",
            "link": "https://developers.redhat.com/blog/2020/04/14/running-an-event-driven-health-management-business-process-through-end-user-scenarios-part-2/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/PHM-High-Level-Architecture.png"
        },
        {
            "title": "Red Hat Data Grid 8.0 brings new server architecture, improved REST API, and more",
            "date": "4:13:2020",
            "abstract": "Red Hat Data Grid helps applications access, process, and analyze data at in-memory speed. Red Hat Data Grid 8.0 is included in the latest update to Red Hat Runtimes, providing a distributed in-memory, NoSQL datastore. This release includes a new Operator for handling complex applications, a new server architecture that reduces memory consumption and increases security, a faster API with new features, a new CLI, and compatibility with a variety of observability tools.",
            "link": "https://developers.redhat.com/blog/2020/04/13/red-hat-data-grid-8-0-brings-new-server-architecture-improved-rest-api-and-more/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/04/producticons_1017_RGB_DataGrid_color-.png"
        },
        {
            "title": "JBoss EAP 7.3 brings new packaging capabilities",
            "date": "4:10:2020",
            "abstract": "In addition to a huge set of new features and improvements, the release of Red Hat JBoss Enterprise Application Platform 7.3 provides innovative packaging capabilities. In this article, I will highlight two of these new capabilities and demonstrate their benefits: splitting images into build versus runtimes, and configuration trimming with Galleon.",
            "link": "https://developers.redhat.com/blog/2020/04/10/jboss-eap-7-3-brings-new-packaging-capabilities/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Migrating a Spring Boot microservices application to Quarkus",
            "date": "4:10:2020",
            "abstract": "While Spring Boot has long been the de-facto framework for developing container-based applications in Java, the performance benefits of a Kubernetes-native framework are hard to ignore. In this article, I will show you how to quickly migrate a Spring Boot microservices application to Quarkus. Once the migration is complete, we’ll test the application and compare startup times between the original Spring Boot application and the new Quarkus app.",
            "link": "https://developers.redhat.com/blog/2020/04/10/migrating-a-spring-boot-microservices-application-to-quarkus/#more-694017",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Deploying projects to Apache Felix, Tomcat, and Karaf in VS Code",
            "date": "4:9:2020",
            "abstract": "We’re expanding tooling support for containers and servers in different development environments. Our existing VS Code extension, Red Hat Server Connector, only provides functionality for Red Hat servers and runtimes like WildFly, Minishift, Red Hat JBoss Enterprise Application Platform (JBoss EAP), and Red Hat Container Development Kit. In this article, we introduce Red Hat Community Server Connector, the newest addition to our Visual Studio Code (VS Code) extensions.",
            "link": "https://developers.redhat.com/blog/2020/04/09/deploying-projects-to-apache-felix-tomcat-and-karaf-in-vs-code/#more-694287",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Node.js update for Red Hat Runtimes brings improved support for native modules, diagnostic reporting, and more",
            "date": "4:9:2020",
            "abstract": "Developing applications on a Kubernetes distribution like Red Hat OpenShift—or on Red Hat Enterprise Linux (RHEL), or by using our Universal Base Images—is easier with Red Hat’s build of Node.js. The latest update of Red Hat Runtimes now includes Node.js 12.4.1, which provides a supported runtime for LTS releases. This new Red Hat build of Node.js together with the release of Red Hat Enterprise Linux 8.1 provides a number of new features and enhancements compared to Node.js 10.",
            "link": "https://developers.redhat.com/blog/2020/04/09/node-js-update-for-red-hat-runtimes-brings-improved-support-for-native-modules-diagnostic-reporting-and-more/#more-700717",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/10/bw_shaaf-150x150.png"
        },
        {
            "title": "Why Kubernetes native instead of cloud native?",
            "date": "4:8:2020",
            "abstract": "First off, I’m not referring to Knative, the Kubernetes-based platform for modern serverless workloads, but Kubernetes native. In this article, I will explain what Kubernetes native is, what it means, and why it should matter to developers and enterprises. Before we delve into Kubernetes native, I will recap what cloud-native application development is and how that leads us to Kubernetes-native application development.",
            "link": "https://developers.redhat.com/blog/2020/04/08/why-kubernetes-native-instead-of-cloud-native/#more-688987",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Migrating applications to OpenShift, Part 1: Overview",
            "date": "4:7:2020",
            "abstract": "I help teams migrate their applications onto Red Hat OpenShift, so I can’t help but notice patterns and considerations that arise regarding the migration process. Such operations have many domain-specific factors, but in regards to getting the applications up and running on OpenShift, there appear to be several common patterns that teams use to migrate successfully.",
            "link": "https://developers.redhat.com/blog/2020/04/07/migrating-applications-to-openshift-part-1-overview/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/Artwork-Red_Hat-OpenShift-B-RGB.png"
        },
        {
            "title": "What’s new with tzdata: The time zone database for Red Hat Enterprise Linux",
            "date": "4:3:2020",
            "abstract": "The Time Zone Database (tzdata) provides Red Hat Enterprise Linux (RHEL) with data that is specific to the local time zone. Applications in the Linux operating system use this data for various purposes. For instance, the GNU C Library (glibc) uses tzdata to ensure APIs such as strftime() work correctly, while applications such as /usr/bin/date use it to print the local date.",
            "link": "https://developers.redhat.com/blog/2020/04/03/whats-new-with-tzdata-the-time-zone-database-for-red-hat-enterprise-linux/#more-692597",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "JetBrains IntelliJ Red Hat OpenShift extension provides debug support for OpenShift components",
            "date": "4:3:2020",
            "abstract": "The 0.2.0 release version of the Red Hat OpenShift extension for JetBrains IntelliJ is now available. You can download the OpenShift Connector extension from the JetBrains Plugins Repository. This release provides a new OpenShift: Debug action to simplify the debugging of OpenShift Components pushed to a cluster. It is similar to features developed for Visual Studio Code and JBoss Tools for Eclipse. OpenShift Connector uses OpenShift Do‘s (odo‘s) debug command under the hood and supports only local Java and Node.js components. This enhancement lets the user write and debug local code without leaving IntelliJ.",
            "link": "https://developers.redhat.com/blog/2020/04/03/jetbrains-intellij-red-hat-openshift-extension-provides-debug-support-for-openshift-components/#more-682317",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "How to write an ABI compliance checker using Libabigail",
            "date": "4:2:2020",
            "abstract": "I’ve previously written about the challenges of ensuring forward compatibility for application binary interfaces (ABIs) exposed by native shared libraries. This article introduces the other side of the equation: How to verify ABI backward compatibility for upstream projects.",
            "link": "https://developers.redhat.com/blog/2020/04/02/how-to-write-an-abi-compliance-checker-using-libabigail/#more-691717",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Set up Red Hat AMQ Streams custom certificates on OpenShift (update)",
            "date": "4:1:2020",
            "abstract": "As anticipated in the “Additional notes” section of my previous article, starting from Red Hat AMQ Streams 1.4, it is finally possible to use your own custom certificate for encrypting communication between Kafka clients and brokers—without the requirement to provide a CA certificate. The auto-generated and -managed internal CAs will still remain, but only to protect inter-cluster communication.",
            "link": "https://developers.redhat.com/blog/2020/04/01/set-up-red-hat-amq-streams-custom-certificates-on-openshift-update/#more-691357",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/Artwork-Red_Hat-OpenShift-B-RGB.png"
        },
        {
            "title": "Running an event-driven health management business process through a few scenarios: Part 1",
            "date": "3:31:2020",
            "abstract": "In the previous series of articles, Designing an event-driven business process at scale: A health management example (which you need to read to fully understand this one), you designed and implemented an event-driven scalable business process for the population health management use case. Now, you will run this process through a few scenarios. In this way, you will:",
            "link": "https://developers.redhat.com/blog/2020/03/31/running-an-event-driven-health-management-business-process-through-a-few-scenarios-part-1/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/2020-02-24_10-02-09.png"
        },
        {
            "title": "Distribute your microservices data with events, CQRS, and event sourcing",
            "date": "3:30:2020",
            "abstract": "DevNation Tech Talks are hosted by the Red Hat technologists who create our products. These sessions include real solutions plus code and sample projects to help you get started. In this talk, you’ll learn about distributing your microservices data with events, Command Query Responsibility Segregation (CQRS), and event sourcing from Edson Yanaga, Red Hat’s Director of Developer Experience.",
            "link": "https://developers.redhat.com/blog/2020/03/30/distribute-your-microservices-data-with-events-cqrs-and-event-sourcing/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Red Hat XML language server becomes LemMinX, bringing new release and updated VS Code XML extension",
            "date": "3:27:2020",
            "abstract": "A new era has begun for Red Hat’s XML language server, which was migrated to the Eclipse Foundation under a new project name: Eclipse LemMinX (a reference to the Lemmings video game). The Eclipse LemMinX project is arguably the most feature-rich XML language server available. Its migration opens more doors for future development and utilization. In addition, shortly after its migration, the Eclipse LemMinX project and Red Hat also released updates: Eclipse LemMinX version 0.11.1 and the Red Hat VS Code XML extension.",
            "link": "https://developers.redhat.com/blog/2020/03/27/red-hat-xml-language-server-becomes-lemminx-bringing-new-release-and-updated-vs-code-xml-extension/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2019/10/eclipse-foundation.png"
        },
        {
            "title": "Static analysis in GCC 10",
            "date": "3:26:2020",
            "abstract": "I work at Red Hat on GCC, the GNU Compiler Collection. For the next major release of GCC, GCC 10, I’ve been implementing a new -fanalyzer option: A static analysis pass to identify various problems at compile-time, rather than at runtime.",
            "link": "https://developers.redhat.com/blog/2020/03/26/static-analysis-in-gcc-10/#more-689087",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/02/heckert_gnu.transparent.png"
        },
        {
            "title": "Low-code microservices orchestration with Syndesis",
            "date": "3:25:2020",
            "abstract": "Recently I wrote about decoupling infrastructure code from microservices. I found that Apache Camel and Debezium provided the middleware I needed for that project, with minimal coding on my end. After my successful experiment, I wondered if it would be possible to orchestrate two or more similarly decoupled microservices into a new service–and could I do it without writing any code at all? I decided to find out.",
            "link": "https://developers.redhat.com/blog/2020/03/25/low-code-microservices-orchestration-with-syndesis/#more-670847",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/02/syndesis_logo_1280px_full_lightbkg.png"
        },
        {
            "title": "Red Hat Universal Base Images for Docker users",
            "date": "3:24:2020",
            "abstract": "Red Hat Universal Base Images (UBIs) allow developers using Docker on Windows and Mac platforms to tap into the benefits of the large Red Hat ecosystem. This article demonstrates how to use Red Hat Universal Base Images with Docker from a non-Red Hat system, such as a Windows or Mac workstation.",
            "link": "https://developers.redhat.com/blog/2020/03/24/red-hat-universal-base-images-for-docker-users/#more-691797",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Ceph storage monitoring with Zabbix",
            "date": "3:23:2020",
            "abstract": "Storage prices are decreasing, while business demands are growing, and companies are storing more data than ever before. Following this growth pattern, demand grows for monitoring and data protection involving software-defined storage. Downtimes have a high cost that can directly impact business continuity and cause irreversible damage to organizations. Aftereffects include loss of assets and information; interruption of services and operations; law, regulation, or contract violations; along with the financial impacts from losing customers and damaging a company’s reputation.",
            "link": "https://developers.redhat.com/blog/2020/03/23/ceph-storage-monitoring-with-zabbix/#more-684817",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/02/img_5e5803a8cd966.png"
        },
        {
            "title": "Kogito 0.8.0 features online editors and cloud-native business automation",
            "date": "3:20:2020",
            "abstract": "Kogito is a cloud-native business automation solution that offers a powerful, developer-friendly experience. Based on production-tested open source projects Drools and jBPM, Kogito has business rules and processes down to a science. Kogito also aligns with popular lightweight runtimes such as Quarkus and Spring Boot to support developers building business-driven applications.",
            "link": "https://developers.redhat.com/blog/2020/03/20/kogito-0-8-0-features-online-editors-and-cloud-native-business-automation/#more-695697",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/kogito_icon_rgb_color_default_256px.png"
        },
        {
            "title": "Testing memory-based horizontal pod autoscaling on OpenShift",
            "date": "3:19:2020",
            "abstract": "Red Hat OpenShift offers horizontal pod autoscaling (HPA) primarily for CPUs, but it can also perform memory-based HPA, which is useful for applications that are more memory-intensive than CPU-intensive. In this article, I demonstrate how to use OpenShift’s memory-based horizontal pod autoscaling feature (tech preview) to autoscale your pods if the demands on memory increase. The test performed in this article might not necessarily reflect a real application. The tests only aim to demonstrate memory-based HPA in the simplest way possible.",
            "link": "https://developers.redhat.com/blog/2020/03/19/testing-memory-based-horizontal-pod-autoscaling-on-openshift/#more-688567",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/Artwork-Red_Hat-OpenShift-B-RGB.png"
        },
        {
            "title": "Cross-language link-time optimization using Red Hat Developer Tools",
            "date": "3:18:2020",
            "abstract": "Several months ago, the LLVM project blog published an article, Closing the gap: cross-language LTO between Rust and C/C++. In it, they explained that link-time optimization can improve performance by optimizing throughout the whole program, such as inlining function calls between different objects. Since Rust and Clang both use LLVM for code generation, we can even achieve this benefit across different programming languages.",
            "link": "https://developers.redhat.com/blog/2020/03/18/cross-language-link-time-optimization-using-red-hat-developer-tools/#more-688387",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "How to use the new Kafka Client API for Kafka-specific message properties in Open Liberty 20.0.0.3",
            "date": "3:17:2020",
            "abstract": "In Open Liberty 20.0.0.3, you can now access Kafka-specific properties such as the message key and message headers, rather than just the message payload, as was the case with the basic MicroProfile Reactive Messaging Message API. Also, you can now set the SameSite attribute in the session cookie, the LTPA, and JWT cookies as well as in application-defined cookies.",
            "link": "https://developers.redhat.com/blog/2020/03/17/how-to-use-the-new-kafka-client-api-for-kafka-specific-message-properties-in-open-liberty-20-0-0-3/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/OpenLiberty-OL_logomark_400.png"
        },
        {
            "title": "Extending gdbserver to support an strace client",
            "date": "3:16:2020",
            "abstract": "The strace command traces system calls and signals, deciding them and their corresponding arguments into a symbolic form. A frequent debugging request from developers is the ability to allow strace to trace system calls for a program that is also being debugged by GDB, like this:",
            "link": "https://developers.redhat.com/blog/2020/03/16/extending-gdbserver-to-support-an-strace-client/#more-688227",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Possible issues with debugging and inspecting compiler-optimized binaries",
            "date": "3:13:2020",
            "abstract": "Developers think of their programs as a serial sequence of operations running as written in the original source code. However, program source code is just a specification for computations. The compiler analyzes the source code and determines if changes to the specified operations will yield the same visible results but be more efficient. It will eliminate operations that are ultimately not visible, and rearrange operations to extract more parallelism and hide latency. These differences between the original program’s source code and the optimized binary that actually runs might be visible when inspecting the execution of the optimized binary via tools like GDB and SystemTap.",
            "link": "https://developers.redhat.com/blog/2020/03/13/possible-issues-with-debugging-and-inspecting-compiler-optimized-binaries/#more-673227",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/03/insects-4798271_1280.png"
        },
        {
            "title": "How to customize Fedora CoreOS for dedicated workloads with OSTree",
            "date": "3:12:2020",
            "abstract": "In part one of this series, I introduced Fedora CoreOS (and Red Hat CoreOS) and explained why its immutable and atomic nature is important for running containers. I then walked you through getting Fedora CoreOS, creating an Ignition file, booting Fedora CoreOS, logging in, and running a test container. In this article, I will walk you through customizing Fedora CoreOS and making use of its immutable and atomic nature.",
            "link": "https://developers.redhat.com/blog/2020/03/12/how-to-customize-fedora-coreos-for-dedicated-workloads-with-ostree/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Some more C# 8",
            "date": "3:11:2020",
            "abstract": "In previous articles, we covered C# 8 asynchronous streams, C# 8 pattern matching, C# 8 default interface methods, and C# 8 nullable reference types. In this final article, we’ll look at static local functions, indices and ranges, and using declarations.",
            "link": "https://developers.redhat.com/blog/2020/03/11/some-more-c-8/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2017/09/1025424-1-150x150.png"
        },
        {
            "title": "How to run containerized workloads securely and at scale with Fedora CoreOS",
            "date": "3:10:2020",
            "abstract": "The history of container-optimized operating systems is short but filled by a variety of proposals with different degrees of success. Along with CoreOS Container Linux, Red Hat sponsored the Project Atomic community, which is today the umbrella that holds many projects, from Fedora/CentOS/Red Hat Enterprise Linux Atomic Host to container tools (Buildah, skopeo, and others) and Fedora SilverBlue, an immutable OS for the desktop (more on the “immutable” term in the next sections).",
            "link": "https://developers.redhat.com/blog/2020/03/10/how-to-run-containerized-workloads-securely-and-at-scale-with-fedora-coreos/#more-683857",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Shenandoah GC in JDK 14, Part 2: Concurrent roots and class unloading",
            "date": "3:9:2020",
            "abstract": "The first part of this miniseries about Shenandoah GC in JDK 14 covered self-fixing barriers. This article discusses concurrent roots processing and concurrent class unloading, both of which aim to reduce GC pause time by moving GC work from the pause to a concurrent phase.",
            "link": "https://developers.redhat.com/blog/2020/03/09/shenandoah-gc-in-jdk-14-part-2-concurrent-roots-and-class-unloading/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Configure and run a QEMU-based VM outside of libvirt with virt-manager",
            "date": "3:6:2020",
            "abstract": "I recently needed to run a virtual machine (VM) created using virt-manager outside of libvirt. I was investigating an issue that required running QEMU with the machine option dump-guest-core=on. By default, libvirt runs with that option off, so I decided to set up a standalone QEMU environment. I found the process of configuring the test VM and writing the boot script more involved than expected, so I decided to document the steps I took.",
            "link": "https://developers.redhat.com/blog/2020/03/06/configure-and-run-a-qemu-based-vm-outside-of-libvirt/#more-682847",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/02/Screenshot-at-2020-02-05-14-15-25.png"
        },
        {
            "title": "C# 8 nullable reference types",
            "date": "3:5:2020",
            "abstract": "In the previous article, we discussed C# 8 default interface methods. In this article, we’ll look at C# 8 nullable reference types. Reference types refer to an object that is on the heap. When there is no object to refer to, the value is null. Sometimes null is an acceptable value, but often it is an illegal value that leads to ArgumentNullExceptions and NullReferenceExceptions.",
            "link": "https://developers.redhat.com/blog/2020/03/05/c-8-nullable-reference-types/#more-676537",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2017/09/1025424-1-150x150.png"
        },
        {
            "title": "Shenandoah GC in JDK 14, Part 1: Self-fixing barriers",
            "date": "3:4:2020",
            "abstract": "The development of the Shenandoah Garbage Collector (GC) in the upcoming JDK 14 has seen significant improvements. The first one covered here (self-fixing barriers) aims to reduce local latencies that are spent in barrier mid- and slow paths. The second will cover concurrent root processing and concurrent class unloading.",
            "link": "https://developers.redhat.com/blog/2020/03/04/shenandoah-gc-in-jdk-14-part-1-self-fixing-barriers/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2019/08/2019_Email_Hero_Design_JDK-copy.png"
        },
        {
            "title": "C# 8 default interface methods",
            "date": "3:3:2020",
            "abstract": "In the previous articles, we discussed C# 8 async streams and pattern matching. In this article, we’ll look at C# 8 default interface methods.",
            "link": "https://developers.redhat.com/blog/2020/03/03/c-8-default-interface-methods/#more-676517",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2017/09/1025424-1-150x150.png"
        },
        {
            "title": "Debugging components in OpenShift using VS Code",
            "date": "2:28:2020",
            "abstract": "The latest release of OpenShift Connector enhances the developer experience on Red Hat OpenShift with support for local code debugging. This enhancement lets the user write and debug local code without leaving the editor.",
            "link": "https://developers.redhat.com/blog/2020/02/28/debugging-components-in-openshift-using-vs-code/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "C# 8 pattern matching",
            "date": "2:27:2020",
            "abstract": "In the previous article, we looked at C# 8 asynchronous streams. Another new C# 8 feature is extended support for pattern matching. In this article, we’ll take a look at what was possible with C# 7 and what was added in C# 8.",
            "link": "https://developers.redhat.com/blog/2020/02/27/c-8-pattern-matching/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2017/09/1025424-1-150x150.png"
        },
        {
            "title": "Red Hat simplifies container development and redistribution of Red Hat Enterprise Linux packages",
            "date": "2:26:2020",
            "abstract": "Application developers in the Red Hat Partner Connect program can now build their container apps and redistribute them from the full set of Red Hat Enterprise Linux (RHEL) user space packages (non-kernel). This nearly triples the number of packages over UBI only.",
            "link": "https://developers.redhat.com/blog/2020/02/26/red-hat-simplifies-container-dev-and-redistribution-rhel-packages/#more-688767",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2019/08/2019_Email_Hero_Design_RHEL.png"
        },
        {
            "title": "Speed up Maven builds in Tekton Pipelines",
            "date": "2:26:2020",
            "abstract": "Tekton is an open source project that provides standard Kubernetes-style resources and building blocks for creating CI/CD pipelines that can run on any Kubernetes. Tekton does this by introducing a number of custom resource definitions (CRD) such as Pipeline, Task, and ClusterTask to provide a language and structure for defining delivery pipelines as shown in Figure 1. Tekton also provides a set of controllers that are responsible for running pipelines in pods on demand whenever a user creates an aforementioned resource.",
            "link": "https://developers.redhat.com/blog/2020/02/26/speed-up-maven-builds-in-tekton-pipelines/#more-683407",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/02/image5.png"
        },
        {
            "title": "How to ignore files in Git without .gitignore",
            "date": "2:25:2020",
            "abstract": "Git has a handy feature when it comes to preventing accidental file check-ins when the files are meant to stay local. The obvious candidates are compiled binaries when you only want to check in the source code. Other candidates are files with local configurations.",
            "link": "https://developers.redhat.com/blog/2020/02/25/how-to-ignore-files-in-git-without-gitignore/#more-681437",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/02/Git-Icon-1788C-e1582181800231.png"
        },
        {
            "title": "C# 8 asynchronous streams",
            "date": "2:24:2020",
            "abstract": ".NET Core 3.1 (December 2019) includes support for C# 8, a new major version of the C# programming language. In this series of articles, we’ll look at the new features in .NET’s main programming language. This first article, in particular, looks at asynchronous streams. This feature makes it easy to create and consume asynchronous enumerables, so before getting into the new feature, you first need to understand the IEnumerable interface.",
            "link": "https://developers.redhat.com/blog/2020/02/24/c-8-asynchronous-streams/#more-676487",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2017/09/1025424-1-150x150.png"
        },
        {
            "title": "Designing an event-driven process at scale: Part 3",
            "date": "2:21:2020",
            "abstract": "In the first article in this series, Designing an event-driven business process at scale: A health management example, Part 1, you found the business use case and data model for a concrete example from the health management industry. You then began implementing the example in jBPM (an open source business automation suite) by creating the Trigger process.",
            "link": "https://developers.redhat.com/blog/2020/02/21/designing-an-event-driven-process-at-scale-part-3/#more-685887",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/02/PHM-Processes-Fig-9.png"
        },
        {
            "title": "Designing an event-driven process at scale: Part 2",
            "date": "2:20:2020",
            "abstract": "In the first article in this series, Designing an event-driven business process at scale: A health management example, Part 1, we began by defining the business use case and data model for a concrete example from the health management industry. We then began implementing the example in jBPM (an open source business automation suite) by creating our trigger process.",
            "link": "https://developers.redhat.com/blog/2020/02/20/designing-an-event-driven-process-at-scale-part-2/#more-685907",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/02/2020-03-01_09-09-44.png"
        },
        {
            "title": "Designing an event-driven business process at scale: A health management example, Part 1",
            "date": "2:19:2020",
            "abstract": "The concept of a business process (BP), or workflow (WF), and the discipline and practice of business process management (BPM) have been around since the early 90s. Since then, WF/BPM tools have evolved considerably. More recently, a convergence of different tools has taken place, adding decision management (DM) and case management (CM) to the mix. The ascendance of data science, machine learning, and artificial intelligence in the last few years has further complicated the picture. The mature field of BPM has been subsumed into the hyped pseudo-novelties of digital business automation, digital reinvention, digital everything, etc., with the addition of “low code” and robotic process automation (RPA).",
            "link": "https://developers.redhat.com/blog/2020/02/19/designing-an-event-driven-business-process-at-scale-a-health-management-example-part-1/#more-676127",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/02/PHM-Processes-Fig-215-full-size-1.png"
        },
        {
            "title": "Metrics and traces correlation in Kiali",
            "date": "2:18:2020",
            "abstract": "Metrics, traces, and logs might be the Three Pillars of Observability, as you’ve certainly already heard. This mantra helps us focus our mindset around observability, but it is not a religion. “There is so much more data that can help us have insight into our running systems,” said Frederic Branczyk at KubeCon last year.",
            "link": "https://developers.redhat.com/blog/2020/02/18/metrics-and-traces-correlation-in-kiali/#more-680837",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/02/Capture-d’écran-de-2020-01-27-15-11-25-1024x729.png"
        },
        {
            "title": "Continuous integration with GDB Buildbot",
            "date": "2:17:2020",
            "abstract": "Continuous integration is a hot topic these days, and the GNU Project Debugger is keeping up with the trend. Who better to serve as a role model for tracking and exterminating bugs than a debugger?",
            "link": "https://developers.redhat.com/blog/2020/02/17/continuous-integration-with-gdb-buildbot/#more-645197",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/02/robots-4838671.png"
        },
        {
            "title": "Using secrets in Kafka Connect configuration",
            "date": "2:14:2020",
            "abstract": "Kafka Connect is an integration framework that is part of the Apache Kafka project. On Kubernetes and Red Hat OpenShift, you can deploy Kafka Connect using the Strimzi and Red Hat AMQ Streams Operators. Kafka Connect lets users run sink and source connectors. Source connectors are used to load data from an external system into Kafka. Sink connectors work the other way around and let you load data from Kafka into another external system. In most cases, the connectors need to authenticate when connecting to the other systems, so you will need to provide credentials as part of the connector’s configuration. This article shows you how you can use Kubernetes secrets to store the credentials and then use them in the connector’s configuration.",
            "link": "https://developers.redhat.com/blog/2020/02/14/using-secrets-in-apache-kafka-connect-configuration/#more-680387",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/02/top-secret-2054429_1920.png"
        },
        {
            "title": "OpenShift Actions: Deploy to Red Hat OpenShift directly from your GitHub repository",
            "date": "2:13:2020",
            "abstract": "Here is a common situation: You write your code, everything is on GitHub, and you are ready to publish it. But, you know that your job is not finished yet. You need to deploy your code and this process can be a nightmare at times.",
            "link": "https://developers.redhat.com/blog/2020/02/13/openshift-actions-deploy-to-red-hat-openshift-directly-from-your-github-repository/#more-676347",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/01/oc-actio-2.png"
        },
        {
            "title": "Podman for macOS (sort of)",
            "date": "2:12:2020",
            "abstract": "I have a problem. My daily laptop is a MacBook Pro, which is great unless you want to dual boot into Linux and develop on containers. While it is simple enough to install Red Hat CodeReady Containers, what I really needed was a way to run Buildah, Podman, and skopeo on macOS without having to water and feed a Linux VM.",
            "link": "https://developers.redhat.com/blog/2020/02/12/podman-for-macos-sort-of/",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2019/08/podman.png"
        },
        {
            "title": "Toward _FORTIFY_SOURCE parity between Clang and GCC",
            "date": "2:11:2020",
            "abstract": "GCC combined with glibc can detect instances of buffer overflow by standard C library functions. When a user passes the -D_FORTIFY_SOURCE={1,2} preprocessor flag and an optimization level greater or equal to -O1, an alternate, fortified implementation of the function is used when calling, say, strcpy. Depending on the function and its inputs, this behavior may result in a compile-time error, or a runtime error triggered upon execution. (For more info on this feature, there’s an excellent blog post here on the subject).",
            "link": "https://developers.redhat.com/blog/2020/02/11/toward-_fortify_source-parity-between-clang-and-gcc/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Installing Kubeflow v0.7 on OpenShift 4.2",
            "date": "2:10:2020",
            "abstract": "As part of the Open Data Hub project, we see potential and value in the Kubeflow project, so we dedicated our efforts to enable Kubeflow on Red Hat OpenShift. We decided to use Kubeflow 0.7 as that was the latest released version at the time this work began. The work included adding new installation scripts that provide all of the necessary changes such as permissions for service accounts to run on OpenShift.",
            "link": "https://developers.redhat.com/blog/2020/02/10/installing-kubeflow-v0-7-on-openshift-4-2/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Introducing 10 new features in Quarkus Tools for Visual Studio Code",
            "date": "2:7:2020",
            "abstract": "Quarkus Tools for Visual Studio Code version 1.3.0 has been released on the VS Code Marketplace to start off the new year. As Quarkus continues to introduce improvements and new features like application.yaml and server-side templating support, Quarkus Tools for Visual Studio Code continues to evolve to accompany these new features and improvements.",
            "link": "https://developers.redhat.com/blog/2020/02/07/introducing-10-new-features-in-quarkus-tools-for-visual-studio-code/",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Red Hat OpenShift 4.2 IPI on OpenStack 13: All-in-one setup",
            "date": "2:6:2020",
            "abstract": "Months ago, a customer asked me about Red Hat OpenShift on OpenStack, especially regarding the network configuration options available in OpenShift at the node level. In order to give them an answer and increase my confidence on $topic, I’ve considered how to test this scenario.",
            "link": "https://developers.redhat.com/blog/2020/02/06/red-hat-openshift-4-2-ipi-on-openstack-13-all-in-one-setup/#more-656047",
            "img": "https://developers.redhat.com/blog/wp-content/uploads/2020/01/Openshift4.2_on_Openstack_SchemaBlogArticle.png"
        },
        {
            "title": "Customizing OpenShift project creation",
            "date": "2:5:2020",
            "abstract": "I recently attended an excellent training run by Red Hat’s Global Partner Enablement Team on advanced Red Hat OpenShift management. One of the most interesting elements of the training was how to customize default project creation. This article explains how to use OpenShift’s projectRequestTemplate to add default controls for the resources that a project is allowed to consume.",
            "link": "https://developers.redhat.com/blog/2020/02/05/customizing-openshift-project-creation/#more-673297",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "How to use third-party APIs in Operator SDK projects",
            "date": "2:4:2020",
            "abstract": "The Operator Framework is an open source toolkit for managing Kubernetes-native applications. This framework and its features provide the ability to develop tools that simplify complexities, such as installing, configuring, managing, and packaging applications on Kubernetes and Red Hat OpenShift. In this article, we show how to use third-party APIs in Operator-SDK projects.",
            "link": "https://developers.redhat.com/blog/2020/02/04/how-to-use-third-party-apis-in-operator-sdk-projects/#more-672447",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        },
        {
            "title": "Camel K standalone Java file: Now with Java language support",
            "date": "2:3:2020",
            "abstract": "Apache Camel K should be as lightweight as possible. Therefore, the Camel K project provides standalone Java files to describe a Camel integration. The downside to this practice is that existing IDEs cannot provide complete support out of the box. To provide a complete experience with Apache Camel K’s standalone Java files, there were three solutions:",
            "link": "https://developers.redhat.com/blog/2020/02/03/camel-k-standalone-java-file-now-with-java-language-support/#more-671807",
            "img": "https://static.addtoany.com/buttons/favicon.png"
        }
    ]
}