{
    "yelp": [
        {
            "abstract": "Many machine learning (ML) practitioners use partial dependence plots (PDP) to gain insights into model behaviors. But have you run into situations where PDPs average two groups with different behaviors and produce curves applicable to none? Are you longing for tools that help you understand detailed model behavior in a visually manageable way? Look no further! We are thrilled to share with you our newest model interpretation tools: the Nearby Individual Conditional Expectation plot and its companion, the Partial Dependence at Quantiles plot. They highlight local behaviors and hint at how much we may trust such readings. A not NICE...",
            "author": "Shichao Ma, Applied Scientist",
            "date": "12:17:2020",
            "image": "https://engineeringblog.yelp.com/images/previews/2020-12-17-now-you-see-me-how-nice-and-pdq-plots-uncover-model-behaviors-hidden-by-partial-dependence-plots.png",
            "link": "https://engineeringblog.yelp.com/2020/12/now-you-see-me-how-nice-and-pdq-plots-uncover-model-behaviors-hidden-by-partial-dependence-plots.html",
            "title": "Now You See Me: How NICE and PDQ plots Uncover Model Behaviors Hidden by Partial Dependence Plots"
        },
        {
            "abstract": "This post is about how Yelp is transitioning from the management of Cassandra clusters in EC2 to orchestrating the same clusters in production on Kubernetes. We will start by discussing the EC2-based deployment we have used for the past few years, followed by an introduction to the Cassandra operator, its responsibilities, the core reconciliation workflow of the operator, and finally, the etcd locking we employ for cross-region coordination. Cassandra is a distributed wide-column NoSQL datastore and is used at Yelp for both primary and derived data. Yelp’s infrastructure for Cassandra has been deployed on AWS EC2 and ASG (Autoscaling Group)...",
            "author": "Raghavendra D Prabhu, Software Engineer",
            "date": "11:16:2020",
            "image": "https://engineeringblog.yelp.com/images/previews/2020-11-16-orchestrating-cassandra-on-kubernetes-with-operators_preview.png",
            "link": "https://engineeringblog.yelp.com/2020/11/orchestrating-cassandra-on-kubernetes-with-operators.html",
            "title": "Orchestrating Cassandra on Kubernetes with Operators"
        },
        {
            "abstract": "Engineers on Yelp’s Consumer Growth team work closely with product managers, data scientists, and designers to increase user acquisition, engagement and retention to fuel the rest of the business. The team is central to growing the number of active users on the Yelp platform. In-App Update, introduced in Android Pie, is a feature that allows Android users to update the app by showing a prompt while they’re using the app and keeps users in the app as the update is happening in the background. We thought it would be a valuable feature for consumers on Yelp and began researching and...",
            "author": "Arash Nase, Android Developer",
            "date": "11:13:2020",
            "image": "https://engineeringblog.yelp.com/images/previews/growth_mobile_dev_preview.png",
            "link": "https://engineeringblog.yelp.com/2020/11/tales-of-a-mobile-developer-on-consumer-growth.html",
            "title": "Tales of a Mobile Developer on Consumer Growth"
        },
        {
            "abstract": "The relational database of choice at Yelp is MySQL and it powers much of the Yelp app and yelp.com. MySQL does not include a native high-availability solution for the replacement of a primary server, which is a single point of failure. This is a tradeoff of its dedication to ensuring consistency. Replacing a primary server is sometimes necessary due to planned or unplanned events, like an operating system upgrade, a database crash or hardware failure. This requires pausing data modifications to the database while the server is restarted or replaced and can mean minutes of downtime. Pausing data modifications means...",
            "author": "Nick Del Nano, Database Reliability Engineer",
            "date": "11:9:2020",
            "image": "https://engineeringblog.yelp.com/images/previews/2020-11-09-minimizing-read-write-mysql-downtime/2020-11-09-minimizing-mysql-downtime.png",
            "link": "https://engineeringblog.yelp.com/2020/11/minimizing-read-write-mysql-downtime.html",
            "title": "Minimizing read-write MySQL downtime"
        },
        {
            "abstract": "Jupyter notebooks are a key tool that powers Yelp data. It allows us to do ad hoc development interactively and analyze data with visualization support. As a result, we rely on Jupyter to build models, create features, run Spark jobs for big data analysis, etc. Since notebooks play a crucial role in our business processes, it is really important for us to ensure the notebook output is reproducible. In this blog post, we’ll introduce our notebook archive and sharing service called Folium and its key integrations with our Jupyterhub that enable notebook reproducibility and improve ML engineering developer velocity. Folium...",
            "author": "Lydian Lee, ML Platform Tech Lead; Ryan Irwin, Engineering Manager",
            "date": "10:21:2020",
            "image": "https://engineeringblog.yelp.com/images/previews/folium-and-jupyterhub.png",
            "link": "https://engineeringblog.yelp.com/2020/10/introducing-folium-enabling-reproducible-notebooks-at-yelp.html",
            "title": "Introducing Folium: Enabling Reproducible Notebooks at Yelp"
        },
        {
            "abstract": "At Yelp we process terabytes of streaming data a day using Apache Flink to power a wide range of applications: ETL pipelines, push notifications, bot filtering, sessionization and more. We run hundreds and hundreds of Flink jobs, so routine operations like deployments, restarts, and savepoints don’t take thousands of hours of developers’ time, which would be the case without the right degree of automation. The latest addition to our toolshed is a new stream processing platform built on top of PaaSTA, Yelp’s Platform As A Service. Sitting at its core, a Kubernetes operator automatically watches over the deployment and the...",
            "author": "Antonio Verardi, Engineering Manager",
            "date": "10:14:2020",
            "image": "https://engineeringblog.yelp.com/images/previews/flink-on-paasta.png",
            "link": "https://engineeringblog.yelp.com/2020/10/flink-on-paasta.html",
            "title": "Flink on PaaSTA: Yelp’s new stream processing platform runs on Kubernetes"
        },
        {
            "abstract": "At Yelp, new web pages and app screens are powered by GraphQL for fetching data. This blog post describes the Dream Query – a pattern our feature teams use when refactoring or creating new pages. (Check out our previous blog post to see how we dynamically codegen DataLoaders to implement the server layer!) Scoping a new feature with GraphQL Let’s jump in with an example! Imagine your team is tasked with creating the new version of the “Header component” for the website (we’ll use the Yelp.com website in our example). You may receive a design mock that looks like this:...",
            "author": "Mark Larah, Tech Lead",
            "date": "10:7:2020",
            "image": "https://engineeringblog.yelp.com/images/previews/cloud.jpeg",
            "link": "https://engineeringblog.yelp.com/2020/10/dream-query.html",
            "title": "The Dream Query: How we scope projects with GraphQL"
        },
        {
            "abstract": "At Yelp, usage of Prometheus, the open-source monitoring system and time series database, is blossoming. Yelp is initially focusing on onboarding infrastructure services to be monitored via Prometheus, one such service being Apache Kafka. This blogpost discusses some of the performance issues we initially encountered while monitoring Kafka with Prometheus, and how we solved them by contributing back to the Prometheus community. Kafka at Yelp primer Kafka is an integral part of Yelp’s infrastructure, clusters are varied in size and often contain several thousand topics. By default, Kafka exposes a lot of metrics that can be collected, most of which...",
            "author": "Flavien Raynaud, Software Engineer",
            "date": "10:2:2020",
            "image": "https://engineeringblog.yelp.com/images/previews/prometheus-logo.png",
            "link": "https://engineeringblog.yelp.com/2020/10/improving-the-performance-of-the-prometheus-jmx-exporter.html",
            "title": "Improving the performance of the Prometheus JMX Exporter"
        },
        {
            "abstract": "Understanding data is a vital part of Yelp’s success. To connect our consumers with great local businesses, we make millions of recommendations every day for a variety of tasks like: Finding you immediate quotes for a plumber to fix your leaky sink Helping you discover which restaurants are open for delivery right now Identifying the most popular dishes for you to try at those restaurants Inferring possible service offerings so business owners can confidently and accurately represent their business on Yelp In the early days of Yelp circa 2004, engineers painstakingly designed heuristic rules to power recommendations like these, but...",
            "author": "Jason Sleight, ML Platform Group Tech Lead",
            "date": "7:1:2020",
            "image": "https://engineeringblog.yelp.com/images/previews/aml-single-transparent.png",
            "link": "https://engineeringblog.yelp.com/2020/07/ML-platform-overview.html",
            "title": "Introducing Yelp's Machine Learning Platform"
        },
        {
            "abstract": "Yelp periodically releases an open, all-purpose dataset for learning. The dataset is a subset of our businesses, reviews, and user data to inform government policy, academic research, and business strategy, among other uses. It has provided opportunities including teaching students about databases, helping others study natural language processing, sampling production data while learning to create mobile apps, and discovering compelling research findings. Our most recent dataset was published in March 2020. Businesses everywhere are adapting to the effects of the Coronavirus and have been using Yelp features to stay connected with their customers. To this end, we’re releasing an addendum...",
            "author": "Kevin Knaust, Sebastien Couvidat, Carl Bialik, Grace Jiras",
            "date": "6:15:2020",
            "image": "https://engineeringblog.yelp.com/images/previews/yelp_open_dataset.png",
            "link": "https://engineeringblog.yelp.com/2020/06/how-businesses-have-reacted-to-covid-19-using-yelp-features.html",
            "title": "How businesses have reacted to COVID-19 using Yelp features"
        },
        {
            "abstract": "We’re open sourcing dataloader-codegen, an opinionated JavaScript library for automatically generating DataLoaders over a set of resources (e.g. HTTP endpoints). Go check it out on GitHub! This blog post discusses the motivation and some the lessons we learned along the way. Managing GraphQL DataLoaders at Scale At Yelp, we use GraphQL to provide data for our React webapps. The GraphQL Server is deployed as a public gateway that wraps hundreds of internal HTTP endpoints that are distributed across hundreds of services. GraphQL Request Diagram DataLoaders DataLoaders provide an important caching/optimization layer in many GraphQL servers. If you aren’t already familiar...",
            "author": "Mark Larah, Tech Lead",
            "date": "4:8:2020",
            "image": "https://engineeringblog.yelp.com/images/previews/dataloader-codegen.png",
            "link": "https://engineeringblog.yelp.com/2020/04/open-sourcing-dataloader-codegen.html",
            "title": "dataloader-codegen: Autogenerate DataLoaders for your GraphQL Server!"
        },
        {
            "abstract": "An Ever-Evolving Company Requires an Ever-Evolving Communication Plan It’s 2014 and your teams are divided by platform, something like: Web, Mobile Web, Android, and iOS. In order to launch features, product managers jump from platform to platform and teams move fast. Really fast. Lines of code in each repository increase to the point where you now name them “monoliths.” A few engineers maintain these monoliths when they need to, but no one is solely dedicated to the task. Engineers are distributed by platform; so communication on when to maintain the monoliths is easy, but presents another problem. Can you continue...",
            "author": "Kent Wills, Engineering Manager",
            "date": "3:6:2020",
            "image": "https://engineeringblog.yelp.com/images/previews/an-ever-evolving-org-requires-an-ever-evolving-communication-plan_preview.png",
            "link": "https://engineeringblog.yelp.com/2020/03/an-ever-evolving-company-requires-an-ever-evolving-communication-plan.html",
            "title": "An Ever Evolving Company Requires an Ever Evolving Communication Plan"
        },
        {
            "abstract": "Yelp extensively utilizes distributed batch processing for a diverse set of problems and workflows. Some examples include: Computation over Yelp’s review corpus to identify restaurants that have great views Training ML models to predict personalized business collections for individual users Analytics to extract the most in-demand service offerings for Request a Quote projects On-demand workloads to investigate surges in bot traffic so we can quickly react to keep Yelp safe Over the past two years, Yelp engineering has undertaken a series of projects to consolidate our batch processing technologies and standardize on Apache Spark. These projects aimed to simultaneously accelerate...",
            "author": "Jason Sleight, ML Platform Group Tech Lead; Huadong Liu, Software Engineer; and Stuart Elston, Software Engineer",
            "date": "3:2:2020",
            "image": "https://engineeringblog.yelp.com/images/previews/spark_diagram.png",
            "link": "https://engineeringblog.yelp.com/2020/03/spark-on-paasta.html",
            "title": "Supporting Spark as a First-Class Citizen in Yelp’s Computing Platform"
        },
        {
            "abstract": "Summary Here at Yelp, we generate business wins and a better platform by running A/B tests to measure the revenue impact of different user and business experience interventions. Accurately estimating key revenue indicators, such as the probability a customer retains at least \\(n\\)-days (\\(n\\)-day retention) or the expected dollar amount a customer spends over their first \\(n\\) days (\\(n\\)-day spend) is core to this experimentation process. Historically at Yelp, \\(n\\)-day customer or user retention was typically estimated as the proportion of customers/users we observed for more than \\(n\\) days who retained more than \\(n\\) days. Similarly, \\(n\\)-day spend was estimated...",
            "author": "Conner DiPaolo, Applied Scientist",
            "date": "2:20:2020",
            "image": "https://engineeringblog.yelp.com/images/previews/expt_lifestyle.png",
            "link": "https://engineeringblog.yelp.com/2020/02/accelerating-retention-experiments-with-partially-observed-data.html",
            "title": "Accelerating Retention Experiments with Partially Observed Data"
        },
        {
            "abstract": "Last October we sent a group of Yelpers to the 2019 Grace Hopper Celebration! Here are a few takeaways and reflections from some of our attendees. Who attended? Surashree K., software engineer on Semantic Business Information Clara M., product design lead on Content Anna F., machine learning engineer on Semantic Business Information Nikunja G., software engineer on Infrastructure Security Catlyn K., software engineer on Stream Processing What was your favorite session? Surashree: Honestly, it’s hard to choose, but the one that stuck with me was the talk by Jackie Tsay and Matthew Dierker on Google’s Smart Compose, the Gmail feature...",
            "author": "Surashree Kulkarni, Software Engineer",
            "date": "2:12:2020",
            "image": "https://engineeringblog.yelp.com/images/previews/GHC_group_photo.jpg",
            "link": "https://engineeringblog.yelp.com/2020/02/grace-hopper-yelp-2019.html",
            "title": "Yelp Takes on Grace Hopper 2019!"
        },
        {
            "abstract": "Varanus The monitor lizards are large lizards in the genus Varanus. Some time ago, our Android app got into a loop of sending data, due to some unlikely interactions between several different systems, which briefly overwhelmed our servers before we were able to turn it off. Fortunately, key code was behind an experiment. Otherwise, apps could have continued misbehaving for days, as there is no guarantee users would immediately update the app. It took an unusual combination of circumstances for this to happen, but this kind of problem seems to be a pervasive concern across the industry, and there are...",
            "author": "Sanae Rosen and Kurt Bonatz, Software Engineers",
            "date": "2:6:2020",
            "image": "https://engineeringblog.yelp.com/images/previews/open_sourcing_varanus_and_rusty_jetpack.png",
            "link": "https://engineeringblog.yelp.com/2020/02/open-sourcing-varanus-and-rusty-jetpack.html",
            "title": "Open-Sourcing Varanus and Rusty Jetpack"
        },
        {
            "abstract": "Yelp’s mission is to connect users with great local businesses. As part of that mission, we provide local businesses with an ads product to help them better reach out to users. This product strives to showcase the most relevant ads to the user without taking away from their overall search experience on Yelp. In this blog post, we’ll walk through the architecture of how this is made possible by using one of the largest machine learning systems at Yelp: Ads Targeting System. The Ads Targeting System is a machine learning (ML) system designed to serve only the most relevant ads...",
            "author": "Rahul Dubey, Machine Learning Engineer",
            "date": "1:30:2020",
            "image": "https://engineeringblog.yelp.com/images/previews/ads_targeting_pipeline_preview.png",
            "link": "https://engineeringblog.yelp.com/2020/01/modernizing-ads-targeting-machine-learning-pipeline.html",
            "title": "Modernizing Ads Targeting Machine Learning Pipeline"
        },
        {
            "abstract": "We launched our very first Kafka cluster at Yelp more than five years ago. It was not monitored, did not expose any metrics, and we definitely did not have anyone on call for it. One year later, Kafka had already become one of the most important distributed systems running at Yelp, and today has become one of the core components of our infrastructure. Kafka has come a long way since the 0.8 version we were running back then, and our tooling (some of it open-source) has also significantly improved, increasing reliability and reducing the amount of operational work required to...",
            "author": "Flavien Raynaud, Software Engineer",
            "date": "1:22:2020",
            "image": "https://engineeringblog.yelp.com/images/previews/streams-and-monk.png",
            "link": "https://engineeringblog.yelp.com/2020/01/streams-and-monk-how-yelp-approaches-kafka-in-2020.html",
            "title": "Streams and Monk – How Yelp is Approaching Kafka in 2020"
        },
        {
            "abstract": "Scaling security coverage in a growing company is hard. The only way to do this effectively is to empower front-line developers to be able to easily discover, triage, and fix vulnerabilities before they make it to production servers. Today, we’re excited to announce that we’ll be open-sourcing fuzz-lightyear: a testing framework we’ve developed to identify Insecure Direct Object Reference (IDOR) vulnerabilities through stateful Swagger fuzzing, tailored to support an enterprise, microservice architecture. This integrates with our Continuous Integration (CI) pipeline to provide consistent, automatic test coverage as web applications evolve. The Problem As a class of vulnerabilities, IDOR is arguably...",
            "author": "Aaron Loo, Engineering Manager",
            "date": "1:16:2020",
            "image": "https://engineeringblog.yelp.com/images/previews/fuzz-lightyear.png",
            "link": "https://engineeringblog.yelp.com/2020/01/automated-idor-discovery-through-stateful-swagger-fuzzing.html",
            "title": "Automated IDOR Discovery through Stateful Swagger Fuzzing"
        },
        {
            "abstract": "The first half of this post covered the requirements and design choices of the Cassandra Source Connector and dove into the details of the CDC Publisher. As described, the CDC Publisher processes Cassandra CDC data and publishes it as loosely ordered PartitionUpdate objects into Kafka as intermediate keyed streams. The intermediate streams then serve as input for the DP Materializer. Data Pipeline Materializer The DP Materializer ingests the serialized PartitionUpdate objects published by the CDC Publisher, transforms them into fully formed Data Pipeline messages, and publishes them into the Data Pipeline. The DP Materializer is built on top of Apache...",
            "author": "Harshal Dalvi, Engineering Manager and Andrew Prudhomme, Software Engineer",
            "date": "12:18:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/2019-12-18-csource-part-2/dp-materializer-high-level.jpeg",
            "link": "https://engineeringblog.yelp.com/2019/12/cassandra-source-connector-part-2.html",
            "title": "Streaming Cassandra into Kafka in (Near) Real-Time: Part 2"
        },
        {
            "abstract": "Is there a restaurant you’ve always wanted to check out, but haven’t been able to because they don’t take reservations and the lines are out the door? Here at Yelp, we’re trying to solve problems just like these and delight consumers with streamlined dining experiences. Yelp Waitlist is part of the Yelp Restaurants product suite, and its mission is to take the mystery out of everyday dining experiences, enabling you to get in line at your favorite restaurant through just the tap of a button. For diners, in addition to joining an online waitlist, Yelp Waitlist provides live wait times...",
            "author": "Shweta Joshi, Machine Learning Engineer",
            "date": "12:12:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/wait_list_system_preview.png",
            "link": "https://engineeringblog.yelp.com/2019/12/architecting-wait-time-estimations.html",
            "title": "Architecting Restaurant Wait Time Predictions"
        },
        {
            "abstract": "At Yelp, we use Cassandra to power a variety of use cases. As of the date of publication, there are 25 Cassandra clusters running in production, each with varying sizes of deployment. The data stored in these clusters is often required as-is or in a transformed state by other use cases, such as analytics, indexing, etc. (for which Cassandra is not the most appropriate data store). As seen in previous posts from our Data Pipeline series, Yelp has developed a robust connector ecosystem around its data stores to stream data both into and out of the Data Pipeline. This two-part...",
            "author": "Andrew Prudhomme, Software Engineer and Harshal Dalvi, Engineering Manager",
            "date": "12:5:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/2019-12-04-csource-part-1/cdc-publisher-pkey-partitioning.jpeg",
            "link": "https://engineeringblog.yelp.com/2019/12/cassandra-source-connector-part-1.html",
            "title": "Streaming Cassandra into Kafka in (Near) Real-Time: Part 1"
        },
        {
            "abstract": "At Yelp, we use a service-oriented architecture to serve our web pages. This consists of a lot of frontend services, each of which is responsible for serving different pages (e.g., the search page or a business listing page). In these frontend services, we use a couple of third-party JavaScript/CSS assets (React, Babel polyfill, etc.) to render our web pages. We chose to serve such assets using a third-party Content Delivery Network (CDN) for better performance. In the past, if a frontend service needed to use a third-party JavaScript/CSS asset, engineers had to hard-code its CDN URL. For example: <script src=\"https://cdnjs.cloudflare.com/ajax/libs/jquery/1.8.3/jquery.min.js\"...",
            "author": "Rishabh Rao, Software Engineer",
            "date": "11:20:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/organizing-and-securing-third-party-cdn-assets-at-yelp.jpg",
            "link": "https://engineeringblog.yelp.com/2019/11/organizing-and-securing-third-party-cdn-assets-at-yelp.html",
            "title": "Organizing and Securing Third-Party CDN Assets at Yelp"
        },
        {
            "abstract": "Earlier this year, I wrote a blog post showing off some cool features of our in-house compute cluster autoscaler, Clusterman (our Cluster Manager). This time, I’m back with two announcements that I’m really excited about! Firstly, in the last few months, we’ve added another supported backend to Clusterman; so not only can it scale Mesos clusters, it can also scale Kubernetes clusters. Second, Clusterman is now open-source on GitHub so that you, too, can benefit from advanced autoscaling techniques for your compute clusters. If you prefer to just read the code, you can head there now to find some examples...",
            "author": "David R. Morrison, Compute Infra Tech Lead",
            "date": "11:11:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/clusterman_logo.png",
            "link": "https://engineeringblog.yelp.com/2019/11/open-source-clusterman.html",
            "title": "Remember Clusterman? Now It's Open-Source, and Supports Kubernetes Too!"
        },
        {
            "abstract": "Inside TensorFlow It’s probably not surprising that Yelp utilizes deep neural networks in its quest to connect people with great local businesses. One example is the selection of photos you see in the Yelp app and website, where neural networks try to identify the best quality photos for the business displayed. A crucial component of our deep learning stack is TensorFlow (TF). In the process of deploying TF to production, we’ve learned a few things that may not be commonly known in the Data Science community. TensorFlow’s success stems not only from its popularity within the machine learning domain, but...",
            "author": "Bronek Kozicki, Software Engineer",
            "date": "11:8:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/tensorflow-build-dockerfile.png",
            "link": "https://engineeringblog.yelp.com/2019/11/inside-tensorflow.html",
            "title": "Inside TensorFlow"
        },
        {
            "abstract": "Visualizing how code is used across the organization is a vital part of our engineers’ day-to-day workflow - and we have a *lot* of code to search through! This blog post details our journey of adopting Sourcegraph at Yelp to help our engineers maintain and dig through the tens of gigabytes of data in our git repos! Here at Yelp, we maintain hundreds of internal services and libraries that power our website and mobile apps. Examples include our mission-critical “emoji service” which helps translate and localize emojis, as well as our “homepage service” which… you guessed it, serves our venerable...",
            "author": "Mark Larah, Dennis Coldwell and Kevin Chen",
            "date": "11:1:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/2019-11-01-winning-the-hackathon-with-sourcegraph/award.jpg",
            "link": "https://engineeringblog.yelp.com/2019/11/winning-the-hackathon-with-sourcegraph.html",
            "title": "Winning the Hackathon with Sourcegraph"
        },
        {
            "abstract": "During Asian Pacific American Heritage Month, ColorCoded (a Yelp employee resource group) hosted a panel discussion called “Beyond Labels: Stories of Asian Pacific Islanders (API)* at Yelp.” We heard stories from five API Yelpers about their cultural backgrounds, identities, and thoughts on what it means to be an API in today’s world. Their stories helped us understand that identity is both multilayered and contextual, and that individuality goes beyond labels. Read more from their unique perspectives below. Tenzin Kunsal, Events + Partnerships, Engineering Recruiting From a young age, I knew the concept of “home” was complicated. Like many refugees, my...",
            "author": "Tenzin Kunsal, Nivedita Mittal,Gabe Ramos, Julie Truong, Wing Yung",
            "date": "10:28:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/api-blog-image.jpg",
            "link": "https://engineeringblog.yelp.com/2019/10/beyond-labels-stories-of-asian-pacific-islanders-at-yelp.html",
            "title": "Beyond Labels: Stories of Asian Pacific Islanders at Yelp"
        },
        {
            "abstract": "At Yelp, we are heavy users of both Spark and Redshift. We’re excited to announce spark-redshift-community, a fork from databricks’ original spark-redshift project. spark-redshift is a Scala package which uses Amazon S3 to efficiently read and write data from AWS Redshift into Spark DataFrames. After the open source project effort was abandoned in 2017, the community has struggled to keep up with updating dependencies and fixing bugs. The situation came to a complete halt upon release of Spark 2.4 which was sharply incompatible with the latest spark-redshift. Developers looking for a solution turned to online threads on websites like StackOverflow...",
            "author": "Luca Giovagnoli, Software Engineer",
            "date": "10:25:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/2019-10-25-open-sourcing-spark-redshift-community/nounprojbuildsoftware.png",
            "link": "https://engineeringblog.yelp.com/2019/10/open-sourcing-spark-redshift-community.html",
            "title": "Open sourcing spark-redshift-community"
        },
        {
            "abstract": "At this year’s WWDC, Apple unveiled SwiftUI, a framework that helps developers build declarative user interfaces. At Yelp, we were immediately excited about it and were looking for a way to start adopting it. We decided that our Apple Watch application was the perfect candidate for modernization using SwiftUI and were excited to explore a redesign with this new framework. At Yelp, one of the things we pride ourselves on is the quality of our content. Yelp users have posted hundreds of millions of reviews and photos. As we set out to re-imagine the user interface for our Apple Watch...",
            "author": "Thibaud Robelain, Software Engineer",
            "date": "10:21:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/redesigning-yelp-watch-swiftui.png",
            "link": "https://engineeringblog.yelp.com/2019/10/redesigning-yelp-for-apple-watch-with-swiftui.html",
            "title": "Redesigning Yelp for Apple Watch with SwiftUI"
        },
        {
            "abstract": "Discovering Popular Dishes with Deep Learning Introduction Yelp is home to nearly 200 million user-submitted reviews and even more photos. This data is rich with information about businesses and user opinions. Through the application of cutting-edge machine learning techniques, we’re able to extract and share insights from this data. In particular, the Popular Dishes feature leverages Yelp’s deep data to take the guesswork out of what to order. For more details on the product itself, check out our product launch blog post. The Popular Dishes feature highlights the most talked about and photographed dishes at a restaurant, gathering user opinions...",
            "author": "Anna Furlong and Parthasarathy Gopavarapu, Machine Learning Engineers",
            "date": "10:8:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/popular-dishes-preview.jpg",
            "link": "https://engineeringblog.yelp.com/2019/10/discovering-popular-dishes-with-deep-learning.html",
            "title": "Discovering Popular Dishes with Deep Learning"
        },
        {
            "abstract": "Last month, we held our first Awesome Women in Engineering (AWE) Summit at our headquarters in San Francisco. AWE’s mission is to build a strong community for women and allies in our engineering and product departments by facilitating professional career-building activities, leadership, and mentorship opportunities. As a resource group, we provide support and organize activities targeted towards professional growth for women, helping them to maximize their potential at Yelp and beyond. The summit was an internal, half-day event for women and allies in engineering and product at Yelp. We had previously hosted a summit for our EU offices, but this...",
            "author": "Dorothy Jung, Software Engineer",
            "date": "10:4:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/awe-summit-sf.jpg",
            "link": "https://engineeringblog.yelp.com/2019/10/first-awe-summit-sf.html",
            "title": "Hosting Our First Awesome Women in Engineering Summit in SF"
        },
        {
            "abstract": "Finding that first job in the tech industry can be a daunting task. You might not get a response to your application, or maybe you’ll move forward with the interview, but it doesn’t pan out in the end. You might wonder, “How are other people successful at getting offers? What do others do differently? What’s the secret to getting through this arduous process?” The answer is pretty simple: lots of practice. While there’s never a guarantee of getting an offer, following these recommendations can increase your chances of successfully going through the interview process and potentially landing your dream job!...",
            "author": "Nina Yang, Software Engineer",
            "date": "9:9:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/interview-prep-blog-image.png",
            "link": "https://engineeringblog.yelp.com/2019/09/breaking-down-technical-interview.html",
            "title": "Breaking Down Technical Interviews"
        },
        {
            "abstract": "The ability to quickly serve search results is essential for Yelp. Ranking performance has a significant impact on the time it takes to process a search request, and it’s crucial for fast ranking that we can quickly look up the data that’s fed into our machine learning models. Per-document map-like data is especially challenging in this regard, as traditional approaches often read and decode the full map only to look up a single value within that map later on. MapType is a custom Elasticsearch datatype that provides an optimized look-up approach for such data. Let’s start by discussing a concrete...",
            "author": "Guenther Starnberger, Tech Lead",
            "date": "7:30:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/maptype.svg",
            "link": "https://engineeringblog.yelp.com/2019/07/maptype-fast-doc-value-lookups-for-map-data-in-elasticsearch.html",
            "title": "Maptype — fast doc-value lookups for map data in Elasticsearch"
        },
        {
            "abstract": "In an ongoing effort to break down our monolithic applications into microservices here at Yelp, we’ve migrated several business flows to modern architecture using AWS Step Functions. Transactional ordering at Yelp covers a wide variety of verticals, including food (delivery/takeout orders), booking, home services, and many more. These orders are processed via Step Functions, where each is represented as an execution instance of the workflow, as shown below. Figure 1: Illustrative Step Functions Workflow for Transactions Orders Each step in the above workflow is an “activity,” and Yelp implements these activities as batch daemons, which interact with AWS Step Functions...",
            "author": "Devesh Chourasiya, Jingjing Gu",
            "date": "6:26:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/sfn_autoscaler.png",
            "link": "https://engineeringblog.yelp.com/2019/06/autoscaling-aws-step-functions-activities.html",
            "title": "Autoscaling AWS Step Functions Activities"
        },
        {
            "abstract": "Today we’re proud to introduce Bento, an open source framework for building modularized Android user interfaces, created here at Yelp. Over the past year, we’ve seen great developer productivity gains and product design flexibility from using Bento on our most critical screens. In this post we’ll explain a bit about how Bento works, why you might want to use it, and where we want to go next. What is Bento? We named this framework after the wonderfully compartmentalized Japanese lunch container. A Bento box is a container with dividers to separate different food items from each other. If you squint...",
            "author": "Tyler Argo, Software Engineer",
            "date": "5:2:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/bento_preview.png",
            "link": "https://engineeringblog.yelp.com/2019/05/introducing-bento.html",
            "title": "Introducing Bento"
        },
        {
            "abstract": "In 2017, Yelp had over 40 Jira administrators to allow different teams across the organization to perform administrative tasks. With lots of admins came lots of changes, which lead to our Jira environment accumulating hundreds of orphaned workflows, screens, and schemes. To solve this problem, we built a scalable solution that empowers our engineers to create Jira projects themselves using code and source control – ensuring 100% standardization across all engineering projects and making Jira easier to manage, simpler to use, and better performing. This blog post will cover Yelp's use of Ansible to manage Jira server project creation, updates,...",
            "author": "Jose Martin de Vidales Biurrun, Application Engineer",
            "date": "4:3:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/ansile_flow.png",
            "link": "https://engineeringblog.yelp.com/2019/04/Scaling-Jira-Server-Administration-For-The-Enterprise.html",
            "title": "Jira & Ansible: Scaling Jira Server Administration for the Enterprise"
        },
        {
            "abstract": "This year Yelp sponsored the second annual Tech Intersections conference in Oakland, CA. It was a great opportunity to celebrate womxn of color in tech and to come together and learn from each other’s successes, challenges, and experiences. The conference, which featured ALL womxn speakers and attendees, highlighted topics ranging from tech entrepreneurship to self-care and career skills. Kelly Greenia, Engineering Recruiter, with some Yelp Swag! Two members of Yelp’s Awesome Women in Engineering (AWE) group attended the conference and below are some of their takeaways. This past weekend, we had the opportunity to attend the Tech Intersections conference at...",
            "author": "Mariana Gonzalez, Technical Diversity Recruiting Partner",
            "date": "3:4:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/tech-intersections-conference.png",
            "link": "https://engineeringblog.yelp.com/2019/03/tech-intersections-conference.html",
            "title": "Tech Intersections Conference"
        },
        {
            "abstract": "Here at Yelp, we host a lot of servers in the cloud. In order to make our website more reliable—yet cost-efficient during periods of low utilization—we need to be able to autoscale clusters based on usage metrics. There are quite a few existing technologies for this purpose, but none of them really meet our needs of autoscaling extremely diverse workloads (microservices, machine learning jobs, etc.) at Yelp’s scale. In this post, we’ll describe our new in-house autoscaler called Clusterman (the “Cluster Manager”) and its magical ability to unify autoscaling resource requests for diverse workloads. We’ll also describe the Clusterman simulator,...",
            "author": "David R. Morrison, Compute Infra Tech Lead",
            "date": "2:19:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/clusterman.png",
            "link": "https://engineeringblog.yelp.com/2019/02/autoscaling-mesos-clusters-with-clusterman.html",
            "title": "Autoscaling Mesos Clusters with Clusterman"
        },
        {
            "abstract": "The eleventh round of the Yelp Dataset Challenge ran throughout the first half of 2018 and we received many impressive, original, and fascinating submissions. As usual, we were struck by the quality of the entries: keep up the good work, folks! Today, we are proud to announce the grand prize winner of the $5,000 award: “Generalized Latent Variable Recovery for Generative Adversarial Networks” by Nicholas Egan, Jeffrey Zhang, and Kevin Shen (from the Massachusetts Institute of Technology, Department of Electrical Engineering and Computer Science). The authors used a Deep Convolutional Generative Adversarial Network (DCGAN) to create photo-realistic pictures of food...",
            "author": "Yelp Dataset Challenge team",
            "date": "2:6:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/dataset_map.jpg",
            "link": "https://engineeringblog.yelp.com/2019/02/yelp-dataset-challenge-round11-winner.html",
            "title": "Yelp Dataset Challenge: Round 11 Winners"
        },
        {
            "abstract": "Here at Yelp we use Kafka extensively. In fact, we send billions of messages a day through our various clusters. Behind the scenes, Kafka uses Zookeeper for various distributed coordination tasks, such as deciding which Kafka broker is in charge of assigning partition leaders and storing metadata about the topics in its brokers. Kafka’s success within Yelp has also meant that our clusters have grown substantially from when they were first deployed. At the same time, our other heavy Zookeeper users (e.g., Smartstack and PaasTA) have increased in scale, putting more load on our shared Zookeeper clusters. To alleviate this situation, we...",
            "author": "Toby Cole, Engineering Manager",
            "date": "1:17:2019",
            "image": "https://engineeringblog.yelp.com/images/previews/kafka_zk_preview.png",
            "link": "https://engineeringblog.yelp.com/2019/01/migrating-kafkas-zookeeper-with-no-downtime.html",
            "title": "Migrating Kafka's Zookeeper With No Downtime"
        },
        {
            "abstract": "Summary At Yelp, we generate a wide array of high throughput data streams spanning logs, business data, and application data. These streams need to be joined, filtered, aggregated, and sometimes even quickly transformed. To facilitate this process, the engineering team has invested a significant amount of time analyzing multiple stream processing frameworks, ultimately identifying Apache Flink as the best suited option for these scenarios. We’ve now implemented a join algorithm using Flink, which we’re calling “Joinery.” It is capable of performing un-windowed one-to-one, one-to-many, and many-to-many inner joins across two-or-more keyed data streams. So, how does it work? In the...",
            "author": "Vipul Singh, Technical Lead",
            "date": "12:11:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/joinery_preview.jpg",
            "link": "https://engineeringblog.yelp.com/2018/12/joinery-a-tale-of-unwindowed-joins.html",
            "title": "Joinery: A Tale of Un-Windowed Joins"
        },
        {
            "abstract": "Security and usability are often at odds with one another, a fact that is best illustrated by access control. Deny everyone, and you’ll have a super secure system that no one can use; allow everyone, and you’ll maximize usability at the cost of security. The Principle of Least Privilege exists to balance both security and usability by giving users only the minimum amount of access they need to do their job. This reduces the attack surface by preventing attackers from leveraging a compromised user’s important, albeit unused, privileges for vertical/horizontal escalation. The Problem That said, there are a few key...",
            "author": "Aaron Loo, Engineering Manager",
            "date": "11:19:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/ttl-as-a-service-diagram.png",
            "link": "https://engineeringblog.yelp.com/2018/11/ttl-as-a-service.html",
            "title": "TTL as a Service: Automatic Revocation of Stale Privileges"
        },
        {
            "abstract": "All About Yelp Hackathon By: Alex Phillips It’s time for our fall Hackathon! At Yelp, Hackathons are two-day events that provide unstructured time for our engineering and product teams to work on whatever may scratch their creative itch! Hackathon truly embodies our company values of “Playing Well with Others” and “Being Unboring,” as it invites us to participate in so many different ways. Engineers have the liberty to work on projects related to or completely outside the box of the Yelp product. We’ve seen many types of projects over the years from music videos and new photo classification algorithms to...",
            "author": "Alexandra Phillips, Engineering Manager",
            "date": "11:7:2018",
            "image": "https://engineeringblog.yelp.comundefined",
            "link": "https://engineeringblog.yelp.com/2018/11/all-about-yelp-hackathon.html",
            "title": "All About Yelp Hackathon"
        },
        {
            "abstract": "Introduction My name is Abrar Sheikh, and I’m a backend engineer on Yelp’s Distributed Systems team. Our team enables real-time data transfers between microservices and different data stores by building streaming infrastructure on top of Kafka using technologies like Python, Scala, and Apache Flink. I suffer from a genetic disorder called Albinism, which is mainly characterized by two things: Lack of pigmentation in the body, resulting in a white skin and hair tone. Severe loss of vision, which limits the ability to perform routine tasks such as driving, reading, or using computers. Growing up, I was fascinated by computers. Luckily...",
            "author": "Abrar Sheikh, Software Engineer",
            "date": "10:29:2018",
            "image": "https://engineeringblog.yelp.comundefined",
            "link": "https://engineeringblog.yelp.com/2018/10/a-guide-to-software-engineering-for-the-visually-impaired.html",
            "title": "A Guide to Software Engineering for the Visually Impaired"
        },
        {
            "abstract": "Documentation is something that many of us in software and site reliability engineering struggle with – even if we recognize its importance, it can still be a struggle to write it consistently and to write it well. While we in Yelp’s Production Engineering group are no different, over the last few quarters we’ve engaged in a concerted effort to do something about it. One of the first steps towards changing this process was developing our documentation style guide, something that started out as a Hackathon project late last year. I spoke about it when I was giving my talk on...",
            "author": "Chastity Blackwell, Site Reliability Engineer",
            "date": "10:16:2018",
            "image": "https://engineeringblog.yelp.comundefined",
            "link": "https://engineeringblog.yelp.com/2018/10/yelp-production-engineering-documentation-style-guide.html",
            "title": "The Yelp Production Engineering Documentation Style Guide"
        },
        {
            "abstract": "Every day, we ship the Yelp experience to millions of users through our website and mobile apps. Our design team is committed to shaping the best interfaces to make Yelp easier to understand and more practical for users. Writing a review should be as simple as searching for a restaurant or reserving a table on Yelp. The Yelp experience must be consistent across all products and platforms where we ship our applications. For this reason, every app has to comply with our trusty Yelp style guide. This post will explain how we’ve built an Android library around our style guide...",
            "author": "Nicola Corti, Software Engineer",
            "date": "10:8:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/how-we-are-keeping-our-android-ui-consistent.png",
            "link": "https://engineeringblog.yelp.com/2018/10/how-we-are-keeping-our-android-ui-consistent.html",
            "title": "How We’re Keeping Our Android UI Consistent"
        },
        {
            "abstract": "At Yelp we pride ourselves on employee inclusiveness and building employee resource groups. We are excited to share with you the learnings of our first Awesome Women in Engineering (AWE) Summit in Europe, a one-day event on diversity and inclusion, leadership, and tech. We have two engineering offices in Europe, located in Hamburg and London. The AWE groups from both offices recently joined forces and co-organized the summit. The event was open to all Yelpers and the sessions were recorded so that we could share them with other Yelpers who weren’t able to attend. The summit opened up public speaking...",
            "author": "Alina Radu and Yenny Cheung, Security Engineer and Software Engineer",
            "date": "8:3:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/awe-eu-summit.jpg",
            "link": "https://engineeringblog.yelp.com/2018/08/first-awe-eu-summit.html",
            "title": "First AWE EU Summit"
        },
        {
            "abstract": "Round 10 Winners The tenth round of the Yelp Dataset Challenge ran throughout the second half of 2017 and we received many impressive, original, and fascinating submissions. As usual, we were struck by the quality of the entries: keep up the good work, folks! Today, we are proud to announce the grand prize winner of the $5,000 award: “Understanding Hidden Memories of Recurrent Neural Networks” by Yao Ming, Shaozu Cao, Ruixiang Zhang, Zhen Li, Yuanzhe Chen, Yangqiu Song, and Huamin Qu (from the Hong Kong University of Science and Technology). These authors developed a visual analytics method for understanding and...",
            "author": "Sébastien C., Data Scientist",
            "date": "8:2:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/dataset_map.jpg",
            "link": "https://engineeringblog.yelp.com/2018/08/yelp-dataset-challenge-round10-winner.html",
            "title": "Yelp Dataset Challenge: Round 10 Winners And Round 12 Announcement"
        },
        {
            "abstract": "Yelp hit a big milestone last week: ten years ago, Yelp launched on the Apple App Store! On July 10th, 2008, Apple officially launched what was then known as the iPhone App Store, giving iPhone users their first-ever opportunity to run third-party native apps on their devices. It launched with a whopping 552 apps available for download, including the Yelp app! At the time, Yelp was only available in the U.S. (we would launch in Canada a few weeks later), and offered an incredible breadth of functionality: you could search for businesses, read reviews, and even bookmark! Staggering. It’s not...",
            "author": "Bill Meltsner, Tech Lead",
            "date": "7:16:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/yelp-ios-10th-birthday-preview.jpg",
            "link": "https://engineeringblog.yelp.com/2018/07/happy-10th-birthday-to-yelp-on-ios.html",
            "title": "Happy 10th Birthday to Yelp on iOS!"
        },
        {
            "abstract": "In our previous blog post, we made changes to the app that improved the initial rendering performance and scroll performance of the search results in the Yelp android app. In this blog post, we’ll cover how we monitor the performance of these changes and future changes to the app to ensure no performance regressions occur and undo all of our hard work! Step 3: Monitoring Performance Improvements Making changes that improve performance is great, but there’s no point in making these improvements if future changes by engineers could undo all the hard work you’ve done to get to this point....",
            "author": "Tyler Argo, Software Engineer",
            "date": "6:21:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/android-perf-preview-part-3.png",
            "link": "https://engineeringblog.yelp.com/2018/06/android-search-perf-improvements-part-3.html",
            "title": "Performance Improvements for Search on The Yelp Android App - Part 3"
        },
        {
            "abstract": "We are always looking for new ways to bolster our security posture to keep our users and businesses safe. Today, we’re happy to announce that we will be open-sourcing our detect-secrets framework to prevent secrets from being committed to our codebase. This aligns well with our value to always Protect the Source and adds to our growing collection of secure-by-default frameworks which bolster web security without compromising employee productivity. The Problem Secrets in source code are points of weakness in an otherwise secure system because they are available to any and all repository contributors, cloned, copied and distributed. And each...",
            "author": "Aaron Loo, Engineering Manager",
            "date": "6:11:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/2018-06-08-yelps-secret-detector/diagram.png",
            "link": "https://engineeringblog.yelp.com/2018/06/yelps-secret-detector.html",
            "title": "Yelp's Secret Detector: Preventing Secrets in Source Code"
        },
        {
            "abstract": "When the Yelp Android App was first built it was a monolith, with almost everything inside a single module. Single modules are easier to deal with; there are no complex dependency graphs to account for and some details of how the app is managed, such as how testing is implemented, are simpler. Eventually the app and company structure grew to a size where the monolith made code changes and testing harder, where modularization would help the app scale. After some discussion we decided to break the app into modules, thinking carefully about how we structured the app. We’ll discuss our...",
            "author": "Sanae Rosen, Software Engineer",
            "date": "6:4:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/modularization_preview.svg",
            "link": "https://engineeringblog.yelp.com/2018/06/how-yelp-modularized-the-android-app.html",
            "title": "How Yelp Modularized the Android App"
        },
        {
            "abstract": "Since its inception in 2013, Yelp has grown its transactions platform to tens of millions of orders. With this growth, it’s become slow and cumbersome to rely solely on MySQL for searching and retrieving user orders. Transactions at Yelp are built around integrations with dozens of external fulfillment partners across different verticals, from food ordering to spa reservations. In most of these integrations, Yelp takes care of payment processing. Given this, the way we store order details prioritizes facilitating stateful order processing in a uniform way. However, other access patterns like finding popular orders by category or fetching a user’s...",
            "author": "Dmitriy Kunitskiy, Software Engineer",
            "date": "6:1:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/fast-order-search.png",
            "link": "https://engineeringblog.yelp.com/2018/06/fast-order-search.html",
            "title": "Fast Order Search Using Yelp’s Data Pipeline and Elasticsearch"
        },
        {
            "abstract": "In our previous blog post, we established a performance improvement lifecycle and explored the first step by defining what metrics we wanted to measure and establishing a baseline on which we can improve. In this blog post, we’ll cover how we improved our two metrics of initial render timings and scroll performance when rendering search results in the Yelp Android app. Step 2: Making Performance Improvements Not all changes we made were specific to only one of our goals. Often times, a change that was expected to contribute to one goal also had an effect on the other. We used...",
            "author": "Tyler Argo, Software Engineer",
            "date": "5:17:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/AndroidPerfPart2Preview.png",
            "link": "https://engineeringblog.yelp.com/2018/05/android-search-perf-improvements-part-2.html",
            "title": "Performance Improvements for Search on The Yelp Android App - Part 2"
        },
        {
            "abstract": "In our previous post, we discussed how we used PySpark to build a large-scale distributed machine learning model. In this post, we will describe our experience and some of the lessons learned while deploying PySpark code in a production environment. Yelp’s systems have robust testing in place. It’s a hallmark of our engineering. It allows us to push code confidently and forces engineers to design code that is testable and modular. Broadly speaking, we found the resources for working with PySpark in a large development environment and efficiently testing PySpark code to be a little sparse. By design, a lot...",
            "author": "Alex Gillmor and Shafi Bashar,  Machine Learning Engineers",
            "date": "5:14:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/code_pic.png",
            "link": "https://engineeringblog.yelp.com/2018/05/pyspark-coding-practices-lessons-learned.html",
            "title": "PySpark Coding Practices: Lessons Learned"
        },
        {
            "abstract": "Here at Yelp our core mission is to connect users with great local businesses. On the engineering side, that requires us to tackle big data and machine learning problems. One of the natural ways to apply machine learning to our core mission is to deliver relevant and personalized business recommendations. This helps us deliver great content to users. For example, we can let users know when a hot and new coffee shop we think they will love opens in their neighborhood through push notifications or features like collections. This is an area of active research and development at Yelp, and...",
            "author": "Shafi Bashar and  Alex Gillmor,  Machine Learning Engineers",
            "date": "5:7:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/block_matrix_multiplication.svg",
            "link": "https://engineeringblog.yelp.com/2018/05/scaling-collaborative-filtering-with-pyspark.html",
            "title": "Scaling Collaborative Filtering with PySpark"
        },
        {
            "abstract": "#perfmatters At Yelp, we’ve been working hard to improve the performance of our search results on mobile devices (iOS and Android). We know that performance matters from a numbers perspective, but another reason why we’ve decided to invest more in performance is due to a recent increase in user studies commissioned by Yelp. We noticed that most users “grunted or made noises when waiting for search to load”. We took this as a sign that something needed to be done! In our quest to make search faster on the Android mobile app client, we broke down performance into two different...",
            "author": "Tyler Argo, Software Engineer",
            "date": "5:2:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/android-perf-preview-part-1.png",
            "link": "https://engineeringblog.yelp.com/2018/05/android-search-perf-improvements-part-1.html",
            "title": "Performance Improvements for Search on The Yelp Android App - Part 1"
        },
        {
            "abstract": "What is Salsa? Salsa is an open source library that renders iOS views and exports them into a Sketch file. We built Salsa to help bridge the gap between design and engineering in an effort to create a single source of truth for visual styling of UI. Why use Salsa A few years ago, we started putting together a library of common components that developers and designers could use to build features. Initially, we had to manually maintain consistency between the designs in Sketch and their implementations in code. When we only had a handful components, this wasn’t difficult to...",
            "author": "Max Rabiciuc, Software Engineer",
            "date": "4:24:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/2018-04-24-open-sourcing-salsa.png",
            "link": "https://engineeringblog.yelp.com/2018/04/open-sourcing-salsa.html",
            "title": "Introducing Salsa: A tool for exporting iOS components into Sketch"
        },
        {
            "abstract": "Many enterprise professionals use passwords that are weak and easily compromised. Equipped with this knowledge, as well as the exposure of more and more password leaks, dictionary attacks focused on compromised or popular passwords have become increasingly effective. As such, the National Institute of Standards and Technology recommends password blacklisting as a highly-effective means of preventing such attacks. Unfortunately, use of password blacklisting countermeasures has remained a relatively new innovation that has not yet achieved widespread corporate adoption. At Yelp, however, we strive to add the latest and greatest defense mechanisms to our arsenal, which is why we adopted such...",
            "author": "Leeren Chang, Software Engineer",
            "date": "4:16:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/ad-password-blacklisting.png",
            "link": "https://engineeringblog.yelp.com/2018/04/ad-password-blacklisting.html",
            "title": "Active Directory Password Blacklisting"
        },
        {
            "abstract": "Since Yelp introduced its real-time streaming data infrastructure, “Data Pipeline”, it has grown in scope and matured vastly. It now supports some of Yelp’s most critical business requirements in its mission to connect people with great local businesses. Today, it has expanded into a diverse ecosystem of connectors sourcing data from Kafka and MySQL, and sinking data into Cassandra, Elasticsearch, Kafka, MySQL, Redshift, and S3. To ensure that the whole ecosystem is functioning correctly, Yelp’s Data Pipeline infrastructure is continually growing its repertoire of reliability techniques such as write-ahead logging, two-phase commit, fuzz testing, monkey testing, and black-box auditing to...",
            "author": "Jacob Park, Software Engineering Intern",
            "date": "4:12:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/2018-04-12-black-box-auditing.png",
            "link": "https://engineeringblog.yelp.com/2018/04/black-box-auditing.html",
            "title": "Black-Box Auditing: Verifying End-to-End Replication Integrity between MySQL and Redshift"
        },
        {
            "abstract": "Casper is a caching proxy designed to intercept traffic flowing between internal Yelp services. It is built with Nginx and OpenResty at its core and contains some logic in Lua to fit in our ecosystem. Today we’re proud to announce that Casper is opensource and available on Github. To introduce the context in which Casper was created, this post outlines a few basics about Yelp’s SOA, explains the technical decisions behind Casper’s design, and finally exposes concrete problems that we’ve encountered while rolling it out and running it in our production environment. Moving past “Memcached for everything” Yelp has had...",
            "author": "Arnaud Brousseau, Software Engineer",
            "date": "3:12:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/caching-internal-service-calls-at-yelp.png",
            "link": "https://engineeringblog.yelp.com/2018/03/caching-internal-service-calls-at-yelp.html",
            "title": "Caching Internal Service Calls at Yelp"
        },
        {
            "abstract": "With hundreds of engineers, developers and designers working on Yelp, ensuring visual consistency across Yelp is a challenging task. We’ve been migrating our web components from Yelp Cheetah to React to increase designer and developer productivity while ensuring visual consistency across our web app. Along the way, we built Lemon Reset - a package containing consistent, cross-browser React DOM tags, powered by CSS Modules. Since our design system components are the building blocks of our frontend, we had to port them to React as the first step before our developers could port their features. We made a lot of design...",
            "author": "Theresa Ma, Software Engineer",
            "date": "3:5:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/sg-desktop.png",
            "link": "https://engineeringblog.yelp.com/2018/03/css-in-the-age-of-react.html",
            "title": "CSS in the Age of React: How We Traded the Cascade for Consistency"
        },
        {
            "abstract": "Introduction The collection and processing of logs is essential to good security. One of the primary functions of a security team is to keep organizations safe by eliminating blind spots in infrastructure. Breach investigations without logs result in a lot of guesswork. Worse, the activities of an attacker can easily remain undiscovered without adequate logging. To ensure we have a robust log storage and visualization platform, we use Elasticsearch, Logstash and Kibana (ELK). These tools form part of the toolset that we use in our Security Incident and Event Monitoring (SIEM) solution. ElastAlert is the primary means by which alerts...",
            "author": "Yonny Tonui, Information Security Engineer",
            "date": "3:2:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/logfeeder.png",
            "link": "https://engineeringblog.yelp.com/2018/03/introducing-logfeeder.html",
            "title": "Introducing LogFeeder - A log collection system"
        },
        {
            "abstract": "As a recruiter, I talk to a lot of people about what it’s like to work at Yelp. Most often, I find myself answering questions about the work environment and individual growth opportunities. During my four and a half years at Yelp, I would summarize the people here as very sharp and intelligent, while also humble and open minded. This spirit has fostered an environment that encourages individuals to learn by trying things for themselves (new hires get to push code out their first week!) and empowers them to ask questions. This collaborative work culture invites tremendous opportunity and gives...",
            "author": "Grace Jiras, University Recruiting Manager",
            "date": "2:14:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/awe-book.png",
            "link": "https://engineeringblog.yelp.com/2018/02/celebrating-the-women-of-yelp-awe-the-book.html",
            "title": "Celebrating the Women of Yelp: AWE the Book"
        },
        {
            "abstract": "Introduction MySQLStreamer is an important application in Yelp’s Data Pipeline infrastructure. It’s responsible for streaming high-volume, business-critical data from our MySQL clusters into our Kafka-powered Data Pipeline. When we rolled out the first test version of MySQLStreamer, the system operated at under 100 messages/sec. But for it to keep up with our production traffic, the system needed to process upwards of thousands of messages/sec (MySQL databases at Yelp on an average receive over hundreds of millions of data manipulation requests per day, and tens of thousands of queries per second). In order to make that happen, we used a variety...",
            "author": "Abrar Sheikh, Software Engineer",
            "date": "2:5:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/replication_handler_preview.png",
            "link": "https://engineeringblog.yelp.com/2018/02/making-30x-performance-improvements-on-yelps-mysqlstreamer.html",
            "title": "Making 30x performance improvements on Yelp’s MySQLStreamer"
        },
        {
            "abstract": "Yelp Dataset Challenge Round 11 Is On! The eleventh round of the Yelp Dataset Challenge has opened. It will run until June 30, 2018. As in the past, the Yelp Dataset Challenge gives college students access to reviews and businesses from 11 metropolitan areas scattered over 4 different countries. This time around, there are a staggering 5.26 million reviews written by 1.3 million users about 175,000 businesses, as well as 146,350 check-ins and 1.1 million tips left by these users. Moreover, we have added photos about these businesses in a separate file, for convenience. With such a trove of data,...",
            "author": "Sébastien C., Data Scientist",
            "date": "1:29:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/dataset_map.jpg",
            "link": "https://engineeringblog.yelp.com/2018/01/dataset-challenge-round-11.html",
            "title": "Yelp Dataset Challenge Round 11 Announcement and Kaggle Weekly Kernel Award"
        },
        {
            "abstract": "Growing Cache Friendly Trees In case you missed it, Part I of this blog series outlines how we built a distributed machine learning platform to train gradient boosted tree (GBT) models on large datasets. While we were able to observe significant improvements in offline metrics, the resulting models are too large for standard XGBoost prediction libraries to meet our latency requirements. As result, we were unable to launch the models in production as we needed to serve ads within 50ms (p50) and evaluating these large models caused time-out exceptions. This article will discuss how we compressed and reordered the trees...",
            "author": "Niloy Gupta, Software Engineer - Machine Learning",
            "date": "1:17:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/tree-preorder.png",
            "link": "https://engineeringblog.yelp.com/2018/01/growing-cache-friendly-trees-part2.html",
            "title": "Scaling Gradient Boosted Trees for CTR Prediction - Part II"
        },
        {
            "abstract": "Building a Distributed Machine Learning Pipeline As a part of Yelp’s mission to connect people with great local businesses, we help businesses reach potential customers through advertising and organic search results. The goal of Yelp’s advertising platform is to show relevant businesses to users without compromising their experience with the product. In order to do so, we’ve built a click-through-rate (CTR) prediction model that determines whether or not to serve ads from a particular advertiser. The predicted CTR determines how relevant the business is to the user’s intention and how much would need to be bid to beat a competitor...",
            "author": "Niloy Gupta, Software Engineer - Machine Learning",
            "date": "1:9:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/dist-xgboost.png",
            "link": "https://engineeringblog.yelp.com/2018/01/building-a-distributed-ml-pipeline-part1.html",
            "title": "Scaling Gradient Boosted Trees for CTR Prediction - Part I"
        },
        {
            "abstract": "Yelp Dataset Challenge Round 9 Winners The ninth round of the Yelp Dataset Challenge ran throughout the first half of 2017 and, as usual, we received a large number of highly impressive and interesting submissions. Needless to say, we were struck by the quality of the entries: keep up the good work! Today, we are proud to announce the grand prize winner of the $5,000 award: “CORALS: Who are My Potential New Customers? Tapping into the Wisdom of Customers’ Decisions” by Ruirui Li, Chelsea J-T Ju, Jyunyu Jiang, and Wei Wang (from the Department of Computer Science of the University...",
            "author": "Sébastien C., Data Scientist",
            "date": "1:8:2018",
            "image": "https://engineeringblog.yelp.com/images/previews/dataset_map.jpg",
            "link": "https://engineeringblog.yelp.com/2018/01/yelp-dataset-challenge-round9-winner.html",
            "title": "Yelp Dataset Challenge Round 9 Winner"
        },
        {
            "abstract": "Earlier this year, Gmail users across the globe were affected by one of the largest phishing attacks of its kind. Yelp emails were among the many corporate email systems that experienced this Google Docs phishing attack. Fortunately, our security engineers had already prepared for this level of security threat and were able to delete the suspicious emails before impacting employees. As phishing attacks have become more and more prevalent, the need for new tools and countermeasures to protect users has become more important than ever. According to the last IBM X-Force Threat Intelligence Index report, the amount of spam email...",
            "author": "Jose Martin de Vidales Biurrun, Application Engineer",
            "date": "12:20:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/gset_preview.png",
            "link": "https://engineeringblog.yelp.com/2017/12/keeping-yelp-two-steps-ahead-how-we-built-gset-to-protect-employee-email.html",
            "title": "Keeping Yelp two steps ahead: How we built GSET to protect employee email"
        },
        {
            "abstract": "As we’ve discussed in earlier blog posts, Yelp Engineering has been working hard to break down our largest monolithic code base (yelp-main) for the past few years. We’ve made great progress but some of our oldest, most critical code remains within yelp-main. A great example of an older, more established system is our monthly subscription billing cycle. The system is core to how Yelp collects revenue and has proven technically challenging and risky to transition. The Revenue engineering team knows these older systems should be moved into services, but the challenge of extracting tangled, business-critical code has proven expensive and...",
            "author": "Scott Triglia, Tech Lead",
            "date": "11:27:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/preview_state_machine.png",
            "link": "https://engineeringblog.yelp.com/2017/11/breaking-down-the-monolith-with-aws-step-functions.html",
            "title": "Breaking down the monolith with AWS Step Functions"
        },
        {
            "abstract": "We deeply value code review and feel that it’s crucial to being a high-functioning engineering organization. Code review results in higher quality code that is more broadly understood. It also lets engineers learn from their peers, practice mentorship, and engage in open dialog and discussion about what they build. The benefits of code review align well with Yelp’s value Play Well with Others and support our culture of continually teaching and learning. As our organization has continued to grow, there are certain patterns that have made code reviews more beneficial and keep them from becoming a bottleneck. We’ve been following...",
            "author": "Jonathan Maltz, Software Engineer",
            "date": "11:20:2017",
            "image": "https://engineeringblog.yelp.comundefined",
            "link": "https://engineeringblog.yelp.com/2017/11/code-review-guidelines.html",
            "title": "Code Review Guidelines"
        },
        {
            "abstract": "Yelp returned to Grace Hopper Celebration once more, this time in Orlando! Let’s take a look at what GHC2017 is all about from the insights of our attendees. Who Neha H.: Android engineer @ Search User Experience team Grace J.: Recruiting manager @ University Recruiting team Tiffany K.: Product manager @ Contributions team Lauren C: Product designer @ Messaging team Xun T.: Software engineer @ Ad Creative team, first time speaker at GHC this year. Favorite sessions during GHC Tiffany: Women Who Build The Product Management Journey. I really appreciated hearing from women leaders who have been successful in the...",
            "author": "Rachel Zhao, Engineering Manager",
            "date": "11:3:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/ghc-orlando-preview.jpg",
            "link": "https://engineeringblog.yelp.com/2017/11/yelp-returned-to-grace-hopper-once-more-in-orlando.html",
            "title": "Yelp @ Grace Hopper - Orlando Edition!"
        },
        {
            "abstract": "Meet Brittany Cheng, a 5-star Product Manager! Learn what she loves about product management and how she has grown over her career here at Yelp.\n\n\n\nAre you interested in building great products? Do you love working with different teams? Are you motivated by the user experience?\n\nMentorship, ownership, and great people — we’ve got it all. Bring your ideas to life and join our all-star Product Management team! Head to https://www.yelp.com/careers to learn more.",
            "author": "Erin Rusonis",
            "date": "10:19:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/day_in_life_pm.png",
            "link": "https://engineeringblog.yelp.com/2017/10/day-in-the-life-of-a-product-manager.html",
            "title": "Day in the Life of a Product Manager"
        },
        {
            "abstract": "Monitoring the health of our systems is a critical part of maintaining Yelp’s infrastructure. We collect millions of data points that help us observe the performance and status of our services. This data powers visualization and monitoring systems so that we can alert on anomalies and derive actionable insights, especially during on-call procedures. SignalFx is our preferred vendor for metrics visualization and monitoring. They provide a rich UI with many robust analytics capabilities. At Yelp’s scale, we use SignalFx to create hundreds of detectors, charts and dashboards. Managing and finding these resources quickly is a challenge. Our engineering teams need...",
            "author": "Antonio Verardi, Yashashree Kokje, Software Engineers",
            "date": "10:6:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/signalform_preview.png",
            "link": "https://engineeringblog.yelp.com/2017/10/signalform-charts-as-code-with-signalfx-and-terraform.html",
            "title": "SignalForm: Charts as Code with SignalFx and Terraform"
        },
        {
            "abstract": "What is HTTP Strict Transport Security? HTTP Strict Transport Security, commonly referred to as HSTS, is a Web standard that aims to ensure all web resources off a domain are fetched over a secure transport layer. The core objective of HSTS is to protect users against passive and active network attacks. To this end, it prevents protocol downgrade attacks and blocks insecure click throughs. From a configuration perspective, HSTS is an easy to deploy HTTP header. Its format is: Strict-Transport-Security: max-age=31536000; includeSubDomains; preload Unfortunately, many companies who have tried to deploy HSTS have experienced various challenges, some of which resulted...",
            "author": "Martin Georgiev, Application Security Tech Lead",
            "date": "9:11:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/the-road-to-hsts-preview.png",
            "link": "https://engineeringblog.yelp.com/2017/09/the-road-to-hsts.html",
            "title": "The Road To HSTS"
        },
        {
            "abstract": "Starting today, Yelp Events data will be available through our Fusion API and GraphQL API to provide rich, local events data in our API as part of our developer beta program. Since launching Yelp Fusion last September, we’ve seen developers use our business data in unique and interesting ways and are excited to see what our developer community will do with the addition of events data. If you’re not already familiar, Yelp Events is a place where you can create, share and discover upcoming events happening worldwide. Events range from everything from beer festivals to art shows to Shakespeare in...",
            "author": "Tomer Elmalem, Software Engineer",
            "date": "9:6:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/yelp-api-developer-preview.png",
            "link": "https://engineeringblog.yelp.com/2017/09/introducing-yelp-events-data-to-our-developer-apis.html",
            "title": "Introducing Yelp Events Data to Our Developer APIs"
        },
        {
            "abstract": "Introducing The Yelp Open Dataset About five years ago, we announced the Yelp Dataset Challenge: a competition that lets students explore and research with the help of our large corpus of data. Each participant can also formally submit their projects for the chance to win prizes. Over the years we’ve seen incredible interest and usage of our dataset for educational purposes. We’ve had teachers use it to teach their classes about databases, engineers use it learn graph databases, and students use it to understand machine learning. We’re very proud of this type of usage and are continuing to encourage more...",
            "author": "Tomer Elmalem, Software Engineer",
            "date": "8:30:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/yelp-open-dataset.png",
            "link": "https://engineeringblog.yelp.com/2017/08/yelp-open-dataset-and-dataset-challenge-round-10.html",
            "title": "Yelp Open Dataset and Dataset Challenge Round 10"
        },
        {
            "abstract": "Automated testing is really important for ensuring your code is bug-free and works as expected but UI tests are particularly challenging as they tend to be flaky and unreliable. For an app like Yelp, a lot of tests are needed so developers will often see tests flake. You can look at test history to try and figure out if a test failure is your fault or not - and building tools to do so has been something we’ve invested time into - but you might be wrong and it takes time and effort to figure this out. This leads to...",
            "author": "Sanae Rosen, Software Engineer",
            "date": "8:24:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/autosuppress.svg",
            "link": "https://engineeringblog.yelp.com/2017/08/auto-suppressing-tests-for-more-reliable-code-in-our-android-app.html",
            "title": "Auto-suppressing Tests for More Reliable Code in our Android App"
        },
        {
            "abstract": "Brotli is a compression algorithm from Google that has been making waves recently. You may have heard about its average 10-20% filesize savings over gzip, at comparable decompression speeds. This makes it a very irresistable format for serving static content, but it still has immature support from CDNs, which puts it out of reach for general widespread availability. A search run over HTTP Archive data indicates that there are around 25 web properties serving Brotli Content-Encoding URLs from Fastly, the CDN we use to host our static content, as of July 25th. While Fastly does not automatically convert content to...",
            "author": "Stephen Arthur, Software Engineer",
            "date": "7:26:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/brotli.svg",
            "link": "https://engineeringblog.yelp.com/2017/07/progressive-enhancement-with-brotli.html",
            "title": "Progressive Enhancement with Brotli"
        },
        {
            "abstract": "Fred Wang has already done a lot. He graduated from U Penn’s Wharton School with degrees in Finance and Operations Management and then headed to New York City to co-found a startup. No big deal. Finding himself at a crossroads a few years later, he decided to try his luck on the west coast and joined Yelp’s new (at the time) Associate Product Manager (APM) program. Since his two-year anniversary at Yelp Eat24 is right around the corner, we decided to ask him a few questions about his experiences. Here’s what he had to say. Q: As a recent grad,...",
            "author": "Erin Rusonis",
            "date": "7:20:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/fwang-preview.jpg",
            "link": "https://engineeringblog.yelp.com/2017/07/what-does-a-yelp-associate-product-manager-do.html",
            "title": "What Does A Yelp Associate Product Manager Do? Fred Wang Shares All"
        },
        {
            "abstract": "At Yelp, pagelets are a server-side optimization to parallelize the rendering of web pages across multiple web workers (loosely inspired by Facebook’s Big Pipe). We’ve implemented this and have been running it successfully in production for a while now. This blog post is about our journey implementing and rolling out pagelets, including what we’ve learned since the initial rollout. Pagelets at Yelp: an overview Main and pagelet workers Usually a request made to Yelp is fulfilled by a single web worker. This worker is in charge of generating a response (in the form of an HTTP packet, with headers and...",
            "author": "Arnaud Brousseau, Software Engineer",
            "date": "7:6:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/generating-web-pages-in-parallel-with-pagelets.png",
            "link": "https://engineeringblog.yelp.com/2017/07/generating-web-pages-in-parallel-with-pagelets.html",
            "title": "Generating Web Pages in Parallel with Pagelets, the Building Blocks of Yelp.com"
        },
        {
            "abstract": "While newer search engines at Yelp typically use Elasticsearch as a backend, Yelp’s core business search used its own custom backend, built directly on top of Lucene. This system was one of the oldest systems at Yelp to still be deployed in production. Some features of this custom search engine were Distributed Lucene instances Master-slave architecture Custom text analysis support for various languages Custom business ranking which relied mostly on using business features (think business attributes like reviews, name, hours_open, service_areas, etc.) Derived Yelp analytics data to improve quality of search results; e.g. most popular queries for a business Problems...",
            "author": "Umesh Dangat, Software Engineer",
            "date": "6:29:2017",
            "image": "https://engineeringblog.yelp.comundefined",
            "link": "https://engineeringblog.yelp.com/2017/06/moving-yelps-core-business-search-to-elasticsearch.html",
            "title": "Moving Yelp's Core Business Search to Elasticsearch"
        },
        {
            "abstract": "As we continue to invest in the Yelp Fusion API, we are announcing that Yelp API v2 will be discontinued on June 30, 2018. If you are currently using v2 API endpoints, you have until June 30, 2018 to move them over to the Yelp Fusion API. We hope this gives everyone sufficient time to transition your applications from Yelp API v2 to Yelp Fusion, giving you the ability to tap into awesome new features like GraphQL, which we launched last month. Here is a summary of the Yelp API v2 sunset timeline: April 1, 2017 - Disabled Yelp API...",
            "author": "Quy L., Product Mananger",
            "date": "6:28:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/yelp-api-developer-preview.png",
            "link": "https://engineeringblog.yelp.com/2017/06/upcoming-deprecation-of-yelp-api-v2.html",
            "title": "Upcoming Deprecation of Yelp API v2"
        },
        {
            "abstract": "Yelp Dataset Challenge Round 8 Winners The eighth round of the Yelp Dataset Challenge ran throughout the first half of 2017 and, as usual, we received a large number of very impressive and interesting submissions. Today, we are proud to announce the grand prize winner of the $5,000 award: “Clustered Model Adaption for Personalized Sentiment Analysis” by Lin Gong, Benjamin Haines, and Hongnin Wang (from the Department of Computer Science of the University of Virginia). The authors built a personalized sentiment classification model at the group level. Their model is based on social theories about group psychology and how human...",
            "author": "Sébastien C., Data Scientist",
            "date": "6:23:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/dataset_map.jpg",
            "link": "https://engineeringblog.yelp.com/2017/06/dataset-round-8-winners.html",
            "title": "Yelp Dataset Challenge Round 8 Winner"
        },
        {
            "abstract": "This past April (2017) we finally migrated our monolith to PaaSTA (our open source PaaS based on Apache Mesos). Yes, although Yelp does subscribe to the Service-Oriented-Architecture theory and we constantly try to reduce the scope of the monolith, realistically it still looms over us as a large towering codebase that pays the bills. But that doesn’t mean we can’t try to constantly improve it. This blog post is about our latest improvement to the monolith: treating it just like any other service at Yelp and running it on PaaSTA. Background: What is Yelp’s Monolith Made Of? Yelp’s monolith is...",
            "author": "Kyle Anderson, Site Reliability Engineer",
            "date": "6:19:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/monolith-on-paasta.png",
            "link": "https://engineeringblog.yelp.com/2017/06/monolith-on-paasta.html",
            "title": "Moving the Rest of the Monolith to PaaSTA"
        },
        {
            "abstract": "Yelp has over 100 million user-generated photos ranging from pictures of dinners or haircuts, to one of our newest features, #yelfies. These images account for a majority of the bandwidth for users of the app and website, and represent a significant cost to store and transfer. In our quest to give our users the best experience, we worked hard to optimize our photos and were able to achieve a 30% average size reduction. This saves our users time and bandwidth and reduces our cost to serve those images. Oh, and we did it all without reducing the quality of these...",
            "author": "Stephen Arthur, Software Engineer",
            "date": "6:1:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/image-filesize-preview.png",
            "link": "https://engineeringblog.yelp.com/2017/06/making-photos-smaller.html",
            "title": "Making Photos Smaller Without Quality Loss"
        },
        {
            "abstract": "Ever since we rolled out our zero-downtime HAProxy reload system a few years ago, we have been disappointed that it required additional investment to work well for our external load balancing on our edge. We did generate a prototype that used an intermediary qdisc so we could apply the approach, but after evaluating the prototype, and finding that Linux wasn’t going to fix the upstream Kernel issue, we decided to go another way. Our edge is different than our internal load balancing tier because we have typically terminated TLS with another great proxy: NGINX. NGINX is useful because it does...",
            "author": "Joseph Lynch, Lawrence Matthews",
            "date": "5:15:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/haproxy_nginx_preview.png",
            "link": "https://engineeringblog.yelp.com/2017/05/taking-zero-downtime-load-balancing-even-further.html",
            "title": "Taking Zero-Downtime Load Balancing even Further"
        },
        {
            "abstract": "We’re continuously adding new features to our API to make it easier for developers to integrate with our data and share great local businesses through their apps. Today, we’re releasing access to query our data via GraphQL, a graph query language. This is available immediately through our developer beta program. What is GraphQL? GraphQL is a query language for APIs that places emphasis on being able to query for exactly the data you want. I’m sure most of you at some point have thought, “I really wish this endpoint had more data,” or, “I only need one or two pieces...",
            "author": "Tomer Elmalem, Software Engineer",
            "date": "5:3:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/yelp-api-developer-preview.png",
            "link": "https://engineeringblog.yelp.com/2017/05/introducing-yelps-local-graph.html",
            "title": "Introducing Yelp's Local Graph"
        },
        {
            "abstract": "Fast feature development is critical to a company’s success. We all strive to increase developer productivity by decreasing the time to test, deploy, and monitor changes. To enable developers to push code safely, we run more than 20 million tests every day using our in-house distributed system called Seagull. 'Seagull' by Fil.Al is licensed under CC BY 2.0 What is Seagull? Seagull is a fault tolerant and resilient distributed system which we use to parallelize our test suite execution. Seagull is built using the following: Apache Mesos (manages the resources of our Seagull cluster) AWS EC2 (provides the instances that...",
            "author": "Chunky G., Software Engineer",
            "date": "4:26:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/seagull_preview.png",
            "link": "https://engineeringblog.yelp.com/2017/04/how-yelp-runs-millions-of-tests-every-day.html",
            "title": "How Yelp Runs Millions of Tests Every Day"
        },
        {
            "abstract": "Continuous Integration (CI) is a powerful tool for the Android team at Yelp. It gives us a platform to ensure quality on all eight of our Android apps, allowing us to emphasize testing and ensure our newest features aren’t breaking our oldest masterpieces. For example, we don’t want Yelfies to crash the app while you’re writing your next great review. To achieve this, we have a dedicated cluster of AWS machines running our CI server. These machines run JUnit tests, static analysis, build APKs, merge code, and send us notifications. They also work with Firebase Test Lab to start up...",
            "author": "Coltin Caverhill, Software Engineer",
            "date": "4:20:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/continuous-integration-on-android-preview.png",
            "link": "https://engineeringblog.yelp.com/2017/04/continuous-integration-on-android.html",
            "title": "Continuous Integration on Android"
        },
        {
            "abstract": "Jen W. is a backend engineer at Yelp in San Francisco and, when not running after her toddler, loves nothing more than to knit while watching superhero TV. Susanne L. is a database engineer at Yelp in San Francisco and loves to [b/h]ike the hilly city and its surroundings. Wei W. is an iOS engineer at Yelp in Hamburg and an avid (trashy) TV connoisseur in her free time. This past year at Grace Hopper, Jen, Susanne, and Wei teamed up to present “Crucial Conversations in Your Career: Increasing Your Impact,” a workshop featuring interactive skits and group discussion. This...",
            "author": "Brittany C., Jen W., Susanne L., Wei W.",
            "date": "3:8:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/ghc-cc-2017.png",
            "link": "https://engineeringblog.yelp.com/2017/03/returning-to-grace-hopper-bringing-our-workshop-back-for-round-two.html",
            "title": "Returning to Grace Hopper: Bringing our Workshop Back for Round Two"
        },
        {
            "abstract": "We’re excited to be open sourcing a tool we built during a hackathon, that helps Yelp employees meet coworkers within the company: Yelp Beans. A screenshot of the Yelp Beans app It started a little over a year ago, when I began going to orchestrated one-on-one coffee meetups in the Bay Area sponsored by a local startup. It was a program where you could meet designers, engineers, and product managers in your area for a 30 minute coffee meeting. It helped me understanding my career direction and was an opportunity to ask questions of people at varying stages in their...",
            "author": "Kent W., Engineering Manager",
            "date": "2:21:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/yelp-beans.png",
            "link": "https://engineeringblog.yelp.com/2017/02/open-sourcing-yelp-beans.html",
            "title": "Open Sourcing Yelp Beans: Bringing People Together, One Cup of Coffee at a Time"
        },
        {
            "abstract": "Since our launch of the Yelp Fusion API, we’ve been working hard over the past few months, fixing bugs people have reported on GitHub and adding missing features. We’ve also added a few things to improve the overall experience: The search endpoint got a small update on filtering by attributes. We’ve added support for filtering businesses based on whether or not they have online waitlisting, participate in Yelp Cash Back, or offer Yelp Deals. We added a public changelog to help the community keep track of changes to the API. The changelog will contain updates such as bug fixes, feature...",
            "author": "Quy L., Product Mananger",
            "date": "2:16:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/yelp-api-developer-preview.png",
            "link": "https://engineeringblog.yelp.com/2017/02/recent-improvements-to-the-fusion-api.html",
            "title": "Recent Improvements to the Fusion API (and Upcoming v2 Changes)"
        },
        {
            "abstract": "Encouraging positivity has been a central pillar to Yelp’s culture from the beginning. If a teammate rolls out a huge feature, helps you out in a bind, or just makes a funny joke, we believe you should be able to show them a small token of appreciation. That’s why we developed an internal tool called Yelp Love, a web application for sending notes of appreciation (aka love) to your coworkers within Yelp. Yelp Love started as a Hackathon effort back in 2013. Over the course of two hackathons, we rolled out Yelp Love to the entire company. Since its deployment,...",
            "author": "Sven S., Software Engineer",
            "date": "2:14:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/yelplove.png",
            "link": "https://engineeringblog.yelp.com/2017/02/open-sourcing-yelp-love.html",
            "title": "Open Sourcing Yelp Love"
        },
        {
            "abstract": "In 2014, Yelp launched pre-commit, a framework for managing pre-commit hooks. Since then, the community has contributed many different hooks to help with development in a wide variety of languages, including Python, Ruby, Go, Node.js, and Clojure. You can see a list of many of these here. Pre-commit has been invaluable in increasing the productivity of Yelp’s code base and code-reviews by making style issues a thing of the past and allowing us to easily check for broken and deprecated code usage with a variety of code linters. While pre-commit supports a number of popular languages, the goal of pre-commit...",
            "author": "benp",
            "date": "1:31:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/pre-commit.png",
            "link": "https://engineeringblog.yelp.com/2017/01/announcing-docker-hook-support-for-pre-commit.html",
            "title": "Announcing Docker Hook Support for Pre-Commit"
        },
        {
            "abstract": "Yelp Dataset Challenge Round 7 Winners The seventh round of the Yelp Dataset Challenge ran throughout the first half of 2016 and, as usual, we were impressed with the projects and ideas that came out of the challenge. Today, we are proud to announce the grand prize winner of the $5,000 award: “Semantic Scan: Detecting Subtle, Spatially Localized Events in Text Streams” by Abhinav Maurya, Kenton Murray, Yandong Liu, Chris Dyer, William W. Cohen, and Daniel B. Neill (from Carnegie Mellon University, University of Notre Dame in Indiana). The authors created a model to detect and characterize emerging topics in...",
            "author": "Sébastien C., Data Scientist",
            "date": "1:25:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/dataset_map.jpg",
            "link": "https://engineeringblog.yelp.com/2017/01/dataset-round-7-winners-and-announcing-round-9.html",
            "title": "Yelp Dataset Challenge Round 7 Winner and Announcing Round 9"
        },
        {
            "abstract": "Alexa H. has been a Product Designer at Yelp for two years, having previously graduated from California College of the Arts studying Graphic Design. This year at Grace Hopper, she co-presented “Ask questions, lots of questions: A workshop for practicing building beautiful presentations in Google Slides and giving design critique.” It was her first public speaking experience, and after watching her fantastic performance, I wanted to know more! Jenni: So Alexa, I’ll just dive right in: how did you feel about the prospect of public speaking before you submitted this proposal? Had you considered it in the past? Alexa: Well,...",
            "author": "Jenni S., Engineering Manager",
            "date": "1:19:2017",
            "image": "https://engineeringblog.yelp.com/images/previews/alexa-ghc-preview.jpg",
            "link": "https://engineeringblog.yelp.com/2017/01/what-its-like-to-be-a-first-time-speaker-at-grace-hopper.html",
            "title": "What it’s Like To Be a First-Time Speaker at Grace Hopper"
        },
        {
            "abstract": "One hundred days ago we launched Yelp’s public bug bounty program on HackerOne. Since launching the program, we received over 564 reports from 512 reporters. The distribution of the reports was as follows: Resolved: ~ 7% Informative: ~ 36% Duplicate: ~ 31% Not Applicable: ~ 26% Looking back on the first 100 days of our program, we fixed 39 vulnerabilities and paid out $13,850 in rewards. We maintained less than 24 hours response time and less than 1 month resolution time. The distribution of bug-bounty payouts over time is shown in Chart 1. Chart 1: Distribution of bug-bounty payouts over...",
            "author": "Martin Georgiev, Software Engineer",
            "date": "12:20:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/100-days-bug-bounty-program-preview.png",
            "link": "https://engineeringblog.yelp.com/2016/12/100-days-public-bug-bounty-program.html",
            "title": "First 100 Days of Yelp's Public Bug Bounty Program"
        },
        {
            "abstract": "Yelp users upload around 100,000 photos a day to a collection of tens of millions, and that rate continues to grow. In fact, we’re seeing a growth rate for photos that is outpacing the rate of reviews. These photos provide a rich tapestry of information about the content and quality of local businesses. One important aspect of photos is the type of content being displayed. In August of 2015 we introduced a system that classified restaurant photos as food, drink, outside, inside, or menu. Since then, we have trained and put into production similar systems for coffee shops and bars,...",
            "author": "Alex M., Software Engineer",
            "date": "11:29:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/photo-quality-preview.png",
            "link": "https://engineeringblog.yelp.com/2016/11/finding-beautiful-yelp-photos-using-deep-learning.html",
            "title": "Finding Beautiful Yelp Photos Using Deep Learning"
        },
        {
            "abstract": "For the past few months we’ve been spreading the word about our shiny new Data Pipeline: a Python-based tool that streams and transforms real-time data to services that need it. We wrote a series of blog posts covering how we replicate messages from our MySQL tables, how we track schemas and compute schema migrations, and finally how we connect our data to different types of data targets like Redshift and Salesforce. With all of this talk about the Data Pipeline, you might think that we here at Yelp are like a kid with a new toy, wanting to keep it...",
            "author": "Matt K., Software Engineer",
            "date": "11:17:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/300x225_yelp_data_pipeline_logo.png",
            "link": "https://engineeringblog.yelp.com/2016/11/open-sourcing-yelps-data-pipeline.html",
            "title": "Open-Sourcing Yelp's Data Pipeline"
        },
        {
            "abstract": "Ah - politics. It’s frustrating, it’s funny, it’s serious business. It is perhaps one of the best windows we have into the nature of the human condition. So we think it’s fitting that we combine politics with another window into human nature - search data. In particular, Yelp’s PR team was interested in looking at how the Republican and Democratic National Conventions affected what people looked for on Yelp. Could we confirm certain political stereotypes? Would there be surprises? Methodology From a data analysis perspective, we first need to precisely state the question before we can get to tackling it....",
            "author": "David K., Data Scientist",
            "date": "11:4:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/elephant_donkey.jpg",
            "link": "https://engineeringblog.yelp.com/2016/11/Comparing-searches-at-the-DNC-and-RNC.html",
            "title": "Comparing searches at the DNC and RNC"
        },
        {
            "abstract": "This post is part of a series covering Yelp's real-time streaming data infrastructure. Our series explores in-depth how we stream MySQL and Cassandra data at real-time, how we automatically track & migrate schemas, how we process and transform streams, and finally how we connect all of this into data stores like Redshift, Salesforce, and Elasticsearch. Read the posts in the series: Billions of Messages a Day - Yelp's Real-time Data Pipeline Streaming MySQL tables in real-time to Kafka More Than Just a Schema Store PaaStorm: A Streaming Processor Data Pipeline: Salesforce Connector Streaming Messages from Kafka into Redshift in near...",
            "author": "Shahid C., Software Engineer",
            "date": "10:17:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/full_diagram.png",
            "link": "https://engineeringblog.yelp.com/2016/10/redshift-connector.html",
            "title": "Streaming Messages from Kafka into Redshift in near Real-Time"
        },
        {
            "abstract": "Yelp is known for useful, funny, and cool reviews of all kinds of businesses, so it’s no surprise that they often get shared in other places. While we love seeing screenshots of these reviews shared on other websites, they don’t make for a great user experience. Their image formats make it easy to create and share but they become outdated, load slower than text, and make it hard for users to find out more about the business. We wanted to build something that retains screenshots’ ease of sharing while solving some their biggest shortcomings, so we created embedded reviews. Now,...",
            "author": "David W., Software Engineer",
            "date": "10:4:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/embedded_review.png",
            "link": "https://engineeringblog.yelp.com/2016/10/embedded-reviews-at-yelp.html",
            "title": "Embedded Reviews at Yelp"
        },
        {
            "abstract": "This post is part of a series covering Yelp's real-time streaming data infrastructure. Our series explores in-depth how we stream MySQL and Cassandra data at real-time, how we automatically track & migrate schemas, how we process and transform streams, and finally how we connect all of this into data stores like Redshift, Salesforce, and Elasticsearch. Read the posts in the series: Billions of Messages a Day - Yelp's Real-time Data Pipeline Streaming MySQL tables in real-time to Kafka More Than Just a Schema Store PaaStorm: A Streaming Processor Data Pipeline: Salesforce Connector Streaming Messages from Kafka into Redshift in near...",
            "author": "Ian F., Engineering Manager",
            "date": "9:27:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/data-pipeline-salesforce-connector.png",
            "link": "https://engineeringblog.yelp.com/2016/09/data-pipeline-salesforce-connector.html",
            "title": "Data Pipeline: Salesforce Connector"
        },
        {
            "abstract": "Yelp is now entirely on HTTPS! While several pages have been secured for quite some time (we began securing pages with sensitive information like passwords, credit card numbers, and even the reviews you submit, in 2008), we’ve finally made the transition to using TLS across the entirety of our website. To some, this will sound like quite the accomplishment while others may wonder why it took until mid-2016 to complete this migration. Why Now? Brief History of HTTPS Netscape created SSL in 1994 and by 2000, TLS became the default encryption protocol and the modern HTTPS spec was created. But...",
            "author": "Andrew E., Technical Lead",
            "date": "9:15:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/https.png",
            "link": "https://engineeringblog.yelp.com/2016/09/great-https-migration.html",
            "title": "The Great HTTPS Migration"
        },
        {
            "abstract": "For the past two years we’ve been running a private bug-bounty program. We worked with academic researchers and bug hunters from all over the world and, as a result, we have fixed over a hundred potential vulnerabilities, and have paid bug bounties to dozens of security experts. Today we’re launching our public bug-bounty program as our next step towards improving the security of Yelp’s systems and services. Our vulnerability reward payouts will go up to $15,000 USD for the most impactful exploits. Since getting familiar with our infrastructure may be a bit intimidating, we’ve put together some information below to...",
            "author": "Martin Georgiev, Software Engineer",
            "date": "9:6:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/yelp-bug-bounty-map-preview.png",
            "link": "https://engineeringblog.yelp.com/2016/09/yelp-public-bug-bounty-map.html",
            "title": "Yelp's Bug-Bounty Map"
        },
        {
            "abstract": "This post is part of a series covering Yelp's real-time streaming data infrastructure. Our series explores in-depth how we stream MySQL and Cassandra data at real-time, how we automatically track & migrate schemas, how we process and transform streams, and finally how we connect all of this into data stores like Redshift, Salesforce, and Elasticsearch. Read the posts in the series: Billions of Messages a Day - Yelp's Real-time Data Pipeline Streaming MySQL tables in real-time to Kafka More Than Just a Schema Store PaaStorm: A Streaming Processor Data Pipeline: Salesforce Connector Streaming Messages from Kafka into Redshift in near...",
            "author": "Matt K., Software Engineer",
            "date": "8:25:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/kafka-logo-300-225.png",
            "link": "https://engineeringblog.yelp.com/2016/08/paastorm-a-streaming-processor.html",
            "title": "PaaStorm: A Streaming Processor"
        },
        {
            "abstract": "Peter Seibel wrote that to maximize engineering effectiveness, “Let a thousand flowers bloom. Then rip 999 of them out by the roots.” Flowers, in how the metaphor applies to us, are code patterns — the myriad different functions, classes, styles, and idioms that developers use when writing code. At first, new flowers are welcome — maybe the new pattern seems easier to use, more scalable, more efficient, or more suited to some particular task than the old. As a code base grows, and the flowers proliferate, however, it becomes clear which patterns work and which don’t. Suddenly, code patterns that...",
            "author": "Evan H., Software Engineering Intern",
            "date": "8:23:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/undebt_tech_debt_preview.png",
            "link": "https://engineeringblog.yelp.com/2016/08/undebt-how-we-refactored-3-million-lines-of-code.html",
            "title": "Undebt: How We Refactored 3 Million Lines of Code"
        },
        {
            "abstract": "Brave malware analysts at Yelp have spent a lot of time looking at the digital forensics from potentially infected macOS systems, gathered using our open source project, OSXCollector. Early on, we automated parts of the analysis process, augmenting the initial set of digital forensics collected from the machines with the information gathered from the threat intelligence APIs and internal blacklists. This involved identifying potentially suspicious domains, URLs and file hashes but our approach to the analysis still required a certain degree of configuration and manual maintenance which was tedious for the malware response team. In this blog post I will...",
            "author": "Kuba S., Software Engineer",
            "date": "8:18:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/amira_logo.png",
            "link": "https://engineeringblog.yelp.com/2016/08/amira-automated-malware-incident-response-and-analysis.html",
            "title": "AMIRA: Automated Malware Incident Response and Analysis"
        },
        {
            "abstract": "This post is part of a series covering Yelp's real-time streaming data infrastructure. Our series explores in-depth how we stream MySQL and Cassandra data at real-time, how we automatically track & migrate schemas, how we process and transform streams, and finally how we connect all of this into data stores like Redshift, Salesforce, and Elasticsearch. Read the posts in the series: Billions of Messages a Day - Yelp's Real-time Data Pipeline Streaming MySQL tables in real-time to Kafka More Than Just a Schema Store PaaStorm: A Streaming Processor Data Pipeline: Salesforce Connector Streaming Messages from Kafka into Redshift in near...",
            "author": "Chia-Chi Lin, Software Engineer",
            "date": "8:11:2016",
            "image": "https://engineeringblog.yelp.comundefined",
            "link": "https://engineeringblog.yelp.com/2016/08/more-than-just-a-schema-store.html",
            "title": "More Than Just a Schema Store"
        },
        {
            "abstract": "On the Ad Backend team, we recently moved our ad analytics data from MySQL to Apache Cassandra. Here’s why we thought Cassandra was a good fit for our application, and some lessons we learned that you might find useful if you’re thinking about using Cassandra! Why Cassandra? First, a little bit about our application. We have over 100,000 paying advertisers. Every day, we calculate the numbers of views and clicks each ad campaign received the previous day and the amount of money spent by each campaign. With these analytics, we generate bills and many different types of reports. Back in...",
            "author": "Qui N. and Shafi B., Software Engineers",
            "date": "8:8:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/corgi_cassandra.png",
            "link": "https://engineeringblog.yelp.com/2016/08/how-we-scaled-our-ad-analytics-with-cassandra.html",
            "title": "How We Scaled Our Ad Analytics with Apache Cassandra"
        },
        {
            "abstract": "Yelp Dataset Challenge Round 6 Winners The sixth round of the Yelp Dataset Challenge ran throughout the second half of 2015 and we were really impressed with the projects and ideas that came out of the challenge. Today, we are proud to announce the grand prize winner of the $5,000 award: “Topic Regularized Matrix Factorization for Review Based Rating Prediction” by Jiachen Li, Yan Wang, Xiangyu Sun, Chengliang Lian, and Ming Yao (from the Language Technologies Institute, School of Computer Science, at Carnegie Mellon University). The authors created a recommender system to inform Yelpers about which business they might be...",
            "author": "Sébastien C., Data Scientist",
            "date": "8:4:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/Dataset_Map.png",
            "link": "https://engineeringblog.yelp.com/2016/08/yelp-dataset-challenge-round6-winner.html",
            "title": "Yelp Dataset Challenge Round 6 Winner"
        },
        {
            "abstract": "This post is part of a series covering Yelp's real-time streaming data infrastructure. Our series explores in-depth how we stream MySQL and Cassandra data at real-time, how we automatically track & migrate schemas, how we process and transform streams, and finally how we connect all of this into data stores like Redshift, Salesforce, and Elasticsearch. Read the posts in the series: Billions of Messages a Day - Yelp's Real-time Data Pipeline Streaming MySQL tables in real-time to Kafka More Than Just a Schema Store PaaStorm: A Streaming Processor Data Pipeline: Salesforce Connector Streaming Messages from Kafka into Redshift in near...",
            "author": "Prem Santosh Udaya Shankar, Software Engineer",
            "date": "8:1:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/replication_handler_preview.png",
            "link": "https://engineeringblog.yelp.com/2016/08/streaming-mysql-tables-in-real-time-to-kafka.html",
            "title": "Streaming MySQL tables in real-time to Kafka"
        },
        {
            "abstract": "For the past few months we’ve been working on revamping our API based off your feedback of wanting more Yelp data and functionality. Today, we’re excited to announce that the newest version of our API is entering developer preview. What’s new? We’re exposing two new features as part of the developer preview: autocomplete and transaction search. As a user performs a search, autocomplete will help them find what they want (some might even say we have the ability to read their minds). With autocomplete, a user’s search experience will feel much more intuitive. The API now exposes a search endpoint...",
            "author": "Tomer Elmalem, Software Engineer",
            "date": "7:18:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/yelp-api-developer-preview.png",
            "link": "https://engineeringblog.yelp.com/2016/07/announcing-yelp-api-v3-developer-preview.html",
            "title": "Yelp API v3 Developer Preview"
        },
        {
            "abstract": "This post is part of a series covering Yelp's real-time streaming data infrastructure. Our series explores in-depth how we stream MySQL and Cassandra data at real-time, how we automatically track & migrate schemas, how we process and transform streams, and finally how we connect all of this into data stores like Redshift, Salesforce, and Elasticsearch. Read the posts in the series: Billions of Messages a Day - Yelp's Real-time Data Pipeline Streaming MySQL tables in real-time to Kafka More Than Just a Schema Store PaaStorm: A Streaming Processor Data Pipeline: Salesforce Connector Streaming Messages from Kafka into Redshift in near...",
            "author": "Justin C., Software Engineer",
            "date": "7:14:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/data_pipeline.png",
            "link": "https://engineeringblog.yelp.com/2016/07/billions-of-messages-a-day-yelps-real-time-data-pipeline.html",
            "title": "Billions of Messages a Day - Yelp's Real-time Data Pipeline"
        },
        {
            "abstract": "One of the values that we cherish at Yelp is to “Be Unboring”. It’s the quality of never accepting “standard” as okay and the guiding principle for creating new and remarkable things. One of the ways we foster that creative spirit at Yelp Engineering is through our internal hackathons. Many remarkable projects have come out of them - some of them open sourced, some of them revealing interesting demographic insights and some of them pushing the boundaries of science & technology. The 19th edition of our internal hackathon wasn’t any different. Close to 80 fantastic projects across our engineering offices...",
            "author": "Srivatsan S., Engineering Manager",
            "date": "6:9:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/hack19.png",
            "link": "https://engineeringblog.yelp.com/2016/06/hackathon-19-color-code.html",
            "title": "Yelp Hackathon 19: Color Code"
        },
        {
            "abstract": "At Yelp we leverage Cassandra to fulfill a diverse workload that seems to combine every consistency and availability tradeoff imaginable. It is a fantastically versatile datastore, and a great complement for our developers to our MySQL and Elasticsearch offerings. However, our infrastructure is not done until it ships and is monitored. When we started deploying Cassandra we immediately started looking for ways to properly monitor the datastore so that we could alert developers and operators of issues with their clusters before cluster issues became site issues. Distributed datastores like Cassandra are built to deal with failure, but our monitoring solution...",
            "author": "Joseph Lynch, Software Engineer",
            "date": "6:1:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/cassandra_ring_two_failures.png",
            "link": "https://engineeringblog.yelp.com/2016/06/monitoring-cassandra-at-scale.html",
            "title": "Monitoring Cassandra at Scale"
        },
        {
            "abstract": "If you haven’t heard about PaaSTA before, feel free to check out the blog post introducing it. One step in creating a service is to decide how many compute resources it needs. From the inception of PaaSTA, changing a service’s resource allocation has required manually editing and pushing new configs, and service authors had to pore over graphs and alerts to determine the proper resource allocation for a service whenever load requirements changed. This changed earlier this month when autoscaling was introduced into PaaSTA. Why did we do this? Autoscaling was introduced into PaaSTA to make sure services are allocated...",
            "author": "Matt S., Software Engineer",
            "date": "5:25:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/paasta_preview.png",
            "link": "https://engineeringblog.yelp.com/2016/05/autoscaling-paasta-services.html",
            "title": "Autoscaling PaaSTA Services"
        },
        {
            "abstract": "It’s 10:00 AM and a designer just created a new icon for Yelp. At 10:05 AM iOS has received a newly versioned CocoaPod containing 1x, 2x, and 3x PNGs, Android has received an AAR Library containing mdpi, hdpi, xhdpi, and xxhdpi WebPs, and the Web CDN has a new SVG and PNG spritesheet, code to manage the PNG fallback for our IE8 users, and a new Python package to access the icon in a template. The workflow wasn’t always this streamlined and was only made possible through a cross-team collaboration with Android, iOS, Web, and Design at Yelp. With a...",
            "author": "Kent W., Software Engineer",
            "date": "5:18:2016",
            "image": "https://engineeringblog.yelp.com/images/previews/hero-list.png",
            "link": "https://engineeringblog.yelp.com/2016/05/yelpicons.html",
            "title": "Yelpicons: A Cross-Platform Icon Build System"
        }
    ]
}